[
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "West Side Neighborhood",
        "City": "Carson City",
        "State": "Nevada",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Charming studio apartment in the desirable West Side neighborhood of Carson City. This cozy unit offers a comfortable living space with modern amenities. Perfect for a first-time buyer or as an investment property. Enjoy the convenience of city living in a peaceful residential area. Don't miss this opportunity!",
        "Neighborhood Description": "The West Side neighborhood in Carson City is known for its historic charm and friendly community atmosphere. Residents enjoy tree-lined streets, local parks, and easy access to shopping and dining options.",
        "id": "aec5bce0-f825-45ca-abd6-eeb7fc106f03",
        "image_path": "../Data/Images/aec5bce0-f825-45ca-abd6-eeb7fc106f03.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Eastgate Neighborhood",
        "City": "Carson City",
        "State": "Nevada",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Modern studio apartment located in the vibrant Eastgate neighborhood of Carson City. This stylish unit features contemporary design elements and ample natural light. Ideal for a young professional or as a rental property investment. Live in the heart of the city with easy access to entertainment and recreational activities.",
        "Neighborhood Description": "The Eastgate neighborhood is a bustling area known for its diverse population and convenient location. Residents enjoy proximity to downtown amenities, schools, and scenic walking trails.",
        "id": "fa997dc7-6e20-4149-a180-dad8d892fa81",
        "image_path": "../Data/Images/fa997dc7-6e20-4149-a180-dad8d892fa81.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Northridge Neighborhood",
        "City": "Carson City",
        "State": "Nevada",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Spacious studio apartment in the sought-after Northridge neighborhood of Carson City. This bright and airy unit offers ample living space and modern finishes. Perfect for a discerning buyer looking for comfort and style. Experience urban living at its finest with easy access to shopping, dining, and entertainment options.",
        "Neighborhood Description": "Northridge is a prestigious neighborhood known for its upscale homes and well-maintained streets. Residents enjoy a sense of exclusivity along with proximity to parks, schools, and major transportation routes.",
        "id": "7313b252-bf15-4e7a-b3a1-1fb66468bd71",
        "image_path": "../Data/Images/7313b252-bf15-4e7a-b3a1-1fb66468bd71.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Lake Forest West",
        "City": "Coeur d'Alene",
        "State": "Idaho",
        "Price": "$65,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Charming mobile home nestled in the peaceful Lake Forest West neighborhood of Coeur d'Alene. This cozy 1-bedroom, 1-bathroom home offers a comfortable living space, ideal for a single person or a couple. Enjoy the serene surroundings and proximity to outdoor activities.",
        "Neighborhood Description": "Lake Forest West is a well-established neighborhood with a mix of permanent residents and vacation homes. Surrounded by lush forests and close to Lake Coeur d'Alene, residents here enjoy a tranquil setting with easy access to hiking trails and water activities.",
        "id": "4b3b2113-ba87-4bb9-9522-0458b1fdf23d",
        "image_path": "../Data/Images/4b3b2113-ba87-4bb9-9522-0458b1fdf23d.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Fernan Lake Village",
        "City": "Coeur d'Alene",
        "State": "Idaho",
        "Price": "$120,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1,000 sqft",
        "Description": "Inviting mobile home located in the desirable Fernan Lake Village neighborhood of Coeur d'Alene. This 2-bedroom, 2-bathroom home offers a spacious interior with modern amenities. Perfect for a small family or as a vacation retreat.",
        "Neighborhood Description": "Fernan Lake Village is a picturesque neighborhood known for its stunning views of Fernan Lake and the surrounding mountains. Residents here enjoy a tight-knit community vibe and easy access to outdoor recreation, including boating and fishing.",
        "id": "2f2c9f8a-3eee-4c9a-bcf6-ccebb688f3bb",
        "image_path": "../Data/Images/2f2c9f8a-3eee-4c9a-bcf6-ccebb688f3bb.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "West End",
        "City": "Hartford",
        "State": "Connecticut",
        "Price": "$2,500,000",
        "Bedrooms": 8,
        "Bathrooms": 5,
        "House Size": "8000 sqft",
        "Description": "Nestled in the prestigious West End neighborhood of Hartford, this exquisite luxury estate features elegant architecture, spacious interiors, and top-of-the-line amenities. With 8 bedrooms, 5 bathrooms, and 8000 sqft of living space, this property offers a blend of luxury and comfort. The grand foyer, gourmet kitchen, lush gardens, and stunning views make it a haven for those seeking a sophisticated lifestyle.",
        "Neighborhood Description": "The West End is known for its historic charm, tree-lined streets, and proximity to cultural attractions like museums, parks, and upscale dining. It offers a blend of urban convenience and suburban tranquility, making it a sought-after location for discerning residents.",
        "id": "9550a1dc-291a-4b05-a1cb-34dfd2239843",
        "image_path": "../Data/Images/9550a1dc-291a-4b05-a1cb-34dfd2239843.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Jamaica Plain",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$75,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "This charming mobile home in Jamaica Plain offers cozy living with modern amenities. Featuring 1 bedroom, 1 bathroom, and a comfortable living space, this home is perfect for those seeking simplicity and convenience. Enjoy the vibrant community of Jamaica Plain with its eclectic shops, parks, and dining options just a short distance away.",
        "Neighborhood Description": "Jamaica Plain is a diverse and vibrant neighborhood known for its green spaces, cultural diversity, and community spirit. Residents enjoy easy access to the Arnold Arboretum, local cafes, and a lively arts scene.",
        "id": "1c7ebaf5-7816-4f6c-9874-9865d4510917",
        "image_path": "../Data/Images/1c7ebaf5-7816-4f6c-9874-9865d4510917.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Dorchester",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$130,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1000 sqft",
        "Description": "Discover modern living in this 2-bedroom, 2-bathroom mobile home in Dorchester. With a spacious layout spanning 1000 sqft, this home offers comfort and style. Enjoy the convenience of urban living while still having a cozy retreat to call your own.",
        "Neighborhood Description": "Dorchester is a historic neighborhood with a mix of residential, commercial, and cultural spaces. Explore local eateries, parks, and historical sites while being just a short commute away from downtown Boston.",
        "id": "456905d2-adff-4204-99d7-ede757c97864",
        "image_path": "../Data/Images/456905d2-adff-4204-99d7-ede757c97864.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "West End Theatre District",
        "City": "Allentown",
        "State": "Pennsylvania",
        "Price": "$250,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1,200 sqft",
        "Description": "Discover urban living at its finest in this modern 2-bedroom condo located in the vibrant West End Theatre District. This sleek condo offers an open floor plan, high-end finishes, and stunning city views. Enjoy the convenience of city living with nearby dining, entertainment, and cultural attractions.",
        "Neighborhood Description": "The West End Theatre District is a bustling neighborhood known for its historic theaters, eclectic shops, and diverse dining options. Residents enjoy a lively atmosphere with easy access to parks, museums, and entertainment venues.",
        "id": "cce198e8-0263-4219-ada1-1f0eb39fafd4",
        "image_path": "../Data/Images/cce198e8-0263-4219-ada1-1f0eb39fafd4.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Old Allentown Historic District",
        "City": "Allentown",
        "State": "Pennsylvania",
        "Price": "$400,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1,800 sqft",
        "Description": "Step back in time with this charming 3-bedroom condo nestled in the heart of the Old Allentown Historic District. This lovingly restored condo features original architectural details, a cozy fireplace, and a private outdoor patio. Experience the best of historic charm and modern comforts in this one-of-a-kind residence.",
        "Neighborhood Description": "The Old Allentown Historic District is a picturesque neighborhood filled with beautifully preserved Victorian homes, tree-lined streets, and local cafes. Residents enjoy a sense of community and history with easy access to downtown amenities.",
        "id": "43ef7b5e-2f6b-4c97-8322-2dcb6cfd60c5",
        "image_path": "../Data/Images/43ef7b5e-2f6b-4c97-8322-2dcb6cfd60c5.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "West End",
        "City": "Aspen",
        "State": "Colorado",
        "Price": "$650,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2400 sqft",
        "Description": "Charming single-family home nestled in the sought-after West End neighborhood of Aspen. This well-maintained residence features a spacious living area, updated kitchen, and a beautiful backyard perfect for entertaining. Enjoy the convenience of being close to downtown Aspen while still experiencing a quiet and serene environment.",
        "Neighborhood Description": "West End is a historic neighborhood known for its Victorian-style homes, tree-lined streets, and proximity to hiking trails and parks. Residents enjoy a peaceful atmosphere with easy access to boutiques, restaurants, and cultural amenities.",
        "id": "0153f4a9-90ac-40ce-8308-0a2dd4c0c2a9",
        "image_path": "../Data/Images/0153f4a9-90ac-40ce-8308-0a2dd4c0c2a9.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Charming Historic District",
        "City": "Appleton",
        "State": "Wisconsin",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Discover this cozy and well-maintained studio apartment in the heart of Appleton. Featuring a modern interior design, this studio offers an open living space with plenty of natural light. The convenient location provides easy access to local shops, cafes, and parks, making it ideal for those seeking a vibrant urban lifestyle.",
        "Neighborhood Description": "The charming historic district of Appleton exudes a sense of community and character. With tree-lined streets, historic homes, and friendly neighbors, residents enjoy a peaceful atmosphere while being close to various amenities and cultural attractions.",
        "id": "7b8a2869-a569-428a-b063-7d41fd65a52d",
        "image_path": "../Data/Images/7b8a2869-a569-428a-b063-7d41fd65a52d.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Green Acres Subdivision",
        "City": "Appleton",
        "State": "Wisconsin",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Embrace the simplicity of this stylish studio apartment located in the desirable Green Acres Subdivision. This modern living space features high-quality finishes and a functional layout, perfect for urban dwellers or young professionals. Enjoy the convenience of nearby shopping centers, dining options, and recreational facilities.",
        "Neighborhood Description": "Green Acres Subdivision offers a family-friendly environment with well-maintained parks, walking trails, and a strong sense of community. Residents can benefit from excellent schools, easy access to highways, and a tranquil setting away from the hustle and bustle of the city.",
        "id": "d12cedba-1c01-46b8-a5bb-01cd946397b8",
        "image_path": "../Data/Images/d12cedba-1c01-46b8-a5bb-01cd946397b8.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Riverfront Plaza",
        "City": "Appleton",
        "State": "Wisconsin",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Indulge in luxury living with this sophisticated studio apartment in the prestigious Riverfront Plaza. Boasting panoramic views of the river and city skyline, this thoughtfully designed studio offers a blend of elegance and comfort. Experience a vibrant urban lifestyle with upscale dining, entertainment venues, and cultural hotspots just steps away.",
        "Neighborhood Description": "Riverfront Plaza is a dynamic neighborhood known for its upscale living spaces, waterfront promenades, and trendy boutiques. Residents can enjoy a mix of urban conveniences and natural beauty, with access to scenic walking paths, local markets, and a thriving arts scene.",
        "id": "4b25870d-bd79-43b9-9201-b6e8a01adce8",
        "image_path": "../Data/Images/4b25870d-bd79-43b9-9201-b6e8a01adce8.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Oak Manor",
        "City": "Fayetteville",
        "State": "Arkansas",
        "Price": "$70,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Charming mobile home in the desirable Oak Manor neighborhood of Fayetteville. This cozy 2-bedroom, 1-bathroom home offers comfortable living spaces and modern amenities. Perfect for a small family or as a starter home. Conveniently located near parks, schools, and shopping centers. Don't miss this opportunity to own a piece of tranquility in a vibrant community.",
        "Neighborhood Description": "Oak Manor is a welcoming neighborhood known for its tree-lined streets and friendly atmosphere. Residents enjoy easy access to local parks, restaurants, and entertainment options. With a strong sense of community, Oak Manor is the perfect place to call home.",
        "id": "6efe4b6b-ba4f-4abd-b7dc-d68f6f82b840",
        "image_path": "../Data/Images/6efe4b6b-ba4f-4abd-b7dc-d68f6f82b840.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Maple Grove",
        "City": "Fayetteville",
        "State": "Arkansas",
        "Price": "$130,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1100 sqft",
        "Description": "Spacious and modern mobile home located in the sought-after Maple Grove neighborhood of Fayetteville. This 3-bedroom, 2-bathroom residence boasts a well-designed floor plan, updated kitchen, and ample natural light. Ideal for those seeking a comfortable and stylish living environment. Enjoy the convenience of nearby amenities and a vibrant community.",
        "Neighborhood Description": "Maple Grove is a thriving neighborhood known for its diverse community and family-friendly atmosphere. Residents appreciate the proximity to schools, shopping centers, and recreational facilities. With a mix of residential charm and urban convenience, Maple Grove offers a balanced lifestyle for its residents.",
        "id": "cc75e578-a62d-4846-b604-1e557b03984c",
        "image_path": "../Data/Images/cc75e578-a62d-4846-b604-1e557b03984c.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Highland Park",
        "City": "Birmingham",
        "State": "Alabama",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Charming studio apartment in the vibrant Highland Park neighborhood of Birmingham. This cozy unit offers a perfect blend of modern amenities and historic charm. Ideal for singles or young professionals looking for a convenient urban lifestyle. Enjoy nearby parks, cafes, and easy access to downtown Birmingham.",
        "Neighborhood Description": "Highland Park is a historic neighborhood known for its tree-lined streets, beautiful parks, and diverse community. Residents enjoy a mix of local shops, restaurants, and cultural attractions. The area offers a great sense of community and is within close proximity to entertainment venues and outdoor recreational spaces.",
        "id": "c526bc05-18ee-4546-91b8-2226e50bcd38",
        "image_path": "../Data/Images/c526bc05-18ee-4546-91b8-2226e50bcd38.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Downtown Loft District",
        "City": "Birmingham",
        "State": "Alabama",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment in the heart of the vibrant Downtown Loft District in Birmingham. This modern unit features high-end finishes, spacious living areas, and breathtaking city views. Perfect for urban dwellers seeking a contemporary lifestyle with convenient access to top-rated dining, shopping, and entertainment options.",
        "Neighborhood Description": "The Downtown Loft District is a bustling urban neighborhood filled with trendy restaurants, art galleries, and upscale boutiques. Residents enjoy a dynamic city atmosphere with easy access to cultural events, music venues, and public transportation. The neighborhood is a hub for young professionals and creatives seeking a lively urban experience.",
        "id": "3cc81e82-5f7d-4069-b842-925bbbf9b395",
        "image_path": "../Data/Images/3cc81e82-5f7d-4069-b842-925bbbf9b395.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Nob Hill",
        "City": "Albuquerque",
        "State": "New Mexico",
        "Price": "$250,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Discover this charming Ranch-Style Home in the vibrant Nob Hill neighborhood. This beautifully maintained property features a spacious living area, a cozy fireplace, and a lovely backyard perfect for entertaining. With 3 bedrooms, 2 bathrooms, and 1800 sqft of living space, this home offers the ideal blend of comfort and style. Enjoy the unique character of this home and the convenience of living in one of Albuquerque's most sought-after areas.",
        "Neighborhood Description": "Nob Hill is a hip and historic neighborhood known for its unique shops, trendy restaurants, and lively atmosphere. Residents enjoy walkable streets lined with mature trees, stunning architecture, and a strong sense of community. From local art galleries to vintage boutiques, Nob Hill offers a diverse array of attractions for residents to explore. Experience the vibrant energy of this eclectic neighborhood while enjoying the convenience of urban living in Albuquerque.",
        "id": "e728bdf9-1e2b-4200-8c64-9be9ff57ddcb",
        "image_path": "../Data/Images/e728bdf9-1e2b-4200-8c64-9be9ff57ddcb.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "West Old Town",
        "City": "Albuquerque",
        "State": "New Mexico",
        "Price": "$350,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Embrace the charm of this Ranch-Style Home located in the historic West Old Town neighborhood. This spacious property boasts 4 bedrooms, 3 bathrooms, and 2300 sqft of living space, offering ample room for relaxation and entertainment. The home features a gourmet kitchen, elegant finishes, and a tranquil backyard oasis. Live in comfort and style in this beautifully designed residence that captures the essence of New Mexico living.",
        "Neighborhood Description": "West Old Town is a picturesque neighborhood steeped in history, featuring adobe homes, cobblestone streets, and a rich cultural heritage. Residents enjoy proximity to Old Town Plaza, where they can explore art galleries, museums, and authentic Southwestern cuisine. With its blend of tradition and modern amenities, West Old Town offers a unique living experience for those seeking a blend of heritage and contemporary living in Albuquerque.",
        "id": "00d5e2bc-4ca5-45d0-9caf-ed9112dfeb95",
        "image_path": "../Data/Images/00d5e2bc-4ca5-45d0-9caf-ed9112dfeb95.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Charming Historic District",
        "City": "Medford",
        "State": "Oregon",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Discover this cozy studio apartment nestled in the heart of Medford's charming historic district. Perfect for those seeking a minimalist lifestyle without compromising on comfort. This thoughtfully designed space offers a blend of modern convenience and historic charm. Ideal for a single occupant or as a weekend retreat. Enjoy the convenience of nearby cafes, parks, and local attractions.",
        "Neighborhood Description": "The charming historic district of Medford boasts tree-lined streets, historic architecture, and a vibrant community atmosphere. Residents enjoy easy access to boutique shops, local eateries, and cultural landmarks. Experience the beauty of historic homes and the convenience of city living in this sought-after neighborhood.",
        "id": "f386fcb9-cfa7-4b4f-8d5e-66507598c8a2",
        "image_path": "../Data/Images/f386fcb9-cfa7-4b4f-8d5e-66507598c8a2.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Scenic Hillside Views",
        "City": "Medford",
        "State": "Oregon",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Indulge in the breathtaking hillside views from this spacious studio apartment in Medford. Featuring a light-filled interior, modern finishes, and ample space for comfortable living. This residence offers a perfect blend of tranquility and convenience. Ideal for those who appreciate stunning sunsets and serene surroundings. Embrace the beauty of nature from the comfort of your own home.",
        "Neighborhood Description": "Nestled amidst scenic hills, this neighborhood in Medford offers a peaceful retreat from the hustle and bustle of city life. Residents enjoy access to hiking trails, parks, and outdoor recreational activities. Experience the beauty of nature right outside your doorstep while being just minutes away from downtown amenities and entertainment venues.",
        "id": "b5c70744-c9c8-447f-9a84-5dd63ab7e181",
        "image_path": "../Data/Images/b5c70744-c9c8-447f-9a84-5dd63ab7e181.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Mountain View",
        "City": "Helena",
        "State": "Montana",
        "Price": "$220,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Discover modern living in this stylish 1-bedroom condo in the heart of Helena. Featuring a contemporary design, this condo offers a cozy living space with ample natural light. The open kitchen is perfect for entertaining guests. Enjoy the convenience of city living with nearby amenities and easy access to parks and trails.",
        "Neighborhood Description": "Mountain View is a picturesque neighborhood nestled against the backdrop of the Helena National Forest. Residents enjoy stunning mountain views, peaceful surroundings, and a strong sense of community. With local shops, restaurants, and outdoor recreational opportunities nearby, Mountain View offers the perfect balance of urban convenience and natural beauty.",
        "id": "58a0a705-f7a6-47f6-9e92-69fb70aab44b",
        "image_path": "../Data/Images/58a0a705-f7a6-47f6-9e92-69fb70aab44b.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Riverside Park",
        "City": "Helena",
        "State": "Montana",
        "Price": "$450,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1500 sqft",
        "Description": "Luxury meets comfort in this elegant 2-bedroom condo overlooking the tranquil Riverside Park. The spacious layout includes a gourmet kitchen, inviting living area, and a private balcony with river views. Retreat to the master suite for relaxation and rejuvenation. Experience upscale living with top-notch amenities and a prime location near downtown Helena.",
        "Neighborhood Description": "Riverside Park is a coveted waterfront neighborhood offering a serene escape from city life. With the Missouri River as its backdrop, residents enjoy scenic views, lush green spaces, and a variety of outdoor activities. This vibrant community is known for its cultural events, recreational opportunities, and friendly atmosphere.",
        "id": "e8bea51d-ca8d-44de-8538-a3fd24c6787f",
        "image_path": "../Data/Images/e8bea51d-ca8d-44de-8538-a3fd24c6787f.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Mesilla Park",
        "City": "Las Cruces",
        "State": "New Mexico",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Welcome to this charming one-bedroom apartment in the desirable Mesilla Park neighborhood. This cozy yet spacious unit features modern amenities and a stylish design. Perfect for a single professional or couple looking for a comfortable living space. Enjoy the convenience of nearby parks, restaurants, and shopping centers.",
        "Neighborhood Description": "Mesilla Park is a peaceful and welcoming neighborhood known for its tree-lined streets and friendly atmosphere. Residents enjoy easy access to local cafes, farmers' markets, and cultural events. With its close-knit community feel, Mesilla Park offers a great balance of serenity and convenience.",
        "id": "3496ffad-3692-4128-a712-422dd81a0aee",
        "image_path": "../Data/Images/3496ffad-3692-4128-a712-422dd81a0aee.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Sonoma Ranch",
        "City": "Las Cruces",
        "State": "New Mexico",
        "Price": "$225,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "950 sqft",
        "Description": "Discover luxury living in this beautifully appointed two-bedroom apartment nestled in the prestigious Sonoma Ranch neighborhood. This sophisticated unit boasts high-end finishes, a gourmet kitchen, and stunning views. Ideal for those seeking elegance and comfort, this apartment offers a refined lifestyle in a sought-after community.",
        "Neighborhood Description": "Sonoma Ranch is an upscale neighborhood known for its upscale homes, golf courses, and beautiful landscapes. Residents enjoy an exclusive atmosphere with access to premium amenities, including country clubs, spas, and hiking trails. With its picturesque surroundings and upscale lifestyle, Sonoma Ranch offers a truly luxurious living experience.",
        "id": "944f478e-2b34-4eb3-a379-914f5c7df2ac",
        "image_path": "../Data/Images/944f478e-2b34-4eb3-a379-914f5c7df2ac.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Riverside",
        "City": "Grand Island",
        "State": "Nebraska",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Cozy studio apartment located in the charming Riverside neighborhood of Grand Island. This unit offers a perfect blend of comfort and convenience for a single individual or a couple. The open layout maximizes the space, creating a welcoming atmosphere. Enjoy nearby parks, cafes, and easy access to downtown amenities.",
        "Neighborhood Description": "Riverside is a family-friendly neighborhood with tree-lined streets and a strong sense of community. Residents enjoy proximity to the Platte River, offering recreational opportunities like fishing and boating. Local shops and restaurants add to the neighborhood's appeal, making it a sought-after area in Grand Island.",
        "id": "15e9d867-5989-425b-82b4-033552c65aae",
        "image_path": "../Data/Images/15e9d867-5989-425b-82b4-033552c65aae.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Lakeview",
        "City": "Grand Island",
        "State": "Nebraska",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Modern studio apartment in the desirable Lakeview neighborhood of Grand Island. This unit showcases contemporary design elements and high-end finishes. The spacious layout provides ample room for living and entertainment. Residents can enjoy easy access to the lakefront, parks, and upscale dining options.",
        "Neighborhood Description": "Lakeview is a prestigious neighborhood known for its picturesque views of the lake and upscale living. The area features well-maintained homes, tranquil streets, and proximity to recreational activities. Residents can enjoy a peaceful environment while still being close to urban conveniences.",
        "id": "6ca08685-0ef4-4c38-9afa-467a5ee4b050",
        "image_path": "../Data/Images/6ca08685-0ef4-4c38-9afa-467a5ee4b050.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Downtown",
        "City": "Grand Island",
        "State": "Nebraska",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment in the vibrant Downtown district of Grand Island. This sophisticated unit offers upscale living with top-of-the-line amenities and stunning city views. The open-concept layout exudes elegance and modernity, perfect for those seeking a prestigious urban lifestyle.",
        "Neighborhood Description": "Downtown Grand Island is the heart of the city's cultural and entertainment scene. Residents of this neighborhood enjoy easy access to theaters, restaurants, and shops. The area buzzes with energy and excitement, making it ideal for individuals who appreciate the urban lifestyle.",
        "id": "a06dc38c-487e-4357-b3d9-12478ea25aca",
        "image_path": "../Data/Images/a06dc38c-487e-4357-b3d9-12478ea25aca.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Riverside",
        "City": "Greenwich",
        "State": "Connecticut",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Discover the charm of this cozy one-bedroom apartment in the desirable Riverside neighborhood of Greenwich. This well-maintained unit features an open layout, modern kitchen, and a bright living space. Enjoy the convenience of nearby shops, restaurants, and beautiful parks. Ideal for first-time homebuyers or those seeking a comfortable retreat in a tranquil setting.",
        "Neighborhood Description": "Riverside is a picturesque neighborhood known for its tree-lined streets, waterfront views, and peaceful atmosphere. Residents enjoy easy access to the scenic Riverside Yacht Club, Bruce Park, and the charming village center with boutique shops and cafes.",
        "id": "bdcacbbb-f42c-47a0-8b2b-aeb4d81de1b3",
        "image_path": "../Data/Images/bdcacbbb-f42c-47a0-8b2b-aeb4d81de1b3.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Cos Cob",
        "City": "Greenwich",
        "State": "Connecticut",
        "Price": "$225,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "900 sqft",
        "Description": "Step into luxury living with this stunning two-bedroom apartment located in the sought-after Cos Cob neighborhood of Greenwich. This beautifully designed unit offers a spacious layout, high-end finishes, and ample natural light throughout. Experience the ultimate in comfort and style, with easy access to top-rated schools, upscale dining options, and trendy boutiques.",
        "Neighborhood Description": "Cos Cob is a vibrant community with a mix of historic charm and modern amenities. Explore the local art galleries, dine at gourmet restaurants, or take a relaxing stroll along the Cos Cob Harbor. This neighborhood is perfect for those seeking a dynamic lifestyle in a serene environment.",
        "id": "53015b5f-efa0-4387-b747-6dd95282e5d7",
        "image_path": "../Data/Images/53015b5f-efa0-4387-b747-6dd95282e5d7.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "South Hill",
        "City": "Spokane",
        "State": "Washington",
        "Price": "$3,500,000",
        "Bedrooms": 7,
        "Bathrooms": 5,
        "House Size": "9000 sqft",
        "Description": "Nestled in the prestigious South Hill neighborhood of Spokane, this luxurious estate offers unparalleled elegance and privacy. With 7 bedrooms, 5 bathrooms, and 9000 sqft of living space, this home exudes grandeur. The meticulously landscaped grounds feature a pool, tennis court, and stunning views of the surrounding mountains. Impeccably designed for both entertaining and relaxation, this is truly a masterpiece of modern luxury living.",
        "Neighborhood Description": "South Hill is known for its historic charm, tree-lined streets, and upscale ambiance. Residents enjoy proximity to boutique shopping, fine dining, and top-rated schools. The neighborhood offers a perfect blend of tranquility and convenience, making it a highly sought-after location in Spokane.",
        "id": "db311190-7c4b-4335-b6db-d079d4940c5f",
        "image_path": "../Data/Images/db311190-7c4b-4335-b6db-d079d4940c5f.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Nob Hill",
        "City": "Albuquerque",
        "State": "New Mexico",
        "Price": "$250,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1200 sqft",
        "Description": "Modern condo located in the vibrant Nob Hill neighborhood of Albuquerque. This 2-bedroom, 2-bathroom unit offers a sleek design with high-end finishes. Enjoy the convenience of urban living with nearby cafes, boutiques, and parks. The open layout and large windows provide ample natural light throughout. Ideal for those seeking a contemporary lifestyle in a lively community.",
        "Neighborhood Description": "Nob Hill is a trendy and eclectic neighborhood known for its unique shops, art galleries, and restaurants. Residents enjoy a mix of historic charm and modern amenities, with tree-lined streets and a bustling nightlife scene.",
        "id": "a5ba1bed-fa2b-43ed-afa2-87db38b85b21",
        "image_path": "../Data/Images/a5ba1bed-fa2b-43ed-afa2-87db38b85b21.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Downtown",
        "City": "Albuquerque",
        "State": "New Mexico",
        "Price": "$480,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Luxurious condo in the heart of Downtown Albuquerque offering sophisticated urban living. This spacious 3-bedroom, 2-bathroom unit features high ceilings, gourmet kitchen, and panoramic city views. The building amenities include a fitness center, rooftop terrace, and concierge services. Experience upscale living with easy access to dining, entertainment, and cultural attractions.",
        "Neighborhood Description": "Downtown Albuquerque is a vibrant district with a mix of historic architecture and modern developments. Residents enjoy proximity to museums, theaters, and trendy eateries, as well as convenient access to public transportation and major highways.",
        "id": "29c275ab-31d2-4782-8881-0f4beff47e7c",
        "image_path": "../Data/Images/29c275ab-31d2-4782-8881-0f4beff47e7c.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Riverview",
        "City": "Great Falls",
        "State": "Montana",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Cozy studio apartment in the scenic Riverview neighborhood of Great Falls. This charming unit offers a comfortable living space with a modern kitchen and a well-designed layout. Perfect for a single professional or a couple looking for a convenient yet peaceful living environment.",
        "Neighborhood Description": "Riverview is a serene neighborhood located along the Missouri River, offering beautiful views and a sense of tranquility. Residents enjoy easy access to parks, walking trails, and local dining establishments.",
        "id": "42f469f8-beb2-4ba7-af81-08cda836ec3b",
        "image_path": "../Data/Images/42f469f8-beb2-4ba7-af81-08cda836ec3b.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Highwood",
        "City": "Great Falls",
        "State": "Montana",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Modern studio apartment in the desirable Highwood neighborhood of Great Falls. This unit features stylish finishes, ample natural light, and a cozy atmosphere. Ideal for those seeking a contemporary living space in a vibrant community.",
        "Neighborhood Description": "Highwood is a lively neighborhood known for its vibrant community spirit and proximity to local amenities. Residents enjoy easy access to shopping centers, cafes, and recreational facilities.",
        "id": "3bce0857-e3f5-4203-a334-75547c2b1196",
        "image_path": "../Data/Images/3bce0857-e3f5-4203-a334-75547c2b1196.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Fox Farm",
        "City": "Great Falls",
        "State": "Montana",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment in the upscale Fox Farm neighborhood of Great Falls. This exquisite unit boasts high-end amenities, elegant design elements, and a spacious layout. Perfect for those with a taste for refined living.",
        "Neighborhood Description": "Fox Farm is an exclusive neighborhood known for its upscale homes and prestigious ambiance. Residents enjoy a sophisticated lifestyle with access to top-rated schools, fine dining establishments, and premium recreational facilities.",
        "id": "8e60511d-93b4-4ed3-8a4a-7ea6320e880d",
        "image_path": "../Data/Images/8e60511d-93b4-4ed3-8a4a-7ea6320e880d.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "West Boulevard Historic District",
        "City": "Rapid City",
        "State": "South Dakota",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "750 sqft",
        "Description": "Discover urban living in this charming one-bedroom apartment located in the desirable West Boulevard Historic District. The apartment features modern amenities and stylish finishes, offering a comfortable and convenient lifestyle. With a spacious layout and natural light, this apartment is perfect for those seeking a cozy yet sophisticated living space.",
        "Neighborhood Description": "The West Boulevard Historic District is known for its tree-lined streets, historic homes, and vibrant community atmosphere. Residents enjoy easy access to downtown Rapid City, parks, cafes, and cultural attractions, making it a sought-after neighborhood for those looking for a blend of history and modern convenience.",
        "id": "48526dd8-7c31-49bc-92a7-f21b350408b5",
        "image_path": "../Data/Images/48526dd8-7c31-49bc-92a7-f21b350408b5.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Canyon Lake",
        "City": "Rapid City",
        "State": "South Dakota",
        "Price": "$200,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "950 sqft",
        "Description": "Indulge in luxury living with this stunning two-bedroom apartment in the picturesque Canyon Lake neighborhood. Boasting high-end finishes and panoramic views, this apartment provides a sophisticated oasis for relaxation and entertainment. The open-concept layout and upscale amenities create an unparalleled living experience.",
        "Neighborhood Description": "Canyon Lake offers a tranquil setting with its namesake lake, parks, and outdoor recreational opportunities. Residents appreciate the natural beauty and peaceful ambiance of the neighborhood while being just a short drive away from downtown Rapid City, ensuring a perfect balance of serenity and convenience.",
        "id": "468e8418-9005-4b25-a0fc-61c07a51dcb7",
        "image_path": "../Data/Images/468e8418-9005-4b25-a0fc-61c07a51dcb7.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Historic Point neighborhood",
        "City": "Newport",
        "State": "Rhode Island",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Charming studio apartment in the heart of Newport's historic Point neighborhood. This cozy space offers a blend of modern convenience and historic charm, perfect for a single occupant or as a weekend getaway retreat. Close to local shops, restaurants, and waterfront attractions.",
        "Neighborhood Description": "The Historic Point neighborhood is known for its picturesque streets lined with beautifully preserved colonial-era homes. Residents enjoy a vibrant community atmosphere, with easy access to scenic waterfront areas and cultural attractions.",
        "id": "b675fe05-7516-4d3e-a0b8-f04c3db8a850",
        "image_path": "../Data/Images/b675fe05-7516-4d3e-a0b8-f04c3db8a850.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Ocean Drive",
        "City": "Newport",
        "State": "Rhode Island",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment in the prestigious Ocean Drive neighborhood of Newport. This sophisticated residence boasts high-end finishes, panoramic ocean views, and access to exclusive amenities. Ideal for those seeking a sophisticated coastal lifestyle.",
        "Neighborhood Description": "Ocean Drive is a coveted waterfront neighborhood known for its upscale estates and breathtaking coastal views. Residents enjoy proximity to scenic walking trails, upscale dining options, and the iconic Cliff Walk.",
        "id": "9bf9e018-afe0-4d0f-9b0b-4e3659a191af",
        "image_path": "../Data/Images/9bf9e018-afe0-4d0f-9b0b-4e3659a191af.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "West End",
        "City": "Hartford",
        "State": "Connecticut",
        "Price": "$3,500,000",
        "Bedrooms": 8,
        "Bathrooms": 5,
        "House Size": "9000 sqft",
        "Description": "Nestled in the prestigious West End neighborhood of Hartford, this luxurious estate offers a perfect blend of elegance and modern amenities. With 8 spacious bedrooms, 5 bathrooms, and sprawling over 9000 sqft, this home provides ample space for both relaxation and entertainment. The meticulously landscaped grounds and high-end finishes throughout the property make it a true gem for those seeking a sophisticated lifestyle.",
        "Neighborhood Description": "The West End is known for its historic charm, tree-lined streets, and proximity to parks, restaurants, and cultural attractions. Residents enjoy a vibrant community with a mix of architectural styles and a strong sense of community.",
        "id": "4bb209b6-e29c-4cb6-b496-92c3f4e78ba6",
        "image_path": "../Data/Images/4bb209b6-e29c-4cb6-b496-92c3f4e78ba6.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Willowbrook",
        "City": "Bentonville",
        "State": "Arkansas",
        "Price": "$75,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Charming mobile home in the peaceful Willowbrook neighborhood of Bentonville. This cozy home features 2 bedrooms, a well-appointed kitchen, and a spacious living area. Perfect for first-time homebuyers or those looking to downsize. Enjoy the convenience of living in Bentonville at an affordable price.",
        "Neighborhood Description": "Willowbrook is a welcoming neighborhood known for its family-friendly atmosphere and close-knit community. Residents enjoy easy access to parks, schools, and shopping, making it a desirable place to call home.",
        "id": "4c0be8f0-100d-4021-99e8-51b3f267cc10",
        "image_path": "../Data/Images/4c0be8f0-100d-4021-99e8-51b3f267cc10.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Pine Hill",
        "City": "Bentonville",
        "State": "Arkansas",
        "Price": "$125,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1100 sqft",
        "Description": "Discover this spacious mobile home located in the desirable Pine Hill neighborhood of Bentonville. With 3 bedrooms, 2 bathrooms, and a modern kitchen, this home offers comfortable living spaces for families or individuals. Enjoy the tranquility of Pine Hill while being close to all the amenities Bentonville has to offer.",
        "Neighborhood Description": "Pine Hill is a picturesque neighborhood known for its tree-lined streets and friendly residents. It provides a peaceful retreat from the hustle and bustle of city life while still being conveniently located near schools, shopping, and dining options.",
        "id": "aaad356f-4269-4197-819e-ea3503c72517",
        "image_path": "../Data/Images/aaad356f-4269-4197-819e-ea3503c72517.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Hyde Park",
        "City": "Cincinnati",
        "State": "Ohio",
        "Price": "$300,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1400 sqft",
        "Description": "Experience luxury living in this stylish condo in the vibrant Hyde Park neighborhood of Cincinnati. This beautifully designed unit features 2 bedrooms, 2 bathrooms, and 1400 sqft of modern living space. Enjoy the convenience of nearby shops, restaurants, and parks, all within walking distance. Don't miss this opportunity to own a contemporary condo in one of Cincinnati's most sought-after areas.",
        "Neighborhood Description": "Hyde Park is known for its tree-lined streets, upscale boutiques, and top-rated restaurants. Residents enjoy a mix of historic charm and modern amenities, creating a vibrant and welcoming community.",
        "id": "e563cac1-e77c-4c86-8086-8d58f0e01783",
        "image_path": "../Data/Images/e563cac1-e77c-4c86-8086-8d58f0e01783.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Over-the-Rhine",
        "City": "Cincinnati",
        "State": "Ohio",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Nestled in the heart of the trendy Over-the-Rhine neighborhood, this cozy 1-bedroom condo offers a perfect blend of comfort and urban living. With 800 sqft of space, this unit is ideal for those seeking a modern city lifestyle. Explore the vibrant arts scene, local breweries, and eclectic dining options just steps away from your doorstep.",
        "Neighborhood Description": "Over-the-Rhine is a bustling neighborhood known for its historic architecture, lively atmosphere, and artistic community. Experience the energy of this revitalized district with a diverse mix of residents and cultural attractions.",
        "id": "512e4d07-deb9-4ac4-8d55-f1f0ddb0942e",
        "image_path": "../Data/Images/512e4d07-deb9-4ac4-8d55-f1f0ddb0942e.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Greenwood",
        "City": "Warwick",
        "State": "Rhode Island",
        "Price": "$225,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1200 sqft",
        "Description": "Welcome to this charming Ranch-Style Home in the desirable Greenwood neighborhood of Warwick. This cozy 2-bedroom, 1-bathroom home offers a spacious living area, a well-equipped kitchen, and a lovely backyard perfect for relaxation. Conveniently located near schools, parks, and shopping centers, this home provides both comfort and convenience.",
        "Neighborhood Description": "Greenwood is a peaceful residential neighborhood known for its tree-lined streets and friendly community atmosphere. Residents enjoy easy access to local amenities, including restaurants, cafes, and recreational facilities.",
        "id": "c1f03268-e8f7-4a97-97c8-96a648bb482b",
        "image_path": "../Data/Images/c1f03268-e8f7-4a97-97c8-96a648bb482b.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Cowesett",
        "City": "Warwick",
        "State": "Rhode Island",
        "Price": "$375,000",
        "Bedrooms": 4,
        "Bathrooms": 2,
        "House Size": "2200 sqft",
        "Description": "Discover the beauty of this spacious Ranch-Style Home located in the sought-after Cowesett neighborhood of Warwick. Boasting 4 bedrooms, 2 bathrooms, a modern kitchen, and a generous backyard with a patio, this home is perfect for family gatherings and entertaining. Experience a harmonious blend of comfort and style in this wonderful property.",
        "Neighborhood Description": "Cowesett is a prestigious neighborhood known for its upscale homes and well-maintained surroundings. With top-rated schools, scenic parks, and upscale shopping options nearby, residents enjoy a high quality of life in this desirable community.",
        "id": "a06b79c0-8765-42df-985a-c73aa8f965c4",
        "image_path": "../Data/Images/a06b79c0-8765-42df-985a-c73aa8f965c4.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Sunset Park",
        "City": "Pueblo",
        "State": "Colorado",
        "Price": "$190,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1200 sqft",
        "Description": "Charming ranch-style home in the desirable Sunset Park neighborhood. This well-maintained property features 2 bedrooms, 1 bathroom, and 1200 sqft of comfortable living space. The home offers a cozy atmosphere with a spacious backyard perfect for outdoor gatherings. Conveniently located near parks, schools, and shopping centers.",
        "Neighborhood Description": "Sunset Park is a welcoming neighborhood in Pueblo known for its quiet streets and friendly neighbors. Residents enjoy easy access to local amenities, including restaurants, cafes, and recreational areas.",
        "id": "f6176778-d88d-40cf-9e32-1eb4b0633502",
        "image_path": "../Data/Images/f6176778-d88d-40cf-9e32-1eb4b0633502.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Riverwalk",
        "City": "Pueblo",
        "State": "Colorado",
        "Price": "$350,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2200 sqft",
        "Description": "Luxurious ranch-style home nestled in the sought-after Riverwalk neighborhood. This spacious property boasts 4 bedrooms, 3 bathrooms, and 2200 sqft of elegant living space. Featuring high-end finishes and a beautiful backyard retreat, this home offers the perfect blend of comfort and style.",
        "Neighborhood Description": "Riverwalk is a prestigious neighborhood in Pueblo known for its upscale homes and picturesque surroundings. Residents enjoy scenic views, proximity to the river, and easy access to dining, shopping, and entertainment options.",
        "id": "fdb07fb2-8194-4213-bbfe-c383ea95766c",
        "image_path": "../Data/Images/fdb07fb2-8194-4213-bbfe-c383ea95766c.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Red Cliffs",
        "City": "St. George",
        "State": "Utah",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "This cozy 1-bedroom condo in the desirable Red Cliffs neighborhood offers a perfect retreat in St. George. The unit features modern amenities and is ideal for a single individual or a couple looking for a comfortable living space.",
        "Neighborhood Description": "Red Cliffs is known for its scenic beauty and proximity to outdoor activities like hiking and biking trails. Residents enjoy a peaceful environment with stunning red rock views.",
        "id": "cea375f8-899b-44aa-9737-4f1fb83d7506",
        "image_path": "../Data/Images/cea375f8-899b-44aa-9737-4f1fb83d7506.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Sunbrook",
        "City": "St. George",
        "State": "Utah",
        "Price": "$400,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1500 sqft",
        "Description": "Located in the prestigious Sunbrook neighborhood, this 2-bedroom condo offers luxurious living spaces and high-end finishes. Enjoy panoramic views of the surrounding landscapes and upscale amenities within the community.",
        "Neighborhood Description": "Sunbrook is a premier neighborhood known for its golf courses, parks, and upscale living. Residents enjoy a resort-like lifestyle with access to top-notch recreational facilities.",
        "id": "a7139654-1d4c-4427-ba44-ff124f3a736d",
        "image_path": "../Data/Images/a7139654-1d4c-4427-ba44-ff124f3a736d.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Entrada",
        "City": "St. George",
        "State": "Utah",
        "Price": "$600,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "2000 sqft",
        "Description": "Step into luxury with this spacious 3-bedroom condo in the prestigious Entrada neighborhood. High ceilings, gourmet kitchen, and stunning views make this property a standout choice for those seeking upscale living in St. George.",
        "Neighborhood Description": "Entrada is an exclusive community known for its luxury homes and world-class amenities. Residents enjoy privacy, security, and access to the Entrada at Snow Canyon Country Club.",
        "id": "270c8277-787e-46fd-bb67-5e54254d7dcd",
        "image_path": "../Data/Images/270c8277-787e-46fd-bb67-5e54254d7dcd.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Midtown Detroit",
        "City": "Detroit",
        "State": "Michigan",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Modern one-bedroom apartment located in the vibrant Midtown Detroit area. This cozy unit features an open layout, updated kitchen with stainless steel appliances, and a spacious bedroom with ample natural light. Enjoy the convenience of being close to cultural attractions, trendy cafes, and public transportation.",
        "Neighborhood Description": "Midtown Detroit is a thriving neighborhood known for its artistic community, historic architecture, and bustling entertainment scene. Residents can explore museums, art galleries, and local shops, all within walking distance. The area also offers easy access to parks and green spaces for outdoor activities.",
        "id": "ee565c4f-2cc6-42db-a5bc-40492e5b433b",
        "image_path": "../Data/Images/ee565c4f-2cc6-42db-a5bc-40492e5b433b.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Harborside",
        "City": "Hoboken",
        "State": "New Jersey",
        "Price": "$250,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1200 sqft",
        "Description": "Charming Ranch-Style Home in the sought-after Harborside neighborhood of Hoboken. This cozy 2-bedroom, 1-bathroom home offers comfortable living spaces and a lovely backyard. Enjoy the convenience of single-level living with a touch of traditional charm. Perfect for first-time homebuyers or those looking to downsize.",
        "Neighborhood Description": "Harborside is a vibrant neighborhood known for its waterfront views, trendy cafes, and proximity to parks. Residents enjoy a mix of urban amenities and a relaxed community vibe, making it a desirable place to call home.",
        "id": "c5fc0bae-56fb-42dc-9047-9c68f9f37983",
        "image_path": "../Data/Images/c5fc0bae-56fb-42dc-9047-9c68f9f37983.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Uptown",
        "City": "Hoboken",
        "State": "New Jersey",
        "Price": "$400,000",
        "Bedrooms": 4,
        "Bathrooms": 2,
        "House Size": "2200 sqft",
        "Description": "Spacious Ranch-Style Home located in the desirable Uptown neighborhood of Hoboken. This 4-bedroom, 2-bathroom residence boasts ample living space, a modern kitchen, and a beautiful backyard for outdoor entertainment. Experience the comfort and convenience of ranch-style living in a prime location.",
        "Neighborhood Description": "Uptown is a charming and family-friendly neighborhood with tree-lined streets, top-rated schools, and a strong sense of community. Residents enjoy easy access to local shops, restaurants, and parks, creating a welcoming and peaceful atmosphere.",
        "id": "3aa79813-c467-47c1-9060-1669e0fde79e",
        "image_path": "../Data/Images/3aa79813-c467-47c1-9060-1669e0fde79e.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Harvard Square",
        "City": "Cambridge",
        "State": "Massachusetts",
        "Price": "$3,500,000",
        "Bedrooms": 7,
        "Bathrooms": 5,
        "House Size": "8000 sqft",
        "Description": "Nestled in the prestigious Harvard Square neighborhood of Cambridge, this luxury estate exudes elegance and sophistication. Boasting 7 bedrooms, 5 bathrooms, and 8000 sqft of living space, this home offers the ultimate blend of modern amenities and historic charm. The grand architecture, lush gardens, and high-end finishes make this property a true masterpiece.",
        "Neighborhood Description": "Harvard Square is a vibrant and diverse neighborhood known for its historic architecture, upscale boutiques, and world-class dining options. Residents enjoy easy access to Harvard University, picturesque parks, and cultural attractions, creating a sophisticated and dynamic community.",
        "id": "5b714644-ffcb-409d-bcc9-322d1f225df7",
        "image_path": "../Data/Images/5b714644-ffcb-409d-bcc9-322d1f225df7.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Downtown Fremont",
        "City": "Fremont",
        "State": "Nebraska",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Charming studio apartment in the heart of Downtown Fremont. This cozy space offers modern amenities and a convenient location for urban living. Featuring an open layout with natural light, this studio is perfect for a single individual or a couple looking for a low-maintenance lifestyle.",
        "Neighborhood Description": "Downtown Fremont is a vibrant neighborhood known for its historic charm, eclectic dining options, and proximity to shopping and entertainment. Residents enjoy a lively atmosphere with easy access to local parks and community events.",
        "id": "c856e3d6-e94e-4330-a27a-5dd8f6d3b76d",
        "image_path": "../Data/Images/c856e3d6-e94e-4330-a27a-5dd8f6d3b76d.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Suburban Fremont",
        "City": "Fremont",
        "State": "Nebraska",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Modern studio apartment located in the quiet suburbs of Fremont. This spacious unit features high-end finishes, a well-designed kitchen, and a comfortable living area. Ideal for those seeking a peaceful retreat with easy access to city amenities.",
        "Neighborhood Description": "Suburban Fremont offers a serene residential setting with tree-lined streets and a strong sense of community. Residents appreciate the tranquil environment while still being close to schools, shopping centers, and recreational facilities.",
        "id": "e7443a39-df49-489a-a8a3-a13c430ba1a7",
        "image_path": "../Data/Images/e7443a39-df49-489a-a8a3-a13c430ba1a7.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Sierra Meadows",
        "City": "Carson City",
        "State": "Nevada",
        "Price": "$3,500,000",
        "Bedrooms": 7,
        "Bathrooms": 5,
        "House Size": "8000 sqft",
        "Description": "Welcome to this exquisite luxury estate in Sierra Meadows, Carson City. This magnificent property boasts 7 bedrooms, 5 bathrooms, and 8000 sqft of pure luxury. From the grand foyer to the gourmet kitchen and outdoor oasis, every detail exudes elegance and sophistication. Enjoy panoramic mountain views and unparalleled privacy in this exclusive retreat.",
        "Neighborhood Description": "Sierra Meadows is a prestigious neighborhood known for its upscale homes and breathtaking views. Residents enjoy a serene setting with easy access to outdoor recreation, cultural attractions, and top-rated schools.",
        "id": "9f219162-10ec-4bbd-bbd9-6cc693630289",
        "image_path": "../Data/Images/9f219162-10ec-4bbd-bbd9-6cc693630289.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Eagle Ridge",
        "City": "Carson City",
        "State": "Nevada",
        "Price": "$4,800,000",
        "Bedrooms": 10,
        "Bathrooms": 6,
        "House Size": "12000 sqft",
        "Description": "Step into luxury living at its finest in Eagle Ridge, Carson City. This sprawling estate features 10 bedrooms, 6 bathrooms, and 12000 sqft of opulent space. With multiple living areas, a private theater, and a resort-style pool, this home offers unparalleled comfort and entertainment options. Experience the epitome of luxury living in this remarkable property.",
        "Neighborhood Description": "Eagle Ridge is an exclusive enclave of luxury estates nestled in a picturesque setting. Residents enjoy a peaceful ambiance surrounded by nature while still being close to amenities and the vibrant city life of Carson City.",
        "id": "61b07b19-7566-4f35-9143-b420b796b0d8",
        "image_path": "../Data/Images/61b07b19-7566-4f35-9143-b420b796b0d8.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Belhaven",
        "City": "Jackson",
        "State": "Mississippi",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Charming studio apartment in the historic Belhaven neighborhood of Jackson. This cozy space features a modern kitchen, ample natural light, and a convenient location near local shops and restaurants. Perfect for a young professional or student looking for a stylish urban retreat.",
        "Neighborhood Description": "Belhaven is known for its tree-lined streets, vibrant arts scene, and historic architecture. Residents enjoy easy access to Belhaven University, Belhaven Park, and the eclectic mix of cafes and boutiques that give the neighborhood its unique charm.",
        "id": "b7e17b44-3c9f-4ca7-90ad-f50202f953fb",
        "image_path": "../Data/Images/b7e17b44-3c9f-4ca7-90ad-f50202f953fb.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Fondren",
        "City": "Jackson",
        "State": "Mississippi",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Modern studio apartment in the trendy Fondren neighborhood of Jackson. This sleek space boasts high-end finishes, a private balcony, and access to community amenities such as a fitness center and rooftop terrace. Ideal for a discerning buyer seeking a contemporary urban lifestyle.",
        "Neighborhood Description": "Fondren is a hip and happening neighborhood known for its artistic vibe, lively nightlife, and diverse dining options. With galleries, music venues, and local breweries just steps away, residents of Fondren enjoy a vibrant cultural scene right at their doorstep.",
        "id": "b28ea2f9-7e64-4c15-8d31-85f8ba7a5b90",
        "image_path": "../Data/Images/b28ea2f9-7e64-4c15-8d31-85f8ba7a5b90.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Eastover",
        "City": "Jackson",
        "State": "Mississippi",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment in the prestigious Eastover neighborhood of Jackson. This elegant space features designer upgrades, panoramic views of the city skyline, and access to a concierge service and private pool. An exclusive retreat for those seeking the epitome of urban sophistication.",
        "Neighborhood Description": "Eastover is a upscale neighborhood known for its stately homes, upscale shopping, and lush green spaces. With proximity to fine dining, upscale boutiques, and top-rated schools, Eastover offers a refined lifestyle in a prime location.",
        "id": "9b26ab02-5f4c-4592-8970-33ffcd985175",
        "image_path": "../Data/Images/9b26ab02-5f4c-4592-8970-33ffcd985175.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Riverview",
        "City": "Eau Claire",
        "State": "Wisconsin",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Discover this charming 1-bedroom condo in the desirable Riverview neighborhood. This cozy space features modern amenities and an open layout, perfect for a first-time buyer or downsizer. Enjoy scenic views and convenient access to local shops and parks.",
        "Neighborhood Description": "Riverview is a peaceful neighborhood with tree-lined streets and a strong sense of community. Residents appreciate the proximity to the riverfront trails, bustling cafes, and vibrant farmers' market.",
        "id": "57bc1e7b-1ab4-4f6d-9a0d-fb9bacbb23ef",
        "image_path": "../Data/Images/57bc1e7b-1ab4-4f6d-9a0d-fb9bacbb23ef.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Downtown",
        "City": "Eau Claire",
        "State": "Wisconsin",
        "Price": "$400,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1500 sqft",
        "Description": "Luxurious 2-bedroom condo located in the heart of Downtown Eau Claire. This sophisticated unit boasts high-end finishes, a gourmet kitchen, and stunning city views. Experience urban living at its finest in this exclusive residence.",
        "Neighborhood Description": "Downtown Eau Claire offers a vibrant mix of dining, entertainment, and cultural attractions. From trendy boutiques to renowned art galleries, this neighborhood is a hub of creativity and excitement.",
        "id": "0af0640d-ec7b-429b-90e0-9cee88f8b19c",
        "image_path": "../Data/Images/0af0640d-ec7b-429b-90e0-9cee88f8b19c.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Lake Shore",
        "City": "Eau Claire",
        "State": "Wisconsin",
        "Price": "$580,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1900 sqft",
        "Description": "Impeccable 3-bedroom condo with panoramic views of Lake Shore. This upscale residence features a spacious layout, elegant decor, and top-of-the-line appliances. Indulge in lakeside living and unparalleled luxury in this prestigious address.",
        "Neighborhood Description": "Lake Shore is an exclusive waterfront community known for its upscale homes and serene environment. Residents enjoy private beach access, scenic walking trails, and a sense of tranquility amidst nature.",
        "id": "3c247147-3858-4bac-a9e9-5d8c9824eaa9",
        "image_path": "../Data/Images/3c247147-3858-4bac-a9e9-5d8c9824eaa9.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Acadiana",
        "City": "Lafayette",
        "State": "Louisiana",
        "Price": "$65,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Charming mobile home in the heart of Lafayette. This cozy 1-bedroom, 1-bathroom home offers comfortable living with a spacious yard for outdoor enjoyment. Perfect for a single individual or a couple looking to downsize. Conveniently located near shops, restaurants, and parks.",
        "Neighborhood Description": "Acadiana is a vibrant neighborhood known for its rich cultural heritage and friendly community. Residents enjoy easy access to local festivals, Cajun cuisine, and lively music scenes.",
        "id": "2d672e71-81ad-46d4-9a57-57875ac0d8dc",
        "image_path": "../Data/Images/2d672e71-81ad-46d4-9a57-57875ac0d8dc.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Freetown-Port Rico",
        "City": "Lafayette",
        "State": "Louisiana",
        "Price": "$120,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1100 sqft",
        "Description": "Spacious and well-maintained mobile home in the sought-after Freetown-Port Rico neighborhood. This 3-bedroom, 2-bathroom residence boasts modern amenities and a fenced backyard, perfect for families or those who love to entertain. Close to schools, parks, and local eateries.",
        "Neighborhood Description": "Freetown-Port Rico is a historic yet trendy neighborhood with a mix of traditional charm and artistic flair. Residents enjoy a close-knit community, local art galleries, and eclectic dining options.",
        "id": "52aca63c-76f4-44ea-a522-f89171ca37b6",
        "image_path": "../Data/Images/52aca63c-76f4-44ea-a522-f89171ca37b6.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Meadowlark Farms",
        "City": "Lawrence",
        "State": "Kansas",
        "Price": "$220,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1500 sqft",
        "Description": "Welcome to this charming townhouse in Lawrence's Meadowlark Farms neighborhood. This well-maintained property features 2 bedrooms, 2 bathrooms, and a cozy living space. The open floor plan and modern amenities make it ideal for comfortable living. Enjoy the convenience of nearby parks, schools, and shopping centers.",
        "Neighborhood Description": "Meadowlark Farms is a family-friendly neighborhood with tree-lined streets, community parks, and easy access to local amenities. Residents enjoy a peaceful environment with a strong sense of community.",
        "id": "430d5692-f679-4e23-933e-235f6cd62272",
        "image_path": "../Data/Images/430d5692-f679-4e23-933e-235f6cd62272.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Westwood Hills",
        "City": "Lawrence",
        "State": "Kansas",
        "Price": "$380,000",
        "Bedrooms": 3,
        "Bathrooms": 3,
        "House Size": "2100 sqft",
        "Description": "Discover luxury living in this elegant townhouse located in Lawrence's prestigious Westwood Hills neighborhood. This sophisticated property boasts 3 spacious bedrooms, 3 bathrooms, and a beautifully designed interior. The gourmet kitchen, private patio, and upscale finishes elevate the living experience to a new level of comfort and style.",
        "Neighborhood Description": "Westwood Hills is known for its exclusive atmosphere, upscale homes, and upscale amenities. The neighborhood offers a blend of tranquility and convenience, with easy access to top-rated schools, dining options, and recreational facilities.",
        "id": "0808e4ef-98e7-4cff-b898-2446b52fd3cc",
        "image_path": "../Data/Images/0808e4ef-98e7-4cff-b898-2446b52fd3cc.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Hillview, Lewiston",
        "City": "Lewiston",
        "State": "Maine",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Charming one-bedroom apartment in the heart of Hillview, Lewiston. This cozy unit offers a comfortable living space with modern amenities. Ideal for a single professional or a couple seeking a convenient urban lifestyle. Enjoy nearby parks, cafes, and easy access to downtown.",
        "Neighborhood Description": "Hillview is a vibrant neighborhood known for its tree-lined streets, local shops, and friendly community atmosphere. Residents here enjoy a mix of historic charm and modern conveniences, making it a sought-after location in Lewiston.",
        "id": "d1ee84b2-07f6-425a-97fa-eb79013be349",
        "image_path": "../Data/Images/d1ee84b2-07f6-425a-97fa-eb79013be349.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Riverside, Lewiston",
        "City": "Lewiston",
        "State": "Maine",
        "Price": "$210,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "900 sqft",
        "Description": "Spacious one-bedroom apartment with an additional den that can be used as a second bedroom or home office. Located in the scenic Riverside neighborhood of Lewiston, this unit offers modern finishes, ample natural light, and stunning views. Perfect for those seeking a blend of comfort and style.",
        "Neighborhood Description": "Riverside is a picturesque neighborhood nestled along the banks of the Androscoggin River. Known for its peaceful ambiance and outdoor recreational opportunities, residents here enjoy a serene living environment while still being close to urban amenities.",
        "id": "facc8ed6-b6e1-4e71-ab1d-ea9502022bcb",
        "image_path": "../Data/Images/facc8ed6-b6e1-4e71-ab1d-ea9502022bcb.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Downtown Montpelier",
        "City": "Montpelier",
        "State": "Vermont",
        "Price": "$175,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Charming one-bedroom apartment located in the heart of downtown Montpelier. This cozy unit features an open layout, updated kitchen, and a spacious bedroom. Enjoy the convenience of being close to local shops, restaurants, and parks. Perfect for a first-time homebuyer or as an investment property.",
        "Neighborhood Description": "Downtown Montpelier is known for its bustling atmosphere with a mix of historic buildings and modern amenities. Residents enjoy easy access to cafes, boutiques, and cultural attractions. The neighborhood is pedestrian-friendly and offers a vibrant community feel.",
        "id": "c4628de6-15a1-41e1-824f-11d51c234295",
        "image_path": "../Data/Images/c4628de6-15a1-41e1-824f-11d51c234295.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Shawtown",
        "City": "Eau Claire",
        "State": "Wisconsin",
        "Price": "$125,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "650 sqft",
        "Description": "Welcome to a cozy one-bedroom apartment in the charming Shawtown neighborhood of Eau Claire. This well-maintained unit offers a modern kitchen, a comfortable living space, and a peaceful bedroom retreat. Enjoy the convenience of nearby parks, restaurants, and shopping. Perfect for a young professional or a couple looking for a starter home.",
        "Neighborhood Description": "Shawtown is a historic neighborhood known for its tree-lined streets, friendly community atmosphere, and proximity to local amenities. Residents here enjoy easy access to riverside trails, cafes, and cultural attractions.",
        "id": "4af3f1e6-8591-4bd5-8156-de1a9acc7c16",
        "image_path": "../Data/Images/4af3f1e6-8591-4bd5-8156-de1a9acc7c16.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Riverview",
        "City": "Eau Claire",
        "State": "Wisconsin",
        "Price": "$210,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "900 sqft",
        "Description": "Discover urban living in the vibrant Riverview neighborhood of Eau Claire with this stylish two-bedroom apartment. The unit features a spacious layout, high-end finishes, and breathtaking views of the city skyline. Embrace a contemporary lifestyle within walking distance to trendy cafes, boutiques, and entertainment venues.",
        "Neighborhood Description": "Riverview is a lively neighborhood renowned for its waterfront setting along the Eau Claire River. Residents here enjoy a blend of nature and city living, with parks, restaurants, and cultural events just steps away.",
        "id": "d775fdc6-7440-4d20-9413-8fb9d4193366",
        "image_path": "../Data/Images/d775fdc6-7440-4d20-9413-8fb9d4193366.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Green Valley",
        "City": "Frederick",
        "State": "Maryland",
        "Price": "$275,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Welcome to this charming ranch-style home in the desirable Green Valley neighborhood of Frederick. This home features a spacious living area, updated kitchen, and a beautiful backyard perfect for entertaining. With 3 bedrooms and 2 bathrooms, this property offers comfortable living spaces and modern amenities. Enjoy the peaceful surroundings and convenience of this wonderful community.",
        "Neighborhood Description": "Green Valley is known for its friendly atmosphere, tree-lined streets, and close-knit community. Residents enjoy easy access to parks, schools, and shopping centers. It's a great place for families and individuals looking for a peaceful retreat while still being close to city amenities.",
        "id": "065a6420-044a-476e-a8db-a28eb0611a94",
        "image_path": "../Data/Images/065a6420-044a-476e-a8db-a28eb0611a94.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Clover Hill",
        "City": "Frederick",
        "State": "Maryland",
        "Price": "$350,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2200 sqft",
        "Description": "Discover this stunning ranch-style home nestled in the sought-after Clover Hill neighborhood of Frederick. Boasting 4 bedrooms and 3 bathrooms, this home offers ample space for a growing family or those who love to entertain. The open floor plan, high ceilings, and modern updates make this property a true gem. Step outside to enjoy the large backyard and peaceful surroundings.",
        "Neighborhood Description": "Clover Hill is a well-established neighborhood known for its beautiful homes, mature trees, and friendly neighbors. It's conveniently located near schools, restaurants, and major highways, making it a desirable location for those seeking a blend of tranquility and convenience.",
        "id": "7d228199-0562-4828-9714-c80c68bbdcfa",
        "image_path": "../Data/Images/7d228199-0562-4828-9714-c80c68bbdcfa.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Valley Junction",
        "City": "Des Moines",
        "State": "Iowa",
        "Price": "$225,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Welcome to this charming Ranch-Style Home in the sought-after Valley Junction neighborhood. This beautifully maintained home features 3 bedrooms, 2 bathrooms, and a spacious living area. The kitchen boasts modern appliances and opens to a lovely backyard perfect for entertaining. With its convenient location near parks and schools, this home offers comfortable living for families or individuals.",
        "Neighborhood Description": "Valley Junction is a vibrant community known for its historic charm, local shops, and dining options. Residents enjoy a welcoming atmosphere and easy access to amenities such as parks, schools, and entertainment venues.",
        "id": "221ba794-01c7-4a17-b5a6-5f8158729f9a",
        "image_path": "../Data/Images/221ba794-01c7-4a17-b5a6-5f8158729f9a.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Waterbury",
        "City": "Des Moines",
        "State": "Iowa",
        "Price": "$350,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Discover this exquisite Ranch-Style Home nestled in the peaceful Waterbury neighborhood. Boasting 4 bedrooms, 3 bathrooms, and a generous living space, this home offers modern comfort with elegant finishes. The spacious backyard provides a tranquil retreat, perfect for relaxation and outdoor gatherings. Experience luxury living in a desirable community close to amenities and major attractions.",
        "Neighborhood Description": "Waterbury is a prestigious neighborhood known for its upscale homes and serene environment. Residents enjoy a high quality of life with access to top-rated schools, parks, and upscale shopping and dining options.",
        "id": "6e25769b-0ef0-4993-bfe9-903e166a2110",
        "image_path": "../Data/Images/6e25769b-0ef0-4993-bfe9-903e166a2110.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Historic Old Town",
        "City": "Albuquerque",
        "State": "New Mexico",
        "Price": "$70,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Charming mobile home in the heart of Historic Old Town Albuquerque. This cozy 1-bedroom, 1-bathroom home offers comfortable living with a spacious living area and a small yard for outdoor enjoyment. Ideal for those looking for a peaceful retreat within a vibrant neighborhood.",
        "Neighborhood Description": "Historic Old Town is a culturally rich neighborhood filled with adobe buildings, quaint shops, and local eateries. Enjoy the blend of traditional charm and modern conveniences in this lively community.",
        "id": "2a0a40cc-2416-458d-8973-17042ae85e0e",
        "image_path": "../Data/Images/2a0a40cc-2416-458d-8973-17042ae85e0e.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Nob Hill",
        "City": "Albuquerque",
        "State": "New Mexico",
        "Price": "$130,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1000 sqft",
        "Description": "Modern mobile home located in the trendy Nob Hill neighborhood of Albuquerque. This 2-bedroom, 2-bathroom property features a contemporary design with an open floor plan, updated kitchen, and a private deck for outdoor relaxation. Perfect for those seeking urban living with style.",
        "Neighborhood Description": "Nob Hill is a hip and vibrant neighborhood known for its eclectic mix of boutiques, cafes, and art galleries. Experience the energy of this trendy district with a variety of entertainment options right at your doorstep.",
        "id": "17828c9f-d26d-498c-b02e-b90fc4dc7e7d",
        "image_path": "../Data/Images/17828c9f-d26d-498c-b02e-b90fc4dc7e7d.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Montecito",
        "City": "Santa Barbara",
        "State": "California",
        "Price": "$3,500,000",
        "Bedrooms": 8,
        "Bathrooms": 5,
        "House Size": "10,000 sqft",
        "Description": "Nestled in the prestigious Montecito community of Santa Barbara, this exquisite luxury estate offers unparalleled craftsmanship and exceptional amenities. With 8 grand bedrooms, a gourmet kitchen, stunning landscaped grounds, and a pool with panoramic ocean views, this property is a sanctuary of elegance and privacy.",
        "Neighborhood Description": "Montecito is known for its sophisticated ambiance, upscale shopping, and beautiful beaches. The neighborhood exudes luxury with its grand mansions, lush gardens, and proximity to world-class dining and entertainment.",
        "id": "2b7fd094-fcfb-4340-91f4-0db095be8381",
        "image_path": "../Data/Images/2b7fd094-fcfb-4340-91f4-0db095be8381.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "West Asheville",
        "City": "Asheville",
        "State": "North Carolina",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Discover this cozy one-bedroom apartment in the vibrant West Asheville neighborhood. The unit features modern finishes, a spacious living area, a well-equipped kitchen, and a private balcony offering stunning mountain views. Enjoy the convenience of being close to local shops, restaurants, and outdoor activities. Ideal for young professionals or couples seeking a comfortable urban lifestyle.",
        "Neighborhood Description": "West Asheville is known for its eclectic mix of boutiques, cafes, and art galleries. Residents enjoy a laid-back atmosphere with easy access to parks and green spaces. The neighborhood hosts community events and festivals, creating a dynamic and welcoming environment.",
        "id": "44d288a7-0c54-4089-8e72-0bbf2bdf3331",
        "image_path": "../Data/Images/44d288a7-0c54-4089-8e72-0bbf2bdf3331.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Historic Montford",
        "City": "Asheville",
        "State": "North Carolina",
        "Price": "$225,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "950 sqft",
        "Description": "Step into this charming one-bedroom apartment nestled in the historic Montford district of Asheville. The unit boasts elegant design elements, a gourmet kitchen, a cozy fireplace, and a private patio for outdoor relaxation. With an additional room for guests or a home office, this apartment offers versatile living spaces and modern comfort. Embrace the rich history and beauty of Montford living.",
        "Neighborhood Description": "Montford is a picturesque neighborhood known for its tree-lined streets, Victorian architecture, and historic charm. Stroll along brick sidewalks to discover local cafes, shops, and cultural landmarks. The neighborhood exudes a sense of heritage and elegance, attracting residents seeking a refined and tranquil setting.",
        "id": "15df2a8f-fa31-41b5-ab33-2293cb38ce36",
        "image_path": "../Data/Images/15df2a8f-fa31-41b5-ab33-2293cb38ce36.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Granville in Fresno",
        "City": "Fresno",
        "State": "California",
        "Price": "$250,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1200 sqft",
        "Description": "Charming ranch-style home located in the prestigious Granville neighborhood of Fresno. This cozy 2-bedroom, 1-bathroom home offers a spacious living area, a well-maintained backyard, and modern updates throughout. Enjoy the peaceful surroundings and convenient access to local amenities.",
        "Neighborhood Description": "Granville is known for its well-kept streets, friendly community vibe, and proximity to parks, schools, and shopping centers. Residents enjoy a safe and family-friendly environment with easy access to major roads.",
        "id": "7486422b-dc57-459b-8c3d-ac7374cb6789",
        "image_path": "../Data/Images/7486422b-dc57-459b-8c3d-ac7374cb6789.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Woodward Park in Fresno",
        "City": "Fresno",
        "State": "California",
        "Price": "$380,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2200 sqft",
        "Description": "Spacious ranch-style home nestled in the sought-after Woodward Park neighborhood of Fresno. This 4-bedroom, 3-bathroom residence features a large kitchen, a beautiful backyard perfect for entertaining, and ample natural light. Modern comforts meet classic charm in this inviting home.",
        "Neighborhood Description": "Woodward Park is a prestigious neighborhood known for its upscale homes, lush greenery, and proximity to the scenic Woodward Park. Residents enjoy a serene atmosphere with access to top-rated schools, dining options, and recreational facilities.",
        "id": "4ce5eff8-4f73-4a7b-bd8a-9d73ae4d5fe7",
        "image_path": "../Data/Images/4ce5eff8-4f73-4a7b-bd8a-9d73ae4d5fe7.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Tremont",
        "City": "Cleveland",
        "State": "Ohio",
        "Price": "$55,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Charming mobile home in the heart of Tremont. This cozy 1-bedroom, 1-bathroom home offers a comfortable living space with a modern kitchen and a small outdoor area. Ideal for those seeking a low-maintenance lifestyle in a vibrant neighborhood.",
        "Neighborhood Description": "Tremont is known for its historic charm, trendy restaurants, and art galleries. Residents enjoy a lively community with easy access to downtown Cleveland and beautiful parks along the Cuyahoga River.",
        "id": "a1232266-61f8-4eb6-94cf-53b0728bfc6f",
        "image_path": "../Data/Images/a1232266-61f8-4eb6-94cf-53b0728bfc6f.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Ohio City",
        "City": "Cleveland",
        "State": "Ohio",
        "Price": "$125,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1100 sqft",
        "Description": "Spacious mobile home located in the vibrant Ohio City neighborhood. This 3-bedroom, 2-bathroom home features a modern interior, a large living area, and a private backyard. Perfect for families or those who love to entertain.",
        "Neighborhood Description": "Ohio City is a trendy neighborhood with a mix of historic charm and modern amenities. The area is known for its craft breweries, hip eateries, and cultural diversity, creating a dynamic and welcoming community.",
        "id": "4d747c3e-241c-4ba3-8cf0-adef925769e1",
        "image_path": "../Data/Images/4d747c3e-241c-4ba3-8cf0-adef925769e1.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Brookside",
        "City": "Kansas City",
        "State": "Missouri",
        "Price": "$75,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Charming mobile home located in the desirable Brookside neighborhood of Kansas City. This cozy 1-bedroom, 1-bathroom home offers comfortable living with a spacious living area and a well-maintained kitchen. Perfect for those seeking a convenient and affordable housing option in a vibrant community.",
        "Neighborhood Description": "Brookside is known for its tree-lined streets, local boutiques, and trendy eateries. Residents enjoy a close-knit community vibe with easy access to parks and recreational amenities.",
        "id": "7ecaa21e-ad82-4d9b-9ff6-7d06464bb569",
        "image_path": "../Data/Images/7ecaa21e-ad82-4d9b-9ff6-7d06464bb569.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Plaza Westport",
        "City": "Kansas City",
        "State": "Missouri",
        "Price": "$120,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1000 sqft",
        "Description": "Modern mobile home in the vibrant Plaza Westport neighborhood of Kansas City. This 2-bedroom, 2-bathroom residence boasts a stylish interior, updated appliances, and a private outdoor space for relaxation. Ideal for urban dwellers seeking a blend of comfort and convenience.",
        "Neighborhood Description": "Plaza Westport offers a trendy mix of shopping, dining, and entertainment options. The area is known for its lively atmosphere and proximity to cultural attractions.",
        "id": "b027b877-3862-49ec-9d8a-cdf3894450d2",
        "image_path": "../Data/Images/b027b877-3862-49ec-9d8a-cdf3894450d2.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Northland",
        "City": "Kansas City",
        "State": "Missouri",
        "Price": "$140,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1200 sqft",
        "Description": "Spacious mobile home nestled in the peaceful Northland neighborhood of Kansas City. This 3-bedroom, 2-bathroom home features an open floor plan, modern amenities, and a large backyard for outdoor gatherings. Perfect for families looking for a comfortable living space in a serene setting.",
        "Neighborhood Description": "Northland is characterized by its picturesque landscapes, community parks, and family-friendly environment. Residents enjoy a sense of tranquility while still being within reach of city conveniences.",
        "id": "0300b791-4989-4661-bc87-d8e31cc2a64e",
        "image_path": "../Data/Images/0300b791-4989-4661-bc87-d8e31cc2a64e.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Pelican Bay",
        "City": "Naples",
        "State": "Florida",
        "Price": "$70,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Cozy mobile home nestled in the prestigious Pelican Bay neighborhood. This well-maintained property offers a perfect retreat with a comfortable bedroom, spacious living area, and a lovely outdoor space for relaxation.",
        "Neighborhood Description": "Pelican Bay is known for its upscale living, pristine beaches, and exclusive amenities. Residents enjoy access to private beach clubs, tennis courts, and lush tropical landscapes.",
        "id": "d65b34dd-0a8b-4567-b96f-65423322978e",
        "image_path": "../Data/Images/d65b34dd-0a8b-4567-b96f-65423322978e.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Golden Gate Estates",
        "City": "Naples",
        "State": "Florida",
        "Price": "$120,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1000 sqft",
        "Description": "Charming mobile home in the serene neighborhood of Golden Gate Estates. This property features two cozy bedrooms, a bright living area, and a well-appointed kitchen. Enjoy the peaceful surroundings and natural beauty of Naples.",
        "Neighborhood Description": "Golden Gate Estates offers a tranquil escape from the city's hustle and bustle. With spacious lots, scenic views, and a close-knit community, residents here experience true Florida living.",
        "id": "76cf0639-c552-4a24-a407-3643712df868",
        "image_path": "../Data/Images/76cf0639-c552-4a24-a407-3643712df868.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Lely Resort",
        "City": "Naples",
        "State": "Florida",
        "Price": "$140,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1200 sqft",
        "Description": "Spacious mobile home in the sought-after Lely Resort neighborhood. This upgraded property boasts three comfortable bedrooms, a modern kitchen, and a welcoming living space. Enjoy resort-style living at its finest.",
        "Neighborhood Description": "Lely Resort is a premier community known for its golf courses, luxurious amenities, and vibrant social scene. Residents here indulge in a lifestyle of leisure and sophistication.",
        "id": "861f84f4-2dd4-4786-bedf-0762269fee85",
        "image_path": "../Data/Images/861f84f4-2dd4-4786-bedf-0762269fee85.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Pine Street Historic District",
        "City": "Spartanburg",
        "State": "South Carolina",
        "Price": "$150,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1200 sqft",
        "Description": "Charming ranch-style home in the Pine Street Historic District. This cozy 2-bedroom, 1-bathroom residence offers a comfortable living space with a spacious backyard perfect for outdoor gatherings. The open floor plan provides a welcoming atmosphere, and the neighborhood exudes a sense of community and convenience.",
        "Neighborhood Description": "The Pine Street Historic District is known for its tree-lined streets, historical architecture, and close proximity to local shops and restaurants. Residents enjoy a peaceful ambiance with easy access to parks and cultural attractions.",
        "id": "b0c186e4-40f1-43c7-aae3-a59f5592ca69",
        "image_path": "../Data/Images/b0c186e4-40f1-43c7-aae3-a59f5592ca69.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "River Run",
        "City": "Spartanburg",
        "State": "South Carolina",
        "Price": "$320,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "2000 sqft",
        "Description": "Elegant ranch-style home situated in the desirable River Run neighborhood. This 3-bedroom, 2-bathroom residence features a modern kitchen, a cozy fireplace, and a spacious master suite. The property boasts a beautifully landscaped yard, ideal for relaxation and entertaining.",
        "Neighborhood Description": "River Run offers a tranquil setting along the water, perfect for nature lovers and outdoor enthusiasts. With top-rated schools and convenient access to shopping centers, this neighborhood provides a perfect blend of serenity and convenience.",
        "id": "e46c9e25-d508-4756-8cb6-a230f8cccc39",
        "image_path": "../Data/Images/e46c9e25-d508-4756-8cb6-a230f8cccc39.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Kakaako",
        "City": "Honolulu",
        "State": "Hawaii",
        "Price": "$380,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1200 sqft",
        "Description": "This charming townhouse in the vibrant Kakaako neighborhood offers modern living with 2 spacious bedrooms, 2 bathrooms, and a cozy living space. The property features contemporary finishes, a private lanai, and is conveniently located near shopping, dining, and entertainment options. Ideal for those seeking a convenient urban lifestyle in Honolulu.",
        "Neighborhood Description": "Kakaako is a trendy neighborhood known for its upscale high-rise condos, exciting nightlife, and proximity to Ala Moana Beach Park. Residents enjoy a fusion of urban living with beachside relaxation, surrounded by art galleries, boutiques, and excellent dining experiences.",
        "id": "2c27feb7-122a-4c6f-aa1b-54ba82f9c33f",
        "image_path": "../Data/Images/2c27feb7-122a-4c6f-aa1b-54ba82f9c33f.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Kapahulu",
        "City": "Honolulu",
        "State": "Hawaii",
        "Price": "$495,000",
        "Bedrooms": 3,
        "Bathrooms": 3,
        "House Size": "2000 sqft",
        "Description": "Located in the sought-after Kapahulu neighborhood, this spacious townhouse boasts 3 bedrooms, 3 bathrooms, and a generous living area perfect for family gatherings. The property features a landscaped backyard, modern kitchen, and designated parking spaces. Enjoy the convenience of living close to Waikiki Beach, Diamond Head, and a variety of dining options.",
        "Neighborhood Description": "Kapahulu is a residential neighborhood with a mix of local eateries, shops, and a laid-back atmosphere. It is situated near the famous Waikiki area, offering residents easy access to stunning beaches, hiking trails, and the vibrant Waikiki nightlife.",
        "id": "584d5b0c-7293-4904-b80a-1bb486e92b84",
        "image_path": "../Data/Images/584d5b0c-7293-4904-b80a-1bb486e92b84.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Puamana",
        "City": "Lahaina",
        "State": "Hawaii",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Experience cozy island living in this charming studio apartment in Puamana. The unit features an open layout with ample natural light, a modern kitchen, and a private lanai overlooking lush tropical gardens. Puamana offers resort-style amenities including a pool, tennis courts, and direct beach access. Perfect for individuals seeking a peaceful retreat in Lahaina.",
        "Neighborhood Description": "Puamana is a prestigious oceanfront community known for its well-maintained properties and beautiful surroundings. Residents enjoy a laid-back lifestyle with easy access to Lahaina town's shops, restaurants, and cultural attractions.",
        "id": "415b837e-6610-4ca5-bddd-2568bb455d4f",
        "image_path": "../Data/Images/415b837e-6610-4ca5-bddd-2568bb455d4f.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Kaanapali",
        "City": "Lahaina",
        "State": "Hawaii",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxury meets tranquility in this stylish studio apartment located in the prestigious Kaanapali neighborhood. The unit boasts high-end finishes, a spacious living area, a gourmet kitchen, and a private balcony with panoramic ocean views. Residents enjoy access to world-class amenities including a spa, fitness center, and private beachfront. Live the resort lifestyle in Lahaina!",
        "Neighborhood Description": "Kaanapali is renowned for its upscale resorts, pristine beaches, and championship golf courses. This vibrant neighborhood offers a mix of entertainment, dining, and outdoor activities, making it a sought-after destination for residents and visitors alike.",
        "id": "c062aa87-2bec-4053-ba1a-3979064a951b",
        "image_path": "../Data/Images/c062aa87-2bec-4053-ba1a-3979064a951b.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Wagener Terrace",
        "City": "Charleston",
        "State": "South Carolina",
        "Price": "$500,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2500 sqft",
        "Description": "Welcome to this charming single-family home in the sought-after Wagener Terrace neighborhood. This spacious home features 4 bedrooms, 3 bathrooms, and a bright open floor plan. Enjoy the beautiful hardwood floors, modern kitchen, and a private backyard oasis perfect for entertaining. Conveniently located near parks, dining, and downtown Charleston, this home offers the ideal blend of comfort and style.",
        "Neighborhood Description": "Wagener Terrace is a historic and vibrant neighborhood known for its tree-lined streets, eclectic architecture, and friendly community atmosphere. Residents enjoy easy access to the Ashley River, Hampton Park, and local shops and restaurants.",
        "id": "cd7c212d-784f-4079-92fd-8f1fdd08ceff",
        "image_path": "../Data/Images/cd7c212d-784f-4079-92fd-8f1fdd08ceff.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Old Village",
        "City": "Charleston",
        "State": "South Carolina",
        "Price": "$750,000",
        "Bedrooms": 5,
        "Bathrooms": 4,
        "House Size": "3200 sqft",
        "Description": "Step into sophistication and elegance with this stunning single-family home in the historic Old Village neighborhood. Boasting 5 bedrooms, 4 bathrooms, and luxurious finishes throughout, this home offers the perfect blend of modern amenities and classic charm. Relax in the spacious living areas, entertain in the gourmet kitchen, and unwind in the serene outdoor patio space. Experience the epitome of Lowcountry living at its finest.",
        "Neighborhood Description": "Old Village is a picturesque waterfront community filled with historic homes, lush gardens, and scenic views of the Charleston Harbor. Enjoy a leisurely stroll to local boutiques, waterfront parks, and top-rated restaurants, all while soaking in the rich history and beauty of this charming neighborhood.",
        "id": "8a61fbfc-1d11-41b7-a825-39aff83c9076",
        "image_path": "../Data/Images/8a61fbfc-1d11-41b7-a825-39aff83c9076.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Quaint Downtown Area",
        "City": "Appleton",
        "State": "Wisconsin",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Discover this cozy and modern one-bedroom apartment in the heart of Appleton. Featuring contemporary design elements and efficient use of space, this apartment offers a comfortable living experience. Perfect for individuals or couples looking for a convenient urban lifestyle.",
        "Neighborhood Description": "The downtown area of Appleton is a vibrant and lively neighborhood with a mix of shops, restaurants, and entertainment options. Residents enjoy a walkable community with access to parks and cultural attractions.",
        "id": "9af294e8-d9a4-4035-9aff-b40ed10e70aa",
        "image_path": "../Data/Images/9af294e8-d9a4-4035-9aff-b40ed10e70aa.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Greenfield Subdivision",
        "City": "Appleton",
        "State": "Wisconsin",
        "Price": "$225,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "950 sqft",
        "Description": "Welcome to this charming one-bedroom apartment located in the desirable Greenfield Subdivision of Appleton. This unit boasts an additional den that can serve as a second bedroom or home office, providing flexible living arrangements. Enjoy the peaceful surroundings and modern amenities.",
        "Neighborhood Description": "Greenfield Subdivision is known for its tree-lined streets, well-maintained homes, and sense of community. Residents appreciate the quiet atmosphere while still being close to schools, shopping centers, and parks.",
        "id": "65fa07b1-87bd-4efb-afd8-17cea49899dc",
        "image_path": "../Data/Images/65fa07b1-87bd-4efb-afd8-17cea49899dc.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "East Hill",
        "City": "Pensacola",
        "State": "Florida",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Welcome to this charming one-bedroom apartment in the sought-after East Hill neighborhood of Pensacola. This cozy home features modern amenities, a spacious living area, a well-equipped kitchen, and a comfortable bedroom. Enjoy the vibrant community and proximity to local shops, restaurants, and parks.",
        "Neighborhood Description": "East Hill is a historic and picturesque neighborhood known for its tree-lined streets, historic homes, and sense of community. Residents enjoy easy access to downtown Pensacola, the waterfront, and a variety of cultural attractions.",
        "id": "17a79f87-847d-4283-b4fe-f08f58cb65b8",
        "image_path": "../Data/Images/17a79f87-847d-4283-b4fe-f08f58cb65b8.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Downtown Pensacola",
        "City": "Pensacola",
        "State": "Florida",
        "Price": "$225,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "950 sqft",
        "Description": "Experience urban living at its best in this stylish one-bedroom apartment located in the heart of downtown Pensacola. This contemporary home boasts two bedrooms, two bathrooms, a modern kitchen, and a light-filled living space. Immerse yourself in the vibrant downtown scene and enjoy the convenience of city living.",
        "Neighborhood Description": "Downtown Pensacola is a bustling urban neighborhood with a mix of historic charm and modern amenities. Residents have easy access to trendy restaurants, art galleries, entertainment venues, and scenic waterfront views.",
        "id": "e359a486-1fac-444b-98ed-1c8b69ed48c2",
        "image_path": "../Data/Images/e359a486-1fac-444b-98ed-1c8b69ed48c2.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Pleasant Hill",
        "City": "Montpelier",
        "State": "Vermont",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Discover urban living at its finest in this charming 1-bedroom condo in Montpelier. This cozy unit features a modern kitchen, spacious living area, and a private balcony with stunning views. Located in the vibrant Pleasant Hill neighborhood, you'll have easy access to local shops, restaurants, and parks. Perfect for first-time buyers or investors looking for a prime rental property.",
        "Neighborhood Description": "Pleasant Hill is a quaint and walkable neighborhood known for its tree-lined streets and friendly community atmosphere. Residents enjoy a mix of historic charm and modern amenities, with local cafes and boutique shops just steps away. With easy access to public transportation and nearby parks, this neighborhood offers the perfect balance of convenience and tranquility.",
        "id": "c1aec1a6-5ff6-41ac-8659-86afced4d081",
        "image_path": "../Data/Images/c1aec1a6-5ff6-41ac-8659-86afced4d081.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Riverview Terrace",
        "City": "Montpelier",
        "State": "Vermont",
        "Price": "$400,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1500 sqft",
        "Description": "Luxury meets comfort in this elegant 2-bedroom condo located in the sought-after Riverview Terrace neighborhood of Montpelier. Boasting high-end finishes, a gourmet kitchen, and a spacious master suite, this sophisticated unit offers the ultimate in city living. Enjoy breathtaking river views from your private terrace and experience the convenience of upscale dining and entertainment options right at your doorstep.",
        "Neighborhood Description": "Riverview Terrace is a prestigious waterfront community known for its upscale residences and stunning views of the river. Residents here enjoy a serene environment with easy access to walking trails, marinas, and waterfront parks. With top-rated restaurants and boutiques nearby, this neighborhood provides a luxurious lifestyle with all the conveniences of urban living.",
        "id": "881018ea-e1ac-4026-b526-fcbf25f608c1",
        "image_path": "../Data/Images/881018ea-e1ac-4026-b526-fcbf25f608c1.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Pine Forest Estates",
        "City": "Bangor",
        "State": "Maine",
        "Price": "$3,500,000",
        "Bedrooms": 10,
        "Bathrooms": 5,
        "House Size": "10,000 sqft",
        "Description": "Experience unparalleled luxury in this magnificent estate nestled in the prestigious Pine Forest Estates. This exquisite home boasts opulent finishes, grand living spaces, a gourmet kitchen, multiple fireplaces, a private theater, and a sprawling backyard with a pool and spa. Perfect for entertaining and luxurious living.",
        "Neighborhood Description": "Pine Forest Estates is a highly sought-after enclave known for its upscale properties, lush greenery, and tranquility. Residents enjoy a sense of privacy while being conveniently located near premier shopping, dining, and entertainment venues.",
        "id": "0b81eed1-6a25-4352-a5c9-c9f3409c770b",
        "image_path": "../Data/Images/0b81eed1-6a25-4352-a5c9-c9f3409c770b.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Pine Creek Neighborhood",
        "City": "Aspen",
        "State": "Colorado",
        "Price": "$120,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1,000 sqft",
        "Description": "Charming ranch-style home located in the desirable Pine Creek Neighborhood in Aspen. This cozy 2-bedroom, 1-bathroom home offers a comfortable living space with a touch of rustic elegance. Enjoy the serene surroundings and easy access to outdoor activities.",
        "Neighborhood Description": "The Pine Creek Neighborhood in Aspen is known for its peaceful atmosphere and close-knit community. Residents here enjoy the beauty of nature right at their doorstep, with hiking trails and scenic views just a short distance away.",
        "id": "5f091736-e176-473c-8116-d1a331576774",
        "image_path": "../Data/Images/5f091736-e176-473c-8116-d1a331576774.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Mountain View Estates",
        "City": "Aspen",
        "State": "Colorado",
        "Price": "$400,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2,500 sqft",
        "Description": "Luxurious ranch-style home in the prestigious Mountain View Estates neighborhood of Aspen. This spacious 4-bedroom, 3-bathroom home exudes modern elegance and offers ample living space for family gatherings and entertaining. Enjoy breathtaking mountain views and upscale living.",
        "Neighborhood Description": "Mountain View Estates is an upscale neighborhood in Aspen known for its exclusive homes and stunning views of the surrounding mountains. Residents here enjoy a luxurious lifestyle with easy access to outdoor activities and upscale amenities.",
        "id": "2265c2f2-ac20-42dd-bf96-2e86bf4d90bf",
        "image_path": "../Data/Images/2265c2f2-ac20-42dd-bf96-2e86bf4d90bf.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Old Town",
        "City": "Fort Collins",
        "State": "Colorado",
        "Price": "$325,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Discover urban sophistication in this charming townhouse located in the heart of Old Town. This meticulously maintained home features modern finishes, a cozy living area, spacious bedrooms, and a private outdoor patio perfect for entertaining. Enjoy the convenience of city living with shops, restaurants, and parks just steps away.",
        "Neighborhood Description": "Old Town is a vibrant and historic neighborhood known for its tree-lined streets, local boutiques, and lively community events. Residents enjoy easy access to the Poudre River Trail, cultural attractions, and a strong sense of community.",
        "id": "886e5e02-dc4c-4cd1-8690-0cd20b048646",
        "image_path": "../Data/Images/886e5e02-dc4c-4cd1-8690-0cd20b048646.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Prospect",
        "City": "Fort Collins",
        "State": "Colorado",
        "Price": "$475,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Luxury meets convenience in this stunning townhouse located in the desirable Prospect neighborhood. Boasting high-end finishes, an open floor plan, a gourmet kitchen, and a private rooftop deck with panoramic views, this home offers an unparalleled living experience. Embrace the upscale lifestyle in this modern masterpiece.",
        "Neighborhood Description": "Prospect is an upscale neighborhood characterized by contemporary architecture, lush green spaces, and a strong sense of community. Residents enjoy walkable streets, trendy shops, gourmet dining options, and a vibrant social scene.",
        "id": "b860bd6f-1d9f-4fa5-aaaa-d9ecf5431507",
        "image_path": "../Data/Images/b860bd6f-1d9f-4fa5-aaaa-d9ecf5431507.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Historic Montford",
        "City": "Asheville",
        "State": "North Carolina",
        "Price": "$325,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Discover charm and comfort in this 3-bedroom, 2-bathroom townhouse located in the historic Montford neighborhood of Asheville. This meticulously maintained home features a spacious layout, modern kitchen, and a cozy backyard. Enjoy the convenience of urban living while surrounded by the beauty of Asheville's renowned architecture and tree-lined streets.",
        "Neighborhood Description": "Montford is a picturesque and walkable neighborhood known for its stunning Victorian homes and tree-lined avenues. Residents enjoy easy access to downtown Asheville's vibrant arts scene, eclectic dining options, and scenic parks.",
        "id": "e01135d0-cef8-4560-8ee3-c9cf1230e9ae",
        "image_path": "../Data/Images/e01135d0-cef8-4560-8ee3-c9cf1230e9ae.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "West Asheville",
        "City": "Asheville",
        "State": "North Carolina",
        "Price": "$475,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Experience modern living in this spacious 4-bedroom, 3-bathroom townhouse located in the popular West Asheville neighborhood. This stylish home boasts high-end finishes, a gourmet kitchen, and a private outdoor patio perfect for entertaining. Enjoy the vibrant culture and artisanal shops that West Asheville has to offer.",
        "Neighborhood Description": "West Asheville is a hip and artistic neighborhood known for its creative energy, local breweries, and unique boutiques. Residents enjoy a laid-back atmosphere with easy access to trendy cafes, music venues, and the beautiful mountains of North Carolina.",
        "id": "b47b8a0b-a210-46b3-88f6-b8857435956d",
        "image_path": "../Data/Images/b47b8a0b-a210-46b3-88f6-b8857435956d.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Sunset Park",
        "City": "Pueblo",
        "State": "Colorado",
        "Price": "$220,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1600 sqft",
        "Description": "Welcome to this charming townhouse in the sought-after Sunset Park neighborhood. This well-maintained home features a cozy living room, updated kitchen, two spacious bedrooms, and a private patio perfect for relaxing or entertaining. With easy access to parks, schools, and local amenities, this townhouse offers a convenient and comfortable living experience.",
        "Neighborhood Description": "Sunset Park is a family-friendly neighborhood with tree-lined streets and a strong sense of community. Residents enjoy nearby parks, shopping centers, and restaurants, making it an ideal place to call home.",
        "id": "ee6f220b-ec2e-4162-9158-39f00f6dbcd7",
        "image_path": "../Data/Images/ee6f220b-ec2e-4162-9158-39f00f6dbcd7.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Riverwalk",
        "City": "Pueblo",
        "State": "Colorado",
        "Price": "$450,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Luxury meets convenience in this stunning townhouse located in the desirable Riverwalk neighborhood. With four bedrooms, three bathrooms, a gourmet kitchen, and a spacious living area, this home is perfect for both relaxing and entertaining. Enjoy the beautiful views from the balcony and take advantage of the neighborhood's amenities including walking trails and community events.",
        "Neighborhood Description": "Riverwalk is known for its upscale living and scenic views along the river. Residents here enjoy a mix of urban convenience and natural beauty, with easy access to dining, shopping, and outdoor activities.",
        "id": "4cc6740e-a8ce-4b90-b70f-53eae3d5dede",
        "image_path": "../Data/Images/4cc6740e-a8ce-4b90-b70f-53eae3d5dede.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Historic East Village",
        "City": "Des Moines",
        "State": "Iowa",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Charming one-bedroom apartment located in the heart of the vibrant Historic East Village. This cozy unit features modern amenities, a spacious living area, and a stylish kitchen. Enjoy the convenience of nearby cafes, boutiques, and cultural attractions.",
        "Neighborhood Description": "Historic East Village is known for its historic architecture, trendy shops, and diverse dining options. Residents enjoy a lively atmosphere, with local events and festivals happening throughout the year.",
        "id": "a89cf4c4-f326-4f06-b242-a2dcbf164811",
        "image_path": "../Data/Images/a89cf4c4-f326-4f06-b242-a2dcbf164811.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Beaverdale",
        "City": "Des Moines",
        "State": "Iowa",
        "Price": "$220,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "900 sqft",
        "Description": "Beautifully renovated one-bedroom apartment with a bonus room in the desirable Beaverdale neighborhood. This spacious unit boasts high ceilings, hardwood floors, and a private balcony. Experience the charm of Beaverdale with its tree-lined streets and local parks.",
        "Neighborhood Description": "Beaverdale is a picturesque neighborhood known for its strong sense of community, well-maintained homes, and local shops. Residents appreciate the peaceful surroundings and easy access to amenities.",
        "id": "a0935838-5775-4080-bb2f-aa75412cbf69",
        "image_path": "../Data/Images/a0935838-5775-4080-bb2f-aa75412cbf69.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Mission Canyon",
        "City": "Santa Barbara",
        "State": "California",
        "Price": "$80,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Discover serenity in this charming mobile home nestled in the scenic Mission Canyon neighborhood of Santa Barbara. This cozy 1-bedroom, 1-bathroom home offers a peaceful retreat with nature views. The perfect opportunity for those seeking a simpler lifestyle in a beautiful setting.",
        "Neighborhood Description": "Mission Canyon is known for its lush landscapes, proximity to hiking trails, and a peaceful atmosphere. Residents enjoy easy access to local parks, botanical gardens, and the historic Old Mission Santa Barbara.",
        "id": "a4498330-3eaa-46c6-b49e-c04d0775a5f1",
        "image_path": "../Data/Images/a4498330-3eaa-46c6-b49e-c04d0775a5f1.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Hope Ranch",
        "City": "Santa Barbara",
        "State": "California",
        "Price": "$130,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1000 sqft",
        "Description": "Experience coastal living at its finest in this delightful mobile home located in the prestigious Hope Ranch neighborhood of Santa Barbara. Featuring 2 bedrooms, 2 bathrooms, and a comfortable living space, this home offers a blend of tranquility and convenience. Embrace the upscale mobile home lifestyle in a sought-after community.",
        "Neighborhood Description": "Hope Ranch is an exclusive enclave known for its luxury estates, equestrian facilities, and private beach access. Residents enjoy a tranquil ambiance, stunning ocean views, and proximity to upscale amenities.",
        "id": "56e46c01-9f97-49b3-ad94-3ae9e2947eae",
        "image_path": "../Data/Images/56e46c01-9f97-49b3-ad94-3ae9e2947eae.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Pierce Avenue Heights",
        "City": "Macon",
        "State": "Georgia",
        "Price": "$220,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Welcome to this charming Ranch-Style Home in the desirable Pierce Avenue Heights neighborhood of Macon. This meticulously maintained property features three bedrooms, two bathrooms, and a spacious 1800 sqft layout. Enjoy the convenience of single-level living with a cozy atmosphere and modern amenities. Ideal for a family looking for comfort and style.",
        "Neighborhood Description": "Pierce Avenue Heights is a peaceful and family-friendly neighborhood offering a sense of community. Residents enjoy tree-lined streets, nearby parks, and easy access to schools, shopping, and dining options.",
        "id": "454c6a60-8287-491d-ba30-1925d647cc76",
        "image_path": "../Data/Images/454c6a60-8287-491d-ba30-1925d647cc76.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Ingleside",
        "City": "Macon",
        "State": "Georgia",
        "Price": "$375,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Discover the perfect blend of comfort and elegance in this stunning Ranch-Style Home located in the sought-after Ingleside neighborhood of Macon. Boasting four bedrooms, three bathrooms, and a generous 2300 sqft floor plan, this home offers spacious living areas and modern finishes. Enjoy the serene surroundings and make this property your oasis of relaxation.",
        "Neighborhood Description": "Ingleside is known for its picturesque streets and historic charm. With beautiful homes, friendly neighbors, and a central location, this neighborhood provides a tranquil setting while still being close to all the amenities Macon has to offer.",
        "id": "3d49dd72-646a-4bcd-a980-4006e9c24886",
        "image_path": "../Data/Images/3d49dd72-646a-4bcd-a980-4006e9c24886.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Oak Hill",
        "City": "Lawrence",
        "State": "Kansas",
        "Price": "$275,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Welcome to this charming townhouse in the desirable Oak Hill neighborhood of Lawrence. This well-maintained property features an open floor plan, spacious bedrooms, and a cozy backyard perfect for relaxing or entertaining. With modern amenities and proximity to local parks and schools, this townhouse offers a comfortable yet convenient lifestyle.",
        "Neighborhood Description": "Oak Hill is a peaceful and family-friendly neighborhood known for its tree-lined streets and community atmosphere. Residents enjoy easy access to nearby shopping centers, restaurants, and recreational facilities.",
        "id": "18287142-e495-4835-a6de-ecd03bf74d4e",
        "image_path": "../Data/Images/18287142-e495-4835-a6de-ecd03bf74d4e.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Mountain View Estates",
        "City": "Helena",
        "State": "Montana",
        "Price": "$250,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Welcome to this charming townhouse in the sought-after Mountain View Estates neighborhood of Helena. This meticulously maintained home features 3 bedrooms, 2 bathrooms, and a spacious living area perfect for entertaining. Enjoy the stunning mountain views from your private patio. Conveniently located near parks, schools, and shopping centers.",
        "Neighborhood Description": "Mountain View Estates is a family-friendly neighborhood known for its scenic views and close-knit community. Residents here enjoy easy access to outdoor activities like hiking and biking trails, as well as being just a short drive away from downtown Helena.",
        "id": "55202be4-b90a-4289-897c-da932f9bd952",
        "image_path": "../Data/Images/55202be4-b90a-4289-897c-da932f9bd952.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Riverfront Place",
        "City": "Helena",
        "State": "Montana",
        "Price": "$400,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Explore luxury living in this exquisite townhouse located in the prestigious Riverfront Place neighborhood of Helena. Boasting 4 bedrooms, 3 bathrooms, and elegant finishes throughout, this home offers a sophisticated yet comfortable lifestyle. Relax on the private terrace overlooking the serene river views. Close to fine dining, shopping, and entertainment options.",
        "Neighborhood Description": "Riverfront Place is synonymous with upscale urban living, offering a blend of modern amenities and natural beauty. Situated along the banks of the Missouri River, this neighborhood provides a tranquil retreat from the hustle and bustle of city life while still being within reach of Helena's vibrant downtown scene.",
        "id": "559d37fe-b5ca-499f-9c97-269874d595ee",
        "image_path": "../Data/Images/559d37fe-b5ca-499f-9c97-269874d595ee.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Beacon Hill",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$200,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Charming one-bedroom apartment in historic Beacon Hill. This cozy unit features a renovated kitchen, hardwood floors, and abundant natural light. Ideal for urban living with proximity to Boston Common, shops, and restaurants.",
        "Neighborhood Description": "Beacon Hill is known for its cobblestone streets, brick townhouses, and historic charm. Enjoy the picturesque neighborhood with boutique shops, cafes, and easy access to public transportation.",
        "id": "b82ccfcc-c382-41f6-95d6-ac90f1db34bc",
        "image_path": "../Data/Images/b82ccfcc-c382-41f6-95d6-ac90f1db34bc.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Riverside",
        "City": "Parkersburg",
        "State": "West Virginia",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Charming studio apartment in the vibrant Riverside neighborhood of Parkersburg. This cozy space features a modern design with a well-equipped kitchen, a comfortable living area, and a stylish bathroom. Perfect for a young professional or a couple looking for a convenient urban lifestyle.",
        "Neighborhood Description": "Riverside is a picturesque neighborhood along the Ohio River offering scenic views, quaint cafes, and easy access to parks and recreational activities. Residents enjoy a friendly community atmosphere and close proximity to shopping and dining options.",
        "id": "e5248485-dd3f-438a-826c-8d84b898d376",
        "image_path": "../Data/Images/e5248485-dd3f-438a-826c-8d84b898d376.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Downtown",
        "City": "Parkersburg",
        "State": "West Virginia",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Modern studio apartment located in the heart of Downtown Parkersburg. This stylish unit boasts a spacious layout with high ceilings, large windows, and contemporary finishes. Ideal for those seeking a chic urban living experience with easy access to trendy cafes, shops, and entertainment venues.",
        "Neighborhood Description": "Downtown is a bustling district known for its historic architecture, cultural attractions, and vibrant nightlife. Residents enjoy a dynamic urban environment with a mix of residential and commercial spaces, creating a lively atmosphere with plenty of amenities.",
        "id": "c2776699-bcfb-487d-95c8-046686bb6d7f",
        "image_path": "../Data/Images/c2776699-bcfb-487d-95c8-046686bb6d7f.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Hillcrest",
        "City": "Parkersburg",
        "State": "West Virginia",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment nestled in the serene Hillcrest neighborhood of Parkersburg. This upscale unit features top-of-the-line appliances, elegant finishes, and a private balcony with breathtaking views. Perfect for discerning individuals looking for a sophisticated retreat in a peaceful setting.",
        "Neighborhood Description": "Hillcrest is an exclusive residential area characterized by upscale homes, tree-lined streets, and a tranquil ambiance. Residents enjoy a sense of privacy and prestige, with easy access to parks, golf courses, and upscale shopping destinations.",
        "id": "cf412576-7105-409e-8f2c-0b192d22b6c2",
        "image_path": "../Data/Images/cf412576-7105-409e-8f2c-0b192d22b6c2.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Brookside",
        "City": "Kansas City",
        "State": "Missouri",
        "Price": "$250,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Welcome to this charming ranch-style home in the desirable Brookside neighborhood of Kansas City. This well-maintained property features a spacious layout with 3 bedrooms, 2 bathrooms, and a cozy atmosphere. The large backyard is perfect for outdoor gatherings and relaxation. Enjoy the convenience of nearby shops, restaurants, and parks.",
        "Neighborhood Description": "Brookside is known for its tree-lined streets, historic charm, and vibrant community. Residents enjoy easy access to local boutiques, cafes, and parks, making it a wonderful place to call home.",
        "id": "e5218027-6643-4c26-bb52-af50b46bb203",
        "image_path": "../Data/Images/e5218027-6643-4c26-bb52-af50b46bb203.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Waldo",
        "City": "Kansas City",
        "State": "Missouri",
        "Price": "$380,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2200 sqft",
        "Description": "Situated in the sought-after Waldo neighborhood, this ranch-style home offers modern living with 4 bedrooms, 3 bathrooms, and a beautifully designed interior. The open floor plan is ideal for entertaining, and the backyard oasis provides a peaceful retreat. Experience the vibrant community and convenience of nearby amenities.",
        "Neighborhood Description": "Waldo is a lively neighborhood known for its diverse dining options, local shops, and community events. Residents enjoy a strong sense of community and easy access to parks and entertainment venues.",
        "id": "1ad28584-8dea-4460-8d86-be7bc947390b",
        "image_path": "../Data/Images/1ad28584-8dea-4460-8d86-be7bc947390b.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Downtown Helena",
        "City": "Helena",
        "State": "Montana",
        "Price": "$250,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1000 sqft",
        "Description": "Experience urban living in this stylish condo in downtown Helena. This modern unit features two bedrooms, a spacious living area, and a contemporary kitchen. Enjoy the convenience of city amenities just steps away from your doorstep. Ideal for professionals or those seeking a vibrant urban lifestyle.",
        "Neighborhood Description": "Downtown Helena offers a mix of historic charm and modern vitality. Explore local shops, cafes, and cultural attractions within walking distance. Enjoy the vibrant community events and easy access to parks and recreational areas.",
        "id": "9cdf252a-3470-428d-bbb5-a897cb83cb47",
        "image_path": "../Data/Images/9cdf252a-3470-428d-bbb5-a897cb83cb47.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Mountain View Estates",
        "City": "Helena",
        "State": "Montana",
        "Price": "$450,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Discover luxury living in this elegant condo in the prestigious Mountain View Estates. This spacious unit boasts three bedrooms, two bathrooms, and a gourmet kitchen. Enjoy panoramic views of the surrounding mountains and tranquil surroundings. Perfect for those seeking upscale comfort and privacy.",
        "Neighborhood Description": "Mountain View Estates is a highly sought-after neighborhood known for its upscale homes and picturesque landscapes. Experience a serene retreat while still being conveniently located near top-rated schools, shopping centers, and outdoor recreation.",
        "id": "f074237e-2c19-40c2-a83a-548b02808dc8",
        "image_path": "../Data/Images/f074237e-2c19-40c2-a83a-548b02808dc8.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Pinehurst Estates",
        "City": "Augusta",
        "State": "Maine",
        "Price": "$3,500,000",
        "Bedrooms": 8,
        "Bathrooms": 5,
        "House Size": "10,000 sqft",
        "Description": "Welcome to this magnificent luxury estate in the prestigious Pinehurst Estates neighborhood in Augusta. This exceptional residence boasts grand living spaces, high-end finishes, and breathtaking views. With 8 bedrooms, 5 bathrooms, and 10,000 sqft of luxury living, this home offers a blend of elegance and comfort. The property features a beautifully landscaped yard, a pool, and a private tennis court, perfect for luxurious living and entertaining.",
        "Neighborhood Description": "Pinehurst Estates is a highly desirable and upscale neighborhood known for its spacious properties, mature trees, and quiet streets. Residents enjoy a sense of privacy and tranquility while being conveniently located near top-rated schools, fine dining, and shopping options.",
        "id": "9e95bfe7-0153-4c3d-89b7-032a6b0901ab",
        "image_path": "../Data/Images/9e95bfe7-0153-4c3d-89b7-032a6b0901ab.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Waterfront Village",
        "City": "Bridgeport",
        "State": "Connecticut",
        "Price": "$3,500,000",
        "Bedrooms": 7,
        "Bathrooms": 5,
        "House Size": "8000 sqft",
        "Description": "Nestled in the prestigious Waterfront Village of Bridgeport, this magnificent Luxury Estate offers unparalleled coastal living. With captivating water views, this 7-bedroom, 5-bathroom mansion boasts exquisite architectural details, a gourmet kitchen, expansive living areas, and a private dock. The perfect blend of luxury and comfort.",
        "Neighborhood Description": "Waterfront Village is a highly sought-after neighborhood known for its stunning waterfront views, upscale dining options, and a vibrant community atmosphere. Residents enjoy easy access to marinas, parks, and upscale shopping.",
        "id": "ffa19ff0-0988-4366-a7ea-0388a8a92e54",
        "image_path": "../Data/Images/ffa19ff0-0988-4366-a7ea-0388a8a92e54.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Prairie Hills",
        "City": "Fremont",
        "State": "Nebraska",
        "Price": "$70,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Cozy mobile home nestled in the quiet Prairie Hills neighborhood of Fremont. This well-maintained property features 2 bedrooms, a spacious living area, and a charming kitchen. Enjoy the convenience of mobile home living with a touch of tranquility. Perfect for first-time homebuyers or those looking to downsize.",
        "Neighborhood Description": "Prairie Hills is a welcoming community known for its family-friendly atmosphere and proximity to local parks and schools. Residents enjoy a peaceful setting while still being conveniently located near shopping and dining options.",
        "id": "b72ba6ee-9477-4acb-9779-1a7d6ebdcc6f",
        "image_path": "../Data/Images/b72ba6ee-9477-4acb-9779-1a7d6ebdcc6f.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Riverview",
        "City": "Fremont",
        "State": "Nebraska",
        "Price": "$120,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1100 sqft",
        "Description": "Modern mobile home located in the desirable Riverview neighborhood of Fremont. This updated property boasts 3 bedrooms, 2 bathrooms, a stylish kitchen, and a spacious backyard. Ideal for those seeking comfort and convenience in a peaceful setting.",
        "Neighborhood Description": "Riverview is a sought-after neighborhood known for its scenic views of the Platte River and well-maintained streets. Residents enjoy easy access to recreational areas and a strong sense of community.",
        "id": "9dc19f60-f8c6-4679-85c7-1d47a7a90c04",
        "image_path": "../Data/Images/9dc19f60-f8c6-4679-85c7-1d47a7a90c04.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Nob Hill",
        "City": "Albuquerque",
        "State": "New Mexico",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Welcome to this cozy one-bedroom apartment in the vibrant Nob Hill neighborhood of Albuquerque. This charming unit features modern amenities, a spacious layout, and plenty of natural light. Perfect for a young professional or as an investment property. Enjoy the nearby eclectic shops, cafes, and cultural attractions that make Nob Hill a sought-after location.",
        "Neighborhood Description": "Nob Hill is a hip and walkable neighborhood known for its historic Route 66 vibe. It boasts unique boutiques, trendy restaurants, and a lively nightlife scene. Residents enjoy tree-lined streets, public art installations, and easy access to parks and hiking trails in the nearby Sandia Mountains.",
        "id": "f4c2621e-704d-4c03-a4d3-e8ac0164dc39",
        "image_path": "../Data/Images/f4c2621e-704d-4c03-a4d3-e8ac0164dc39.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Downtown Albuquerque",
        "City": "Albuquerque",
        "State": "New Mexico",
        "Price": "$225,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "900 sqft",
        "Description": "Don't miss this opportunity to own a stylish one-bedroom apartment in the heart of Downtown Albuquerque. This modern unit offers versatile living spaces, high-end finishes, and panoramic city views. With two bedrooms and two bathrooms, this property provides flexibility and comfort. Experience urban living at its finest with easy access to restaurants, entertainment, and cultural attractions.",
        "Neighborhood Description": "Downtown Albuquerque is a vibrant and diverse neighborhood with a mix of historic architecture and contemporary developments. Residents enjoy a thriving arts scene, trendy cafes, and proximity to major employers and transportation hubs. Explore local galleries, attend festivals, and immerse yourself in the dynamic energy of downtown living.",
        "id": "a1b0900e-e687-4b21-b33e-bb6e01a6df9d",
        "image_path": "../Data/Images/a1b0900e-e687-4b21-b33e-bb6e01a6df9d.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Creek Street Historic District",
        "City": "Ketchikan",
        "State": "Alaska",
        "Price": "$300,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Welcome to this charming townhouse in the heart of the Creek Street Historic District. This meticulously maintained home features 3 bedrooms, 2 bathrooms, and a spacious living area perfect for entertaining. Enjoy the convenience of being walking distance to shops, restaurants, and waterfront views. Don't miss out on this opportunity to own a piece of Ketchikan's rich history.",
        "Neighborhood Description": "The Creek Street Historic District is a vibrant and lively neighborhood known for its colorful buildings, quaint shops, and historical significance. Residents here enjoy a unique blend of culture, art, and community events, making it a wonderful place to call home.",
        "id": "b0cdd456-3223-4934-ad1d-3c1d00bac250",
        "image_path": "../Data/Images/b0cdd456-3223-4934-ad1d-3c1d00bac250.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Saxman Village",
        "City": "Ketchikan",
        "State": "Alaska",
        "Price": "$450,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Discover the beauty of Saxman Village with this spacious 4-bedroom, 3-bathroom townhouse. Boasting over 2300 sqft of living space, this home offers a modern layout with high-end finishes. Enjoy the peaceful surroundings and proximity to outdoor recreation while still being close to all the amenities of Ketchikan. Embrace the Alaskan lifestyle in this luxurious townhouse.",
        "Neighborhood Description": "Saxman Village is a tranquil neighborhood surrounded by lush forests and stunning mountain views. The close-knit community values nature, art, and culture, creating a serene and welcoming atmosphere. Residents in Saxman Village appreciate the balance of peaceful living with easy access to urban conveniences.",
        "id": "eaf9c4c5-5efd-4fd6-9259-66df6f58e589",
        "image_path": "../Data/Images/eaf9c4c5-5efd-4fd6-9259-66df6f58e589.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Tower District",
        "City": "Fresno",
        "State": "California",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Charming 1-bedroom condo located in the vibrant Tower District of Fresno. This cozy condo features a modern kitchen, a spacious living area, and a private balcony with city views. Ideal for first-time homebuyers or investors looking for a rental property.",
        "Neighborhood Description": "Tower District is known for its eclectic mix of restaurants, shops, and art galleries. It offers a lively cultural scene with historic architecture and tree-lined streets.",
        "id": "e5fcad0c-9a56-4bb2-a3b9-10f202235497",
        "image_path": "../Data/Images/e5fcad0c-9a56-4bb2-a3b9-10f202235497.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Woodward Park",
        "City": "Fresno",
        "State": "California",
        "Price": "$400,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1400 sqft",
        "Description": "Modern 2-bedroom condo in the desirable Woodward Park neighborhood of Fresno. This unit boasts an open floor plan, a gourmet kitchen with stainless steel appliances, and a private patio for outdoor entertaining. Enjoy the convenience of nearby parks and shopping centers.",
        "Neighborhood Description": "Woodward Park is a family-friendly neighborhood known for its scenic parks, top-rated schools, and easy access to outdoor recreational activities. It offers a suburban feel with a range of amenities.",
        "id": "f0157604-a3e0-42bd-b7e4-65c93dcbb0b8",
        "image_path": "../Data/Images/f0157604-a3e0-42bd-b7e4-65c93dcbb0b8.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Fig Garden",
        "City": "Fresno",
        "State": "California",
        "Price": "$600,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "2000 sqft",
        "Description": "Luxurious 3-bedroom condo in the prestigious Fig Garden area of Fresno. This spacious unit features high-end finishes, a master suite with a walk-in closet, and a private rooftop terrace with panoramic views. Experience upscale living in a prime location.",
        "Neighborhood Description": "Fig Garden is an upscale neighborhood known for its tree-lined streets, upscale dining options, and elegant homes. It offers a blend of luxury living and convenient access to amenities.",
        "id": "e3561d9c-960e-41f1-9d3c-d7095b669a1b",
        "image_path": "../Data/Images/e3561d9c-960e-41f1-9d3c-d7095b669a1b.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Green Valley Ranch",
        "City": "Henderson",
        "State": "Nevada",
        "Price": "$70,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Cozy mobile home located in the desirable Green Valley Ranch neighborhood. This well-maintained property offers a comfortable living space with a spacious bedroom, a modern bathroom, and a functional kitchen. Enjoy the convenience of community amenities and proximity to shopping centers and parks.",
        "Neighborhood Description": "Green Valley Ranch is known for its family-friendly atmosphere and beautiful parks. Residents enjoy a sense of community and easy access to schools, restaurants, and entertainment venues.",
        "id": "1cfab57f-038f-4aff-9583-1fd0b22f3ec0",
        "image_path": "../Data/Images/1cfab57f-038f-4aff-9583-1fd0b22f3ec0.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Anthem",
        "City": "Henderson",
        "State": "Nevada",
        "Price": "$130,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1100 sqft",
        "Description": "Spacious mobile home in the prestigious Anthem neighborhood. This upgraded property features three bedrooms, two bathrooms, a modern kitchen, and a cozy living area. Relax in the private backyard or take advantage of the community amenities and nearby shopping centers.",
        "Neighborhood Description": "Anthem is a master-planned community known for its upscale living and scenic views. Residents enjoy exclusive access to parks, trails, golf courses, and top-rated schools.",
        "id": "805dec98-d51a-40aa-bbc5-1117fdfd77ed",
        "image_path": "../Data/Images/805dec98-d51a-40aa-bbc5-1117fdfd77ed.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Downtown Fremont",
        "City": "Fremont",
        "State": "Nebraska",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Welcome to this charming one-bedroom apartment in the heart of Downtown Fremont. This cozy yet spacious unit features modern amenities, a fully equipped kitchen, a comfortable living area, and a stylish bathroom. Enjoy the convenience of being close to local shops, restaurants, and parks. Perfect for a young professional or a couple looking for a vibrant urban lifestyle.",
        "Neighborhood Description": "Downtown Fremont is a bustling neighborhood with a mix of historic charm and contemporary offerings. You'll find a variety of dining options, boutique shops, cultural attractions, and easy access to public transportation. Experience the lively atmosphere and community events that make this neighborhood a desirable place to live.",
        "id": "500f5fee-867f-4156-9027-b20067f8ecc0",
        "image_path": "../Data/Images/500f5fee-867f-4156-9027-b20067f8ecc0.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Riverside",
        "City": "Fremont",
        "State": "Nebraska",
        "Price": "$220,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "900 sqft",
        "Description": "Discover the perfect blend of comfort and style in this two-bedroom apartment located in the scenic Riverside neighborhood of Fremont. This light-filled unit boasts a spacious layout, high-end finishes, a private balcony with river views, and modern appliances. Immerse yourself in tranquility while being just a short distance from parks, trails, and local attractions.",
        "Neighborhood Description": "Riverside offers a serene escape from the hustle and bustle of city life. Nestled along the riverfront, this neighborhood provides residents with picturesque views, outdoor recreational opportunities, and a close-knit community vibe. Enjoy the peaceful surroundings and the beauty of nature right at your doorstep.",
        "id": "dc350a87-b116-4446-9ec9-aa5bb46a786b",
        "image_path": "../Data/Images/dc350a87-b116-4446-9ec9-aa5bb46a786b.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Nob Hill",
        "City": "Albuquerque",
        "State": "New Mexico",
        "Price": "$400,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2500 sqft",
        "Description": "Welcome to this charming Single-Family Home nestled in the vibrant Nob Hill neighborhood of Albuquerque. This meticulously maintained residence features 4 bedrooms, 3 bathrooms, and spacious living areas spread across 2500 sqft. Enjoy modern amenities and a cozy atmosphere where you can create lasting memories. Step outside to explore the eclectic mix of shops, restaurants, and cultural attractions that make Nob Hill a sought-after community.",
        "Neighborhood Description": "Nob Hill is a trendy and historic neighborhood known for its unique shops, local eateries, and vibrant arts scene. Residents enjoy a walkable community with tree-lined streets, beautiful architecture, and a strong sense of community. From boutique shopping to lively entertainment options, Nob Hill offers a dynamic urban lifestyle with a touch of nostalgia.",
        "id": "8cf3ff46-ec2c-402b-9e46-9177d2fa2abf",
        "image_path": "../Data/Images/8cf3ff46-ec2c-402b-9e46-9177d2fa2abf.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Douglas Island",
        "City": "Juneau",
        "State": "Alaska",
        "Price": "$450,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2400 sqft",
        "Description": "Nestled in the charming community of Douglas Island, this spacious single-family home offers a perfect blend of comfort and elegance. Boasting 4 bedrooms, 3 bathrooms, and a generous living space of 2400 sqft, this home provides ample room for the whole family. Enjoy stunning mountain views from the backyard deck, ideal for entertaining guests or simply unwinding after a long day.",
        "Neighborhood Description": "Douglas Island is known for its scenic beauty and friendly atmosphere. Residents enjoy easy access to outdoor activities such as hiking, fishing, and wildlife spotting. The neighborhood also features local shops, restaurants, and a strong sense of community.",
        "id": "3927fbde-2fd2-41a6-814c-e3a902f44685",
        "image_path": "../Data/Images/3927fbde-2fd2-41a6-814c-e3a902f44685.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "River Ranch",
        "City": "Lafayette",
        "State": "Louisiana",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Experience urban living at its finest in this stylish one-bedroom apartment located in the prestigious River Ranch neighborhood. The unit features modern amenities, an open layout, and abundant natural light. Enjoy the convenience of nearby shopping, dining, and entertainment options.",
        "Neighborhood Description": "River Ranch is a sought-after neighborhood known for its upscale lifestyle, tree-lined streets, and community events. Residents have access to parks, boutiques, cafes, and a vibrant social scene.",
        "id": "e602a5c1-961e-4154-8655-a4fbd4d37fef",
        "image_path": "../Data/Images/e602a5c1-961e-4154-8655-a4fbd4d37fef.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Shadyside",
        "City": "Pittsburgh",
        "State": "Pennsylvania",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Welcome to this charming one-bedroom apartment in the vibrant neighborhood of Shadyside. This cozy unit features a modern kitchen, a spacious living area, and a comfortable bedroom. Perfect for young professionals or couples looking for a stylish urban living experience.",
        "Neighborhood Description": "Shadyside is known for its tree-lined streets, upscale boutiques, and diverse dining options. This neighborhood offers a perfect blend of convenience and charm, with easy access to parks, shopping, and cultural attractions.",
        "id": "ad8d91db-0130-4afb-a558-367fe01b0ef9",
        "image_path": "../Data/Images/ad8d91db-0130-4afb-a558-367fe01b0ef9.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "River Ranch",
        "City": "Lafayette",
        "State": "Louisiana",
        "Price": "$275,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Discover this charming townhouse nestled in the desirable River Ranch neighborhood. The home features an open floor plan with modern finishes, a spacious kitchen, and a cozy living area. Enjoy the convenience of nearby parks, shopping, and dining options. Perfect for those seeking a blend of comfort and style in a vibrant community.",
        "Neighborhood Description": "River Ranch is known for its upscale living with tree-lined streets, community events, and proximity to top-rated schools. Residents enjoy a walkable lifestyle with access to boutique shops, gourmet restaurants, and recreational facilities.",
        "id": "87b34865-8bce-42a5-bbbd-f6d17ef89aea",
        "image_path": "../Data/Images/87b34865-8bce-42a5-bbbd-f6d17ef89aea.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Downtown Lafayette",
        "City": "Lafayette",
        "State": "Louisiana",
        "Price": "$425,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Experience urban living at its finest in this elegant townhouse located in the heart of Downtown Lafayette. Boasting high ceilings, luxury amenities, and stunning views, this property offers a sophisticated lifestyle. Walk to local cafes, art galleries, and entertainment venues, immersing yourself in the vibrant city culture.",
        "Neighborhood Description": "Downtown Lafayette is a thriving area with a mix of historic charm and modern developments. Enjoy a dynamic arts scene, diverse dining options, and cultural events throughout the year. Live amidst the energy of downtown while still savoring the warmth of a close-knit community.",
        "id": "d5538618-79ca-4218-ad8b-572e44eaca42",
        "image_path": "../Data/Images/d5538618-79ca-4218-ad8b-572e44eaca42.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Mesilla Park",
        "City": "Las Cruces",
        "State": "New Mexico",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Located in the charming neighborhood of Mesilla Park, this one-bedroom apartment offers a cozy yet modern living space. The unit features an open floor plan, updated kitchen, and a small patio perfect for enjoying the New Mexico sunsets. With easy access to local shops and parks, this apartment is ideal for a young professional or couple seeking a comfortable home in Las Cruces.",
        "Neighborhood Description": "Mesilla Park is known for its tree-lined streets, historic adobe homes, and vibrant community atmosphere. Residents enjoy proximity to Mesilla Plaza, where local farmers' markets and cultural events take place regularly. The neighborhood offers a mix of traditional charm and modern conveniences, making it a sought-after area in Las Cruces.",
        "id": "2f993e4d-43ec-4b27-8bfa-37cc6e466d93",
        "image_path": "../Data/Images/2f993e4d-43ec-4b27-8bfa-37cc6e466d93.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Alameda-Depot Historic District",
        "City": "Las Cruces",
        "State": "New Mexico",
        "Price": "$225,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "950 sqft",
        "Description": "Step into this beautifully renovated one-bedroom apartment located in the historic Alameda-Depot District of Las Cruces. The unit exudes character with its exposed brick walls, high ceilings, and modern finishes. Enjoy the spacious layout, updated kitchen, and a private balcony overlooking the neighborhood. Experience urban living at its finest in this charming apartment within walking distance to restaurants, shops, and entertainment.",
        "Neighborhood Description": "The Alameda-Depot Historic District is a vibrant and eclectic neighborhood known for its historic architecture, art galleries, and unique dining options. Residents appreciate the walkability of the area, with cafes and boutiques just around the corner. This culturally rich neighborhood captures the essence of Las Cruces' history while offering a dynamic urban lifestyle.",
        "id": "8d14f64d-6504-4e5b-b730-35a2083eac95",
        "image_path": "../Data/Images/8d14f64d-6504-4e5b-b730-35a2083eac95.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Waikiki",
        "City": "Honolulu",
        "State": "Hawaii",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Cozy studio apartment located in the vibrant neighborhood of Waikiki, offering a perfect blend of city living and beach lifestyle. This unit boasts modern finishes, a compact kitchen, and a comfortable living space. Ideal for individuals or couples seeking a convenient urban retreat in the heart of Honolulu.",
        "Neighborhood Description": "Waikiki is a bustling neighborhood known for its beautiful beaches, shopping opportunities, and lively entertainment scene. Residents enjoy easy access to a variety of restaurants, shops, and outdoor activities, making it a popular choice for those looking to experience the best of Honolulu.",
        "id": "ee29ce3a-e945-4fb6-8fd4-561b1216eb88",
        "image_path": "../Data/Images/ee29ce3a-e945-4fb6-8fd4-561b1216eb88.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Kakaako",
        "City": "Honolulu",
        "State": "Hawaii",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment in the upscale neighborhood of Kakaako, offering high-end amenities and breathtaking ocean views. The unit features a sleek design, spacious living area, and top-of-the-line appliances. Enjoy a sophisticated urban lifestyle in this exclusive residence located in the heart of Honolulu's vibrant arts and culture district.",
        "Neighborhood Description": "Kakaako is a dynamic neighborhood known for its contemporary high-rise condos, trendy boutiques, and art galleries. Residents can enjoy a mix of cultural experiences, fine dining options, and convenient access to downtown Honolulu, making it a prime location for those seeking a modern and upscale living environment.",
        "id": "35447e0e-7332-4e26-b295-2d7df82c82c9",
        "image_path": "../Data/Images/35447e0e-7332-4e26-b295-2d7df82c82c9.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Old Town",
        "City": "Fort Collins",
        "State": "Colorado",
        "Price": "$250,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Charming 1-bedroom condo in the heart of Old Town Fort Collins. This cozy unit features a modern kitchen, spacious living area, and a private balcony with stunning views. Ideal for those seeking a vibrant urban lifestyle with easy access to restaurants, shops, and entertainment.",
        "Neighborhood Description": "Old Town is a historic neighborhood known for its lively atmosphere, historic architecture, and cultural events. Residents enjoy close proximity to parks, cafes, and local boutiques.",
        "id": "6840de30-2dfd-4861-bcdb-fe325b311cbd",
        "image_path": "../Data/Images/6840de30-2dfd-4861-bcdb-fe325b311cbd.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Midtown",
        "City": "Fort Collins",
        "State": "Colorado",
        "Price": "$450,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1400 sqft",
        "Description": "Spacious 2-bedroom condo located in the desirable Midtown area of Fort Collins. This modern unit boasts an open floor plan, gourmet kitchen, and a private patio perfect for outdoor entertaining. Enjoy the convenience of nearby shopping centers, parks, and excellent schools.",
        "Neighborhood Description": "Midtown is a family-friendly neighborhood with tree-lined streets, community parks, and easy access to major highways. It offers a perfect blend of urban amenities and suburban tranquility.",
        "id": "54f54ae9-613f-484f-9b6a-e8fa577954b1",
        "image_path": "../Data/Images/54f54ae9-613f-484f-9b6a-e8fa577954b1.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Fossil Creek",
        "City": "Fort Collins",
        "State": "Colorado",
        "Price": "$600,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Luxurious 3-bedroom condo in the prestigious Fossil Creek neighborhood of Fort Collins. This elegant unit features high-end finishes, a spacious master suite, and a rooftop terrace with panoramic mountain views. Experience upscale living with easy access to top-rated restaurants, golf courses, and recreational facilities.",
        "Neighborhood Description": "Fossil Creek is a sought-after neighborhood known for its upscale homes, scenic trails, and exclusive country club. Residents enjoy a serene environment amidst natural beauty.",
        "id": "b4dc4687-5486-434d-b36a-2f9cedb04154",
        "image_path": "../Data/Images/b4dc4687-5486-434d-b36a-2f9cedb04154.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Pheasant Hill neighborhood",
        "City": "Nashua",
        "State": "New Hampshire",
        "Price": "$250,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Welcome to this charming Ranch-Style Home nestled in the desirable Pheasant Hill neighborhood in Nashua. This well-maintained property features 3 bedrooms, 2 bathrooms, and ample living space spread across 1800 sqft. Enjoy the convenience of single-level living with a spacious backyard perfect for outdoor gatherings. Close to schools, parks, and shopping, this home offers a blend of comfort and convenience.",
        "Neighborhood Description": "The Pheasant Hill neighborhood in Nashua is known for its friendly community vibe and proximity to local amenities. Residents enjoy easy access to parks, walking trails, and excellent schools, making it an ideal area for families and individuals seeking a peaceful yet connected lifestyle.",
        "id": "bae3f98d-3301-44d7-8257-b965de751a46",
        "image_path": "../Data/Images/bae3f98d-3301-44d7-8257-b965de751a46.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "River Pines Estates",
        "City": "Nashua",
        "State": "New Hampshire",
        "Price": "$375,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2200 sqft",
        "Description": "Discover the beauty of this spacious Ranch-Style Home located in the prestigious River Pines Estates neighborhood of Nashua. Boasting 4 bedrooms, 3 bathrooms, and 2200 sqft of living space, this property offers a blend of elegance and comfort. The open floor plan, modern kitchen, and scenic backyard create a perfect retreat for relaxation and entertainment.",
        "Neighborhood Description": "River Pines Estates is a sought-after neighborhood known for its upscale properties and tranquil surroundings. With tree-lined streets, scenic views, and easy access to the river, residents experience a serene lifestyle while being just a short drive away from downtown Nashua's vibrant dining and entertainment scene.",
        "id": "257be18f-b1db-4c7c-8d7d-7e87b970c6c6",
        "image_path": "../Data/Images/257be18f-b1db-4c7c-8d7d-7e87b970c6c6.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Downtown Brattleboro",
        "City": "Brattleboro",
        "State": "Vermont",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Charming one-bedroom apartment in the heart of Downtown Brattleboro. This cozy unit features a spacious living area, a modern kitchen, and a comfortable bedroom. Perfect for individuals or couples looking to enjoy city living. Walking distance to local shops, restaurants, and parks.",
        "Neighborhood Description": "Downtown Brattleboro is a vibrant and diverse neighborhood known for its arts scene, eclectic shops, and historic architecture. Residents enjoy a strong sense of community and easy access to cultural events and outdoor activities.",
        "id": "4a79cf15-f171-47eb-930d-0deae6860551",
        "image_path": "../Data/Images/4a79cf15-f171-47eb-930d-0deae6860551.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Riverside Park",
        "City": "Fremont",
        "State": "Nebraska",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Discover modern living in this stylish 1-bedroom condo located in the vibrant Riverside Park neighborhood. This cozy unit features contemporary design, a sleek kitchen, and a private balcony with scenic views. Ideal for young professionals or couples seeking comfort and convenience.",
        "Neighborhood Description": "Riverside Park is a charming neighborhood known for its scenic beauty and close-knit community. Residents enjoy easy access to parks, shopping centers, and dining options, making it a desirable place to call home.",
        "id": "8edd043d-8848-48ff-87d4-43646ff5787e",
        "image_path": "../Data/Images/8edd043d-8848-48ff-87d4-43646ff5787e.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Downtown Fremont",
        "City": "Fremont",
        "State": "Nebraska",
        "Price": "$400,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1500 sqft",
        "Description": "Luxury meets convenience in this elegant 2-bedroom condo located in the heart of Downtown Fremont. Boasting spacious interiors, high-end finishes, and panoramic city views, this upscale unit offers a sophisticated urban lifestyle for discerning buyers.",
        "Neighborhood Description": "Downtown Fremont is a vibrant district teeming with cultural attractions, trendy eateries, and bustling nightlife. Experience the pulse of the city right at your doorstep in this dynamic and sought-after neighborhood.",
        "id": "d198bfc6-40f6-4181-ad49-2a2269dd0ce0",
        "image_path": "../Data/Images/d198bfc6-40f6-4181-ad49-2a2269dd0ce0.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Lakefront Estates",
        "City": "Fremont",
        "State": "Nebraska",
        "Price": "$600,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "2000 sqft",
        "Description": "Indulge in luxury living with this exquisite 3-bedroom condo nestled in the prestigious Lakefront Estates neighborhood. Featuring opulent interiors, a gourmet kitchen, and a private terrace overlooking the serene lake, this lavish unit offers a blend of sophistication and comfort.",
        "Neighborhood Description": "Lakefront Estates is an exclusive waterfront community known for its upscale amenities and breathtaking views. Enjoy a tranquil lifestyle surrounded by nature's beauty and upscale living in this prestigious enclave.",
        "id": "6ce3b31f-8f43-49c5-b259-6082fd296c29",
        "image_path": "../Data/Images/6ce3b31f-8f43-49c5-b259-6082fd296c29.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Evergreen Valley",
        "City": "Olympia",
        "State": "Washington",
        "Price": "$275,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1600 sqft",
        "Description": "Discover this charming townhouse nestled in the desirable Evergreen Valley neighborhood of Olympia. This home features 3 bedrooms, 2 bathrooms, a spacious living area, and a modern kitchen. Enjoy the convenience of a low-maintenance lifestyle with easy access to parks, shopping, and dining. Ideal for first-time homebuyers or those looking to downsize without compromising on comfort.",
        "Neighborhood Description": "Evergreen Valley is a family-friendly neighborhood known for its scenic views, friendly community atmosphere, and proximity to schools and recreational amenities.",
        "id": "de9a9649-0a9f-44b0-a8d0-574e32c010f3",
        "image_path": "../Data/Images/de9a9649-0a9f-44b0-a8d0-574e32c010f3.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Lakepointe",
        "City": "Olympia",
        "State": "Washington",
        "Price": "$425,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2200 sqft",
        "Description": "Luxury meets convenience in this stunning townhouse located in the prestigious Lakepointe neighborhood of Olympia. Boasting 4 bedrooms, 3 bathrooms, high-end finishes, and a private outdoor space, this home offers an elegant retreat for discerning buyers. Enjoy the peaceful surroundings while being just minutes away from downtown amenities and waterfront parks.",
        "Neighborhood Description": "Lakepointe is an upscale neighborhood known for its upscale properties, beautiful waterfront views, and close-knit community vibe. Residents enjoy easy access to walking trails, dining options, and entertainment venues.",
        "id": "71fe2be5-4416-4ea9-b381-abe83a3da6b0",
        "image_path": "../Data/Images/71fe2be5-4416-4ea9-b381-abe83a3da6b0.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Stone Oak",
        "City": "San Antonio",
        "State": "Texas",
        "Price": "$450,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2800 sqft",
        "Description": "Nestled in the desirable Stone Oak neighborhood, this charming single-family home offers 4 bedrooms, 3 bathrooms, and a spacious 2800 sqft layout. The home features a modern kitchen, cozy living spaces, and a beautiful backyard for outdoor entertaining. With top-rated schools, scenic views, and convenient access to dining and shopping, this property provides the perfect blend of comfort and convenience.",
        "Neighborhood Description": "Stone Oak is known for its upscale living, with tree-lined streets, parks, and community events. Residents enjoy a peaceful environment with proximity to major highways, making commuting a breeze. The neighborhood boasts excellent schools, trendy restaurants, and upscale shopping centers, making it a highly sought-after area in San Antonio.",
        "id": "bf9a240d-5384-4899-b8af-a59a312bf8f5",
        "image_path": "../Data/Images/bf9a240d-5384-4899-b8af-a59a312bf8f5.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Plaza Westport area",
        "City": "Kansas City",
        "State": "Missouri",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Charming studio apartment located in the vibrant Plaza Westport area of Kansas City. This cozy space is perfect for a young professional or student looking for a convenient urban lifestyle. The unit features modern finishes, ample natural light, and is within walking distance to trendy shops, restaurants, and entertainment venues.",
        "Neighborhood Description": "The Plaza Westport area is a bustling neighborhood known for its eclectic mix of boutiques, cafes, and nightlife spots. Residents enjoy a vibrant atmosphere with easy access to parks, cultural attractions, and the bustling downtown core.",
        "id": "5c66a7ad-543f-4616-b9a7-19584883dfa8",
        "image_path": "../Data/Images/5c66a7ad-543f-4616-b9a7-19584883dfa8.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Crossroads Arts District",
        "City": "Kansas City",
        "State": "Missouri",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment in the sought-after Crossroads Arts District of Kansas City. This stylish unit offers high-end amenities, stunning city views, and a prime location surrounded by art galleries, gourmet restaurants, and trendy bars. Ideal for those seeking a sophisticated urban living experience.",
        "Neighborhood Description": "The Crossroads Arts District is a dynamic neighborhood known for its vibrant arts scene, innovative dining options, and hip urban vibe. Residents enjoy a creative community with easy access to cultural events, live music venues, and a thriving local art scene.",
        "id": "a5ec4172-069e-47bf-86c1-952f594c8a49",
        "image_path": "../Data/Images/a5ec4172-069e-47bf-86c1-952f594c8a49.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Riverside Park",
        "City": "Parkersburg",
        "State": "West Virginia",
        "Price": "$3,500,000",
        "Bedrooms": 10,
        "Bathrooms": 5,
        "House Size": "12,000 sqft",
        "Description": "Nestled in the prestigious Riverside Park neighborhood, this stunning luxury estate offers exquisite craftsmanship and unparalleled elegance. Spanning 12,000 sqft, the estate features grand living spaces, a gourmet kitchen, multiple fireplaces, a spacious master suite, and lush outdoor gardens. The timeless design and opulent finishes make this home a true masterpiece.",
        "Neighborhood Description": "Riverside Park is known for its tree-lined streets, upscale homes, and proximity to the Ohio River. Residents enjoy a peaceful atmosphere, well-maintained parks, and easy access to downtown Parkersburg's amenities.",
        "id": "883d709d-e43c-42c6-b121-ff09d8857d2e",
        "image_path": "../Data/Images/883d709d-e43c-42c6-b121-ff09d8857d2e.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Mesilla Park Historic District",
        "City": "Las Cruces",
        "State": "New Mexico",
        "Price": "$325,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2500 sqft",
        "Description": "Welcome to this charming single-family home in the historic Mesilla Park neighborhood. This beautifully maintained property features a spacious interior with 4 bedrooms, 3 bathrooms, and a lovely backyard perfect for outdoor gatherings. Enjoy the convenience of living in a vibrant community with nearby parks, shops, and dining options.",
        "Neighborhood Description": "Mesilla Park Historic District is known for its tree-lined streets, historic adobe homes, and vibrant community atmosphere. Residents enjoy a sense of history combined with modern amenities, with easy access to local attractions and cultural events.",
        "id": "53a39c31-79d6-4321-ae1a-a05ac6cf8d44",
        "image_path": "../Data/Images/53a39c31-79d6-4321-ae1a-a05ac6cf8d44.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Sonoma Ranch",
        "City": "Las Cruces",
        "State": "New Mexico",
        "Price": "$650,000",
        "Bedrooms": 6,
        "Bathrooms": 4,
        "House Size": "3500 sqft",
        "Description": "Discover luxury living in this expansive single-family home located in the prestigious Sonoma Ranch neighborhood. This stunning property boasts 6 bedrooms, 4 bathrooms, high-end finishes, and a spacious backyard oasis perfect for relaxation and entertainment. Experience the epitome of elegance and comfort in this exceptional residence.",
        "Neighborhood Description": "Sonoma Ranch is a sought-after community known for its upscale homes, scenic views, and top-rated schools. Residents enjoy a tranquil setting with easy access to golf courses, shopping centers, and outdoor recreation opportunities.",
        "id": "4240d617-2591-444a-b3f0-3bd4c47280a2",
        "image_path": "../Data/Images/4240d617-2591-444a-b3f0-3bd4c47280a2.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Old Bend",
        "City": "Bend",
        "State": "Oregon",
        "Price": "$250,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Discover modern living in this stylish 1-bedroom condo in Bend. The unit features an open floor plan, updated kitchen, and a cozy balcony. Located in the vibrant Old Bend neighborhood, enjoy easy access to local eateries, shops, and outdoor activities.",
        "Neighborhood Description": "Old Bend is a historic neighborhood known for its charming streets, local breweries, and proximity to the Deschutes River. Residents enjoy a lively atmosphere with various recreational opportunities.",
        "id": "219223fe-f8c2-45bf-9847-14f2fd6a818e",
        "image_path": "../Data/Images/219223fe-f8c2-45bf-9847-14f2fd6a818e.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Northwest Crossing",
        "City": "Bend",
        "State": "Oregon",
        "Price": "$500,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1,500 sqft",
        "Description": "Luxurious 2-bedroom condo offering upscale living in Bend. This unit boasts high-end finishes, spacious bedrooms, and a private patio with stunning views. Located in the desirable Northwest Crossing neighborhood, enjoy a blend of urban convenience and outdoor recreation.",
        "Neighborhood Description": "Northwest Crossing is a sought-after community with tree-lined streets, parks, and local boutiques. It offers a family-friendly environment with a strong sense of community.",
        "id": "c2207c31-1ff0-4b00-b202-9f18e54d6c79",
        "image_path": "../Data/Images/c2207c31-1ff0-4b00-b202-9f18e54d6c79.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Rosemont",
        "City": "Portland",
        "State": "Maine",
        "Price": "$225,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1600 sqft",
        "Description": "Discover cozy elegance in this beautifully renovated Ranch-Style Home in the heart of Rosemont. This 3-bedroom, 2-bathroom gem features a spacious living area, modern kitchen, and a charming backyard perfect for relaxation. With tasteful upgrades throughout, this home offers a blend of comfort and style ideal for both quiet living and entertaining guests.",
        "Neighborhood Description": "Rosemont is a highly desirable neighborhood known for its tree-lined streets, friendly community vibe, and proximity to local parks and schools. Enjoy the convenience of nearby shops, cafes, and easy access to downtown Portland.",
        "id": "c14a15ec-26c8-496a-8e06-ad6f401d9b09",
        "image_path": "../Data/Images/c14a15ec-26c8-496a-8e06-ad6f401d9b09.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Deering Center",
        "City": "Portland",
        "State": "Maine",
        "Price": "$350,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2200 sqft",
        "Description": "Welcome home to this spacious and meticulously cared for Ranch-Style Home in Deering Center. Boasting 4 bedrooms, 3 bathrooms, and a generous living space, this residence offers comfort and versatility. The updated kitchen, elegant flooring, and private backyard retreat make this property a true sanctuary for the discerning buyer.",
        "Neighborhood Description": "Deering Center is a historic neighborhood characterized by its beautiful homes, lush greenery, and strong sense of community. Enjoy easy access to local amenities, schools, and parks, all within a short distance to the vibrant offerings of downtown Portland.",
        "id": "798fc487-b0c2-477a-ac68-40ee434eb815",
        "image_path": "../Data/Images/798fc487-b0c2-477a-ac68-40ee434eb815.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Sandbridge",
        "City": "Virginia Beach",
        "State": "Virginia",
        "Price": "$550,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2600 sqft",
        "Description": "Escape to this stunning single-family home in the desirable Sandbridge neighborhood. Featuring 4 bedrooms, 3 bathrooms, and ample living space spread across 2600 sqft. Enjoy modern amenities, a spacious backyard, and proximity to the beach for the ultimate coastal lifestyle.",
        "Neighborhood Description": "Sandbridge offers a mix of serene coastal living and vibrant community activities. Residents enjoy easy access to the beach, local shops, and restaurants, making it a sought-after destination for families and beach lovers.",
        "id": "36153f4c-6528-45e5-be0c-f5de621f9fcc",
        "image_path": "../Data/Images/36153f4c-6528-45e5-be0c-f5de621f9fcc.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Ohio City",
        "City": "Cleveland",
        "State": "Ohio",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "650 sqft",
        "Description": "Charming one-bedroom apartment in the heart of Ohio City. This cozy unit features a modern kitchen, spacious living area, and a comfortable bedroom. Perfect for young professionals or couples looking for a vibrant urban lifestyle.",
        "Neighborhood Description": "Ohio City is a historic neighborhood known for its trendy bars, restaurants, and cultural attractions. Residents enjoy easy access to the West Side Market, breweries, and parks.",
        "id": "94a17311-c50b-40aa-ac0f-de662b29c091",
        "image_path": "../Data/Images/94a17311-c50b-40aa-ac0f-de662b29c091.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "University Circle",
        "City": "Cleveland",
        "State": "Ohio",
        "Price": "$210,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "900 sqft",
        "Description": "Luxurious one-bedroom apartment with a bonus room in University Circle. This elegant unit features high-end finishes, a gourmet kitchen, and stunning views of the city skyline. Ideal for those seeking sophistication and comfort.",
        "Neighborhood Description": "University Circle is a cultural hub with top museums, universities, and medical facilities. The neighborhood offers a blend of academic excellence, artistic inspiration, and diverse culinary experiences.",
        "id": "a0015563-8d33-4359-9d80-b7de35e3a235",
        "image_path": "../Data/Images/a0015563-8d33-4359-9d80-b7de35e3a235.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Fountain Square",
        "City": "Indianapolis",
        "State": "Indiana",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Step into this charming one-bedroom apartment in the heart of Fountain Square. With modern finishes, an open layout, and ample natural light, this cozy yet stylish space offers the perfect urban retreat. Enjoy the vibrant neighborhood filled with local eateries, boutiques, and cultural hotspots. Ideal for those seeking a blend of convenience and character.",
        "Neighborhood Description": "Fountain Square is a trendy, artistic neighborhood known for its historic architecture, eclectic dining scene, and vibrant nightlife. Residents enjoy a strong sense of community, with local events and festivals adding to the neighborhood's charm.",
        "id": "b1e2c5ad-29f1-48e0-a087-fc873b3b09ed",
        "image_path": "../Data/Images/b1e2c5ad-29f1-48e0-a087-fc873b3b09ed.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "South Hills",
        "City": "Charleston",
        "State": "West Virginia",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Modern one-bedroom condo in the desirable South Hills neighborhood of Charleston. This cozy unit features a stylish design, a functional layout, and convenient access to local amenities. Perfect for young professionals or couples looking for a convenient yet affordable living space.",
        "Neighborhood Description": "South Hills is a charming neighborhood known for its tree-lined streets, local parks, and close-knit community. Residents enjoy easy access to shopping centers, restaurants, and outdoor recreational areas.",
        "id": "5305d836-bf15-45b9-8390-498d7734b452",
        "image_path": "../Data/Images/5305d836-bf15-45b9-8390-498d7734b452.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Downtown Charleston",
        "City": "Charleston",
        "State": "West Virginia",
        "Price": "$400,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1500 sqft",
        "Description": "Elegant two-bedroom condo located in the heart of downtown Charleston. This sophisticated unit boasts high-end finishes, expansive living spaces, and stunning views of the city skyline. Ideal for urban dwellers seeking luxury living in a vibrant neighborhood.",
        "Neighborhood Description": "Downtown Charleston is a bustling area with a mix of historic architecture, trendy boutiques, and renowned dining establishments. Residents can immerse themselves in the city's cultural scene and enjoy easy access to entertainment venues.",
        "id": "7dc54e50-5e57-499c-b6cd-a6074a0f9671",
        "image_path": "../Data/Images/7dc54e50-5e57-499c-b6cd-a6074a0f9671.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Kanawha City",
        "City": "Charleston",
        "State": "West Virginia",
        "Price": "$600,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "2000 sqft",
        "Description": "Luxurious three-bedroom condo situated in the sought-after Kanawha City neighborhood of Charleston. This spacious unit features upscale amenities, a gourmet kitchen, and a private balcony offering panoramic views. An exclusive retreat for discerning buyers seeking upscale urban living.",
        "Neighborhood Description": "Kanawha City is an upscale neighborhood known for its elegant homes, upscale shopping options, and proximity to the Kanawha River. Residents enjoy a blend of tranquility and convenience, with easy access to top-rated schools and recreational facilities.",
        "id": "b51cba32-638e-41da-8554-8cb1ae699079",
        "image_path": "../Data/Images/b51cba32-638e-41da-8554-8cb1ae699079.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Riverfront District",
        "City": "Parkersburg",
        "State": "West Virginia",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Experience modern living in this stylish 1-bedroom condo located in the vibrant Riverfront District of Parkersburg. The unit features contemporary finishes, an open floor plan, and stunning views of the Ohio River. Enjoy the convenience of nearby shops, restaurants, and entertainment venues within walking distance.",
        "Neighborhood Description": "The Riverfront District is a bustling area known for its historic charm and scenic river views. Residents enjoy a mix of local boutiques, eateries, and recreational activities along the riverfront. The neighborhood offers a dynamic urban lifestyle with a touch of small-town warmth.",
        "id": "3fea57cd-0dda-4db8-957f-9e7ded475e49",
        "image_path": "../Data/Images/3fea57cd-0dda-4db8-957f-9e7ded475e49.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Woodland Heights",
        "City": "Parkersburg",
        "State": "West Virginia",
        "Price": "$400,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Luxury meets comfort in this spacious 3-bedroom condo nestled in the prestigious Woodland Heights neighborhood of Parkersburg. The unit boasts high-end finishes, a gourmet kitchen, and a private balcony with panoramic views. Enjoy serene living amidst lush greenery and easy access to top-rated schools, parks, and shopping centers.",
        "Neighborhood Description": "Woodland Heights is an upscale residential community known for its tree-lined streets and upscale homes. Residents appreciate the tranquil atmosphere, well-maintained parks, and proximity to excellent schools. The neighborhood offers a perfect blend of privacy and convenience for a sophisticated lifestyle.",
        "id": "06e56d04-9f1f-4f13-aeed-6c28c18fe42d",
        "image_path": "../Data/Images/06e56d04-9f1f-4f13-aeed-6c28c18fe42d.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Belhaven",
        "City": "Jackson",
        "State": "Mississippi",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Charming studio apartment located in the historic Belhaven neighborhood. This cozy space features a modern kitchen, ample natural light, and hardwood floors. Perfect for a young professional or student looking for a convenient and vibrant living environment.",
        "Neighborhood Description": "Belhaven is known for its tree-lined streets, historic architecture, and artistic community. Residents enjoy local cafes, boutiques, and nearby parks, creating a lively and welcoming atmosphere.",
        "id": "924ca52a-bc2b-45b8-81d3-fa3e24c8a4cb",
        "image_path": "../Data/Images/924ca52a-bc2b-45b8-81d3-fa3e24c8a4cb.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Fondren",
        "City": "Jackson",
        "State": "Mississippi",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Modern studio apartment in the trendy Fondren neighborhood. This stylish unit boasts high ceilings, designer finishes, and a private balcony with city views. Ideal for those seeking a contemporary urban lifestyle with access to local restaurants and entertainment.",
        "Neighborhood Description": "Fondren is a vibrant and eclectic neighborhood known for its artsy vibe, diverse dining options, and lively nightlife. With colorful murals, live music venues, and local events, the community offers a dynamic and creative environment.",
        "id": "d2ef6633-e187-416c-a3f8-e5bd6c6bf6e0",
        "image_path": "../Data/Images/d2ef6633-e187-416c-a3f8-e5bd6c6bf6e0.png"
    }
]