[
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Garden District",
        "City": "New Orleans",
        "State": "Louisiana",
        "Price": "$600,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2500 sqft",
        "Description": "Step into elegance in this beautifully restored historic home in the Garden District. Featuring 4 spacious bedrooms, 3 bathrooms, and a gourmet kitchen, this home seamlessly blends modern amenities with classic charm. Enjoy the lush courtyard and wrap-around porch for outdoor relaxation. Perfect for those seeking a blend of luxury and history.",
        "Neighborhood Description": "The Garden District is a picturesque historic neighborhood known for its grand antebellum mansions, tree-lined streets, and vibrant local community. Residents enjoy easy access to boutique shops, upscale dining, and beautiful parks.",
        "id": "951bfc80-6783-4cc6-ba56-33b9558539c3",
        "image_path": "../Data/Images/951bfc80-6783-4cc6-ba56-33b9558539c3.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Park Slope",
        "City": "New York City",
        "State": "New York",
        "Price": "$400,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Charming townhouse in the heart of Park Slope, featuring a cozy living space, modern kitchen, and a beautiful backyard garden. The property offers a perfect blend of historic charm and contemporary amenities.",
        "Neighborhood Description": "Park Slope is known for its tree-lined streets, historic brownstones, and vibrant community. With top-rated schools, trendy boutiques, and fantastic dining options, this neighborhood is perfect for families and young professionals alike.",
        "id": "9b0c6ba8-5d41-477a-9236-7292fb304f2c",
        "image_path": "../Data/Images/9b0c6ba8-5d41-477a-9236-7292fb304f2c.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Upper East Side",
        "City": "New York City",
        "State": "New York",
        "Price": "$550,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2400 sqft",
        "Description": "Elegant townhouse located in the prestigious Upper East Side, offering spacious rooms, high ceilings, and luxurious finishes. Enjoy the convenience of upscale living in one of NYC's most sought-after neighborhoods.",
        "Neighborhood Description": "The Upper East Side exudes sophistication with its upscale boutiques, fine dining establishments, and world-class museums. This historic neighborhood is synonymous with luxury and elegance, attracting discerning residents.",
        "id": "077b1df2-275d-4244-a391-44adf04b1fa8",
        "image_path": "../Data/Images/077b1df2-275d-4244-a391-44adf04b1fa8.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Forest Hill",
        "City": "Newark",
        "State": "New Jersey",
        "Price": "$3,500,000",
        "Bedrooms": 8,
        "Bathrooms": 5,
        "House Size": "10,000 sqft",
        "Description": "Welcome to this magnificent luxury estate in the prestigious Forest Hill neighborhood of Newark. This grand residence boasts 8 bedrooms, 5 bathrooms, and spans over 10,000 sqft of exquisite living space. From the elegant architecture to the lush landscaping, every detail exudes opulence and sophistication. Enjoy the ultimate blend of comfort and luxury in this exceptional property.",
        "Neighborhood Description": "Forest Hill is a highly sought-after neighborhood known for its historic charm, tree-lined streets, and upscale ambiance. Residents appreciate the proximity to parks, fine dining, and cultural attractions, making it a prime location for those seeking a prestigious lifestyle.",
        "id": "0d05068c-0b86-41dd-b3dc-5fb959041f9d",
        "image_path": "../Data/Images/0d05068c-0b86-41dd-b3dc-5fb959041f9d.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Catalina Foothills",
        "City": "Tucson",
        "State": "Arizona",
        "Price": "$3,500,000",
        "Bedrooms": 7,
        "Bathrooms": 5,
        "House Size": "8000 sqft",
        "Description": "Discover ultimate luxury in this exquisite estate nestled in the prestigious Catalina Foothills. With stunning mountain views, this 7-bedroom masterpiece boasts high-end finishes, a gourmet kitchen, resort-style pool, and lush landscaping. The grand living areas and elegant design make it perfect for entertaining. Experience the epitome of Arizona living.",
        "Neighborhood Description": "Catalina Foothills is known for its upscale homes, breathtaking mountain vistas, and proximity to outdoor activities. Residents enjoy a relaxed lifestyle with easy access to hiking trails, golf courses, and upscale dining options.",
        "id": "e7cd7340-2d68-46bb-89e6-068c36bfebc1",
        "image_path": "../Data/Images/e7cd7340-2d68-46bb-89e6-068c36bfebc1.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "East Nashville",
        "City": "Nashville",
        "State": "Tennessee",
        "Price": "$275,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Discover urban living in this charming townhouse located in the heart of East Nashville. This 3-bedroom, 2-bathroom home features modern amenities, an open floor plan, and a private courtyard perfect for entertaining. Enjoy easy access to local restaurants, shops, and parks.",
        "Neighborhood Description": "East Nashville is known for its eclectic vibe, historic homes, and vibrant arts scene. Residents enjoy a mix of trendy eateries, boutiques, and music venues, creating a dynamic and welcoming community.",
        "id": "89de9b12-5752-47bd-abf2-defa91e1b48e",
        "image_path": "../Data/Images/89de9b12-5752-47bd-abf2-defa91e1b48e.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Beacon Hill",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$4,500,000",
        "Bedrooms": 8,
        "Bathrooms": 5,
        "House Size": "10,000 sqft",
        "Description": "Experience unparalleled luxury in this exquisite Beacon Hill estate. With 8 grand bedrooms, 5 luxurious bathrooms, and sprawling across 10,000 sqft, this residence epitomizes opulence. From the grand foyer to the lush backyard oasis, every detail exudes sophistication. Indulge in the finest living with state-of-the-art amenities and breathtaking views of Boston skyline. Live the epitome of luxury in the heart of historic Beacon Hill.",
        "Neighborhood Description": "Beacon Hill, known for its historic charm and cobblestone streets, is one of Boston's most prestigious neighborhoods. Its proximity to the State House, Boston Common, and upscale boutiques and restaurants make it a highly sought-after location for the elite.",
        "id": "1fe3468d-eab9-41c7-b6c9-67428cd7120e",
        "image_path": "../Data/Images/1fe3468d-eab9-41c7-b6c9-67428cd7120e.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Beacon Hill",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$750,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2400 sqft",
        "Description": "Nestled in the prestigious Beacon Hill neighborhood, this charming single-family home offers a perfect blend of historic charm and modern amenities. Featuring 4 spacious bedrooms, a beautifully renovated kitchen, and a private outdoor patio, this home provides a peaceful retreat in the heart of the city.",
        "Neighborhood Description": "Beacon Hill is known for its picturesque cobblestone streets, historic brownstones, and vibrant community atmosphere. Residents enjoy easy access to boutique shops, upscale dining options, and iconic landmarks like the Boston Common.",
        "id": "03c6abb4-f4a5-4bd8-b759-b1df9c1cdfaa",
        "image_path": "../Data/Images/03c6abb4-f4a5-4bd8-b759-b1df9c1cdfaa.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Catalina Foothills",
        "City": "Tucson",
        "State": "Arizona",
        "Price": "$220,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1,200 sqft",
        "Description": "Discover this charming townhouse nestled in the scenic Catalina Foothills of Tucson. Featuring 2 bedrooms, 2 bathrooms, and 1,200 sqft of living space, this cozy home offers an ideal blend of comfort and convenience. Enjoy the majestic mountain views and proximity to hiking trails and shopping centers. Perfect for those seeking a relaxed desert lifestyle.",
        "Neighborhood Description": "The Catalina Foothills neighborhood in Tucson is known for its upscale ambiance, stunning views of the Catalina Mountains, and proximity to high-end dining and shopping establishments. Residents enjoy a peaceful yet vibrant community with easy access to outdoor activities and cultural attractions.",
        "id": "4c780c63-502d-4c9c-b6dc-89b9b220c9a8",
        "image_path": "../Data/Images/4c780c63-502d-4c9c-b6dc-89b9b220c9a8.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Downtown Tucson",
        "City": "Tucson",
        "State": "Arizona",
        "Price": "$450,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2,300 sqft",
        "Description": "Luxurious townhouse living awaits in the heart of Downtown Tucson. This spacious 4-bedroom, 3-bathroom residence spans 2,300 sqft and exudes modern elegance. Boasting high-end finishes and panoramic city views, this urban oasis offers the ultimate blend of style and sophistication. Experience the vibrant downtown lifestyle with easy access to dining, entertainment, and cultural hotspots.",
        "Neighborhood Description": "Downtown Tucson is a dynamic and eclectic neighborhood filled with a mix of historic charm and contemporary amenities. Residents enjoy a lively arts and culinary scene, along with proximity to theaters, museums, and the vibrant nightlife of downtown. Experience the pulse of the city in this vibrant neighborhood.",
        "id": "c1d4638c-4b3b-4ad8-b7c0-912af51dbea3",
        "image_path": "../Data/Images/c1d4638c-4b3b-4ad8-b7c0-912af51dbea3.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Lakeview",
        "City": "Chicago",
        "State": "Illinois",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Charming studio apartment in the vibrant Lakeview neighborhood of Chicago. This cozy space offers a comfortable living area, a well-equipped kitchen, and a modern bathroom. Close to bustling cafes, boutique shops, and beautiful parks, this apartment is perfect for those seeking a dynamic urban lifestyle.",
        "Neighborhood Description": "Lakeview is known for its lively atmosphere, diverse dining options, and easy access to Lake Michigan. Residents enjoy strolling along the lakefront path, catching a game at Wrigley Field, and exploring the unique boutiques and art galleries in the area.",
        "id": "4bb71fe9-9d2b-4f9f-b3d1-7e1c0507d513",
        "image_path": "../Data/Images/4bb71fe9-9d2b-4f9f-b3d1-7e1c0507d513.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "River North",
        "City": "Chicago",
        "State": "Illinois",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment in the upscale River North neighborhood of Chicago. This sophisticated space features high-end finishes, panoramic city views, and access to top-notch amenities such as a fitness center and a rooftop terrace. With renowned art galleries, trendy restaurants, and designer boutiques just steps away, this apartment offers a truly refined urban experience.",
        "Neighborhood Description": "River North is renowned for its art scene, upscale dining options, and vibrant nightlife. The neighborhood is home to numerous art galleries, design studios, and luxury boutiques, making it a hub for culture and creativity in Chicago.",
        "id": "f1dc931b-29ee-4a0b-a082-53311354096e",
        "image_path": "../Data/Images/f1dc931b-29ee-4a0b-a082-53311354096e.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Hollywood Hills",
        "City": "Los Angeles",
        "State": "California",
        "Price": "$400,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1200 sqft",
        "Description": "Modern condo offering stunning views of the iconic Hollywood sign. This 2-bed, 2-bath unit features high-end finishes, a spacious living area, and a private balcony. Located in the desirable Hollywood Hills neighborhood, residents enjoy easy access to trendy restaurants, shops, and hiking trails.",
        "Neighborhood Description": "Hollywood Hills is a prestigious neighborhood known for its celebrity residents and luxurious homes. It offers a perfect blend of privacy and proximity to the vibrant entertainment industry, making it a highly sought-after location in Los Angeles.",
        "id": "ad9b7644-260c-4fb1-a4b3-5a95a4a26e23",
        "image_path": "../Data/Images/ad9b7644-260c-4fb1-a4b3-5a95a4a26e23.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Santa Monica",
        "City": "Los Angeles",
        "State": "California",
        "Price": "$550,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Spacious 3-bedroom condo just blocks from the beach in Santa Monica. This beautifully designed unit features a gourmet kitchen, hardwood floors, and a large master suite. Enjoy the coastal lifestyle with easy access to dining, shopping, and outdoor activities.",
        "Neighborhood Description": "Santa Monica is a vibrant coastal neighborhood known for its beautiful beaches, bustling pier, and upscale shopping and dining options. Residents enjoy a relaxed beachside atmosphere with convenient access to urban amenities.",
        "id": "d04a1142-5c95-4c64-8102-0e8f06449421",
        "image_path": "../Data/Images/d04a1142-5c95-4c64-8102-0e8f06449421.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Williamsburg",
        "City": "New York City",
        "State": "New York",
        "Price": "$90,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "500 sqft",
        "Description": "Welcome to this cozy studio apartment in the vibrant neighborhood of Williamsburg. Perfect for those seeking a modern living space with a touch of urban charm. This unit features a sleek design, ample natural light, and convenient access to local cafes, restaurants, and boutiques. Enjoy the lively atmosphere of Williamsburg while having your private sanctuary to retreat to.",
        "Neighborhood Description": "Williamsburg is known for its artistic community, trendy shops, and buzzing nightlife. It offers a mix of old and new with historic buildings standing next to modern developments. Residents enjoy easy access to the waterfront, parks, and a variety of dining options. The neighborhood has a creative energy that attracts young professionals and artists alike, making it a desirable place to live.",
        "id": "b80243eb-ea7d-4643-bd94-829dce6d8b20",
        "image_path": "../Data/Images/b80243eb-ea7d-4643-bd94-829dce6d8b20.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "East Village",
        "City": "New York City",
        "State": "New York",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Step into this stylish studio apartment in the lively East Village neighborhood. This unit offers a blend of modern comfort and historic charm, with high ceilings, hardwood floors, and contemporary fixtures. Experience the vibrant culture of East Village with its eclectic mix of shops, restaurants, and entertainment venues right at your doorstep. Live in the heart of the action while enjoying a peaceful retreat within your own space.",
        "Neighborhood Description": "East Village is a dynamic neighborhood known for its diverse community, artistic scene, and culinary delights. It's a melting pot of cultures, offering a range of dining options, from hole-in-the-wall eateries to upscale restaurants. The area has a bohemian vibe and a rich history that adds character to its streets. Residents love the walkability and the sense of community that defines East Village living.",
        "id": "cb537fe9-6e62-4e09-9fdf-ce65b96dbcc4",
        "image_path": "../Data/Images/cb537fe9-6e62-4e09-9fdf-ce65b96dbcc4.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "University Circle",
        "City": "Cleveland",
        "State": "Ohio",
        "Price": "$235,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Welcome to this charming ranch-style home in the heart of University Circle. This well-maintained property features 3 bedrooms, 2 bathrooms, and a spacious living area perfect for entertaining. The kitchen boasts modern appliances and ample storage space. Enjoy the convenience of a peaceful neighborhood while still being close to vibrant city life. Don't miss out on this opportunity to own a cozy home in a sought-after location.",
        "Neighborhood Description": "University Circle is a cultural hub known for its museums, universities, and green spaces. Residents enjoy easy access to world-class institutions like the Cleveland Museum of Art and Case Western Reserve University. The neighborhood offers a blend of historic charm and modern amenities, with tree-lined streets and diverse dining options. Experience the best of city living in a community that values art, education, and community engagement.",
        "id": "c0ef4d83-a10a-42c4-96a6-1ff36de0ef46",
        "image_path": "../Data/Images/c0ef4d83-a10a-42c4-96a6-1ff36de0ef46.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Ohio City",
        "City": "Cleveland",
        "State": "Ohio",
        "Price": "$350,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2200 sqft",
        "Description": "Discover the allure of this spacious ranch-style home nestled in the vibrant Ohio City neighborhood. Boasting 4 bedrooms and 3 bathrooms, this property offers an open layout, ideal for modern living. The master suite provides a retreat with a luxurious ensuite bathroom. Entertain guests in the landscaped backyard or relax on the front porch. Experience the perfect blend of comfort and style in this sought-after community.",
        "Neighborhood Description": "Ohio City is a trendy neighborhood known for its lively food and craft beer scene. Residents enjoy a mix of historic architecture and trendy boutiques. The West Side Market offers fresh produce and artisanal goods, while nearby parks provide green spaces for outdoor activities. With a strong sense of community and a variety of cultural events, Ohio City is a desirable location for those seeking a dynamic urban lifestyle.",
        "id": "07e0835e-4508-4976-b123-dea953634a6b",
        "image_path": "../Data/Images/07e0835e-4508-4976-b123-dea953634a6b.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Lakeview",
        "City": "Chicago",
        "State": "Illinois",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Discover urban living in this cozy one-bedroom apartment nestled in the vibrant Lakeview neighborhood of Chicago. The unit features modern amenities, an open layout, and large windows offering abundant natural light. Enjoy the convenience of nearby shops, restaurants, and easy access to public transportation.",
        "Neighborhood Description": "Lakeview is a bustling neighborhood known for its lively entertainment scene, diverse dining options, and beautiful lakefront views. Residents enjoy a mix of historic architecture and modern developments, along with numerous parks and recreational activities.",
        "id": "15d6048f-df59-4698-a079-278bec032eea",
        "image_path": "../Data/Images/15d6048f-df59-4698-a079-278bec032eea.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Sunnyside",
        "City": "Denver",
        "State": "Colorado",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Welcome to this charming one-bedroom apartment in the vibrant Sunnyside neighborhood of Denver. This cozy yet modern unit offers a comfortable living space with great natural light. The open layout makes it perfect for entertaining friends or enjoying a quiet evening in. With local shops, restaurants, and parks just a short walk away, this apartment provides the ideal urban living experience.",
        "Neighborhood Description": "Sunnyside is a sought-after neighborhood known for its friendly community vibe and proximity to downtown Denver. Enjoy easy access to trendy cafes, local breweries, and beautiful parks. With tree-lined streets and a mix of historic and modern architecture, Sunnyside offers the perfect blend of urban convenience and suburban charm.",
        "id": "c376084e-6315-4031-bd2d-932776931581",
        "image_path": "../Data/Images/c376084e-6315-4031-bd2d-932776931581.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Noe Valley",
        "City": "San Francisco",
        "State": "California",
        "Price": "$750,000",
        "Bedrooms": 3,
        "Bathrooms": 2.5,
        "House Size": "2000 sqft",
        "Description": "Welcome to this charming single-family home in the heart of Noe Valley. This beautifully renovated property features a spacious open floor plan, updated kitchen with high-end appliances, and a cozy backyard perfect for entertaining. With three bedrooms, two and a half bathrooms, and ample natural light throughout, this home offers the ideal blend of modern comfort and classic San Francisco charm.",
        "Neighborhood Description": "Noe Valley is a vibrant neighborhood known for its picturesque streets, trendy boutiques, and excellent dining options. Residents enjoy easy access to local parks, farmers' markets, and convenient public transportation, making it a sought-after location for families and professionals alike.",
        "id": "b01140a1-31e4-41ae-80f2-fcef9ff114d5",
        "image_path": "../Data/Images/b01140a1-31e4-41ae-80f2-fcef9ff114d5.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "The Gulch",
        "City": "Nashville",
        "State": "Tennessee",
        "Price": "$200,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Discover urban living at its finest in this sleek one-bedroom apartment in the vibrant Gulch neighborhood of Nashville. The modern design, open layout, and high-end finishes make this a stylish retreat. Enjoy the convenience of nearby restaurants, shops, and entertainment venues.",
        "Neighborhood Description": "The Gulch is a trendy neighborhood known for its upscale dining, boutique shopping, and lively nightlife. Situated in the heart of Nashville, residents enjoy a blend of urban convenience and a vibrant social scene.",
        "id": "4aaba1b2-83ea-4ce4-aac3-f0bd354314d4",
        "image_path": "../Data/Images/4aaba1b2-83ea-4ce4-aac3-f0bd354314d4.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Federal Hill",
        "City": "Baltimore",
        "State": "Maryland",
        "Price": "$260,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Discover urban living at its finest in this stylish 1-bedroom condo in Federal Hill. Featuring modern amenities, a sleek kitchen, and panoramic city views, this condo offers the perfect blend of comfort and convenience. Enjoy easy access to restaurants, shops, and parks, making it ideal for young professionals or couples seeking a vibrant city lifestyle.",
        "Neighborhood Description": "Federal Hill is a historic neighborhood known for its charming cobblestone streets, eclectic dining options, and lively atmosphere. Residents enjoy close proximity to the Inner Harbor, stadiums, and cultural attractions.",
        "id": "ec8a4561-25b7-447a-9dc7-008d8831c58c",
        "image_path": "../Data/Images/ec8a4561-25b7-447a-9dc7-008d8831c58c.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Harbor East",
        "City": "Baltimore",
        "State": "Maryland",
        "Price": "$550,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1,400 sqft",
        "Description": "Luxury meets convenience in this exquisite 2-bedroom condo in Harbor East. Boasting upscale finishes, a spacious layout, and sweeping waterfront views, this condo offers an unparalleled living experience. Indulge in the vibrant city life with easy access to fine dining, shopping, and entertainment options.",
        "Neighborhood Description": "Harbor East is a premier waterfront neighborhood brimming with upscale boutiques, gourmet restaurants, and luxury hotels. Residents enjoy a sophisticated urban lifestyle with a bustling nightlife and proximity to the waterfront promenade.",
        "id": "7f3ee503-2d5e-4e33-9761-eedcceacac50",
        "image_path": "../Data/Images/7f3ee503-2d5e-4e33-9761-eedcceacac50.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Summerlin",
        "City": "Las Vegas",
        "State": "Nevada",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Charming studio apartment located in the desirable Summerlin neighborhood of Las Vegas. This cozy space offers modern amenities and a convenient location for city living. Ideal for a single professional or student seeking a comfortable living space.",
        "Neighborhood Description": "Summerlin is a prestigious master-planned community known for its beautiful parks, top-rated schools, and upscale shopping centers. Residents enjoy a tranquil suburban environment with easy access to the excitement of the Las Vegas Strip.",
        "id": "142a8b86-9b79-4109-823f-ac8bb26b6fd3",
        "image_path": "../Data/Images/142a8b86-9b79-4109-823f-ac8bb26b6fd3.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Downtown Las Vegas",
        "City": "Las Vegas",
        "State": "Nevada",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment in the heart of Downtown Las Vegas. This stylish urban retreat features high-end finishes, panoramic city views, and state-of-the-art amenities. Perfect for those looking to experience the vibrant energy of downtown living.",
        "Neighborhood Description": "Downtown Las Vegas is a thriving cultural hub with a mix of historic charm and modern attractions. Enjoy trendy restaurants, art galleries, and entertainment venues just steps away from this dynamic neighborhood.",
        "id": "a90ea539-fe66-4a44-8ba6-9770b9237aba",
        "image_path": "../Data/Images/a90ea539-fe66-4a44-8ba6-9770b9237aba.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Uptown",
        "City": "New Orleans",
        "State": "Louisiana",
        "Price": "$300,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Charming townhouse in the historic Uptown neighborhood of New Orleans. This beautifully renovated home features a spacious layout with modern amenities while preserving its classic architectural details. Enjoy the vibrant cultural scene and lively atmosphere of Uptown living. Perfect for those seeking a blend of historic charm and contemporary comfort.",
        "Neighborhood Description": "Uptown is known for its tree-lined streets, historic mansions, and diverse community. Residents enjoy easy access to local shops, restaurants, and cultural attractions. The neighborhood has a rich history and offers a blend of traditional New Orleans architecture with a modern twist.",
        "id": "28779df3-9091-437c-9dde-5ddbe627aefd",
        "image_path": "../Data/Images/28779df3-9091-437c-9dde-5ddbe627aefd.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Marigny",
        "City": "New Orleans",
        "State": "Louisiana",
        "Price": "$450,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Elegant townhouse located in the vibrant Marigny neighborhood of New Orleans. This spacious home boasts high ceilings, a gourmet kitchen, and a private courtyard for outdoor entertaining. Experience the unique blend of art, music, and culture that defines Marigny living. Ideal for those seeking a sophisticated urban lifestyle.",
        "Neighborhood Description": "Marigny is a dynamic neighborhood known for its eclectic mix of artsy vibes, live music venues, and historic architecture. Residents enjoy a lively nightlife scene, local art galleries, and a strong sense of community. The neighborhood has a bohemian charm that attracts creatives and urban professionals alike.",
        "id": "c5b015e0-be66-44be-b6d1-ad713d765f5b",
        "image_path": "../Data/Images/c5b015e0-be66-44be-b6d1-ad713d765f5b.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "East Nashville",
        "City": "Nashville",
        "State": "Tennessee",
        "Price": "$150,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Discover urban living in this charming one-bedroom apartment in the vibrant East Nashville neighborhood. The unit features modern finishes, a cozy living space, a well-equipped kitchen, and a private balcony. Enjoy the convenience of nearby trendy cafes, local shops, and easy access to downtown Nashville.",
        "Neighborhood Description": "East Nashville is known for its eclectic mix of cafes, music venues, and art galleries. It's a popular choice for young professionals and artists, offering a lively atmosphere with a community feel. Residents enjoy walkable streets, diverse dining options, and a rich music scene.",
        "id": "42698551-e336-4c30-9a3c-d22895617669",
        "image_path": "../Data/Images/42698551-e336-4c30-9a3c-d22895617669.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Summerlin",
        "City": "Las Vegas",
        "State": "Nevada",
        "Price": "$55,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Cozy 1-bedroom mobile home located in the desirable Summerlin neighborhood of Las Vegas. This charming home offers a comfortable living space with a well-maintained interior, perfect for a single individual or a couple. Enjoy the convenience of mobile home living with access to community amenities and close proximity to shopping, dining, and entertainment.",
        "Neighborhood Description": "Summerlin is a premier master-planned community known for its parks, trails, and family-friendly environment. Residents enjoy a high quality of life with access to top-rated schools, shopping centers, golf courses, and recreational facilities.",
        "id": "66ab88b0-e292-4fcd-b2df-589f5bf24403",
        "image_path": "../Data/Images/66ab88b0-e292-4fcd-b2df-589f5bf24403.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Henderson",
        "City": "Las Vegas",
        "State": "Nevada",
        "Price": "$120,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1,000 sqft",
        "Description": "Spacious 2-bedroom mobile home located in the peaceful Henderson neighborhood of Las Vegas. This well-maintained home features a modern interior, a functional layout, and a private outdoor space. Ideal for a small family or those looking for a low-maintenance lifestyle in a convenient location.",
        "Neighborhood Description": "Henderson offers a suburban setting with a mix of residential areas, parks, and local amenities. It is known for its safety, excellent schools, and community events, making it a desirable place to call home.",
        "id": "70537cd4-88e2-451b-b61a-ef88c0b5d0d5",
        "image_path": "../Data/Images/70537cd4-88e2-451b-b61a-ef88c0b5d0d5.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Gentilly Terrace",
        "City": "New Orleans",
        "State": "Louisiana",
        "Price": "$80,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Charming mobile home in the historic Gentilly Terrace neighborhood. This cozy 1-bedroom, 1-bathroom home offers a comfortable living space with a modern kitchen and a small patio area. Perfect for a single individual or a couple looking for affordable housing in a vibrant community.",
        "Neighborhood Description": "Gentilly Terrace is known for its tree-lined streets and diverse community. Residents enjoy easy access to local parks, shops, and restaurants, making it a desirable location for those seeking a close-knit neighborhood feel.",
        "id": "81184c52-c262-4230-865f-6d7d3669d411",
        "image_path": "../Data/Images/81184c52-c262-4230-865f-6d7d3669d411.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Algiers Point",
        "City": "New Orleans",
        "State": "Louisiana",
        "Price": "$130,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1000 sqft",
        "Description": "Spacious mobile home in the historic Algiers Point neighborhood. This 2-bedroom, 2-bathroom home features a bright living room, updated kitchen, and a fenced backyard. Ideal for a small family or individuals looking for a cozy retreat near the Mississippi River.",
        "Neighborhood Description": "Algiers Point offers a mix of historic charm and modern amenities. With its waterfront location and vibrant arts scene, this neighborhood attracts residents seeking a relaxed lifestyle within easy reach of downtown New Orleans.",
        "id": "6cde8877-f09a-4ab7-ace5-d9002015e5e7",
        "image_path": "../Data/Images/6cde8877-f09a-4ab7-ace5-d9002015e5e7.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Santa Monica",
        "City": "Los Angeles",
        "State": "California",
        "Price": "$550,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1,200 sqft",
        "Description": "Welcome to this stylish condo in the heart of Santa Monica. This modern unit features two spacious bedrooms, two bathrooms, and a beautifully designed interior. The open floor plan creates a bright and airy atmosphere, perfect for entertaining. Enjoy the convenience of living close to the beach, trendy restaurants, and vibrant shopping areas.",
        "Neighborhood Description": "Santa Monica is known for its bustling atmosphere, pristine beaches, and upscale dining. Residents enjoy easy access to popular attractions like the Santa Monica Pier, Third Street Promenade, and Palisades Park. The neighborhood offers a blend of urban convenience and coastal charm, making it a highly sought-after location in Los Angeles.",
        "id": "07cfe1ee-e172-409b-a20d-4fc2871c0292",
        "image_path": "../Data/Images/07cfe1ee-e172-409b-a20d-4fc2871c0292.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Silver Lake",
        "City": "Los Angeles",
        "State": "California",
        "Price": "$320,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Discover the charm of Silver Lake living in this cozy one-bedroom condo. The unit features a modern kitchen, a spacious living area, and a private balcony with scenic views. With its prime location near trendy cafes, boutiques, and parks, this condo offers the perfect blend of comfort and convenience.",
        "Neighborhood Description": "Silver Lake is a vibrant neighborhood known for its hipster culture, eclectic dining scene, and artistic community. Residents enjoy exploring the local coffee shops, vintage stores, and the picturesque Silver Lake Reservoir. The area has a creative energy that appeals to artists, musicians, and young professionals.",
        "id": "26a4393e-dfd3-482a-923d-0103167ec078",
        "image_path": "../Data/Images/26a4393e-dfd3-482a-923d-0103167ec078.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Sugar House",
        "City": "Salt Lake City",
        "State": "Utah",
        "Price": "$300,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Charming townhouse in the vibrant Sugar House neighborhood, offering a mix of urban amenities and a cozy community atmosphere. This well-maintained home features modern upgrades, a spacious living area, and a private backyard perfect for relaxing or entertaining. Conveniently located near local shops, restaurants, and parks.",
        "Neighborhood Description": "Sugar House is a trendy, historic neighborhood known for its eclectic mix of boutiques, cafes, and cultural attractions. Residents enjoy tree-lined streets, easy access to public transportation, and a strong sense of community.",
        "id": "ac5338f4-bdeb-4f83-a0a3-03e30d92fe1f",
        "image_path": "../Data/Images/ac5338f4-bdeb-4f83-a0a3-03e30d92fe1f.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "The Avenues",
        "City": "Salt Lake City",
        "State": "Utah",
        "Price": "$450,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2200 sqft",
        "Description": "Elegant townhouse in the prestigious Avenues neighborhood, offering a perfect blend of historic charm and modern luxury. This spacious home boasts high ceilings, a gourmet kitchen, and stunning views of the city skyline. Enjoy the convenience of urban living combined with the tranquility of a tree-lined residential street.",
        "Neighborhood Description": "The Avenues is a historic district known for its Victorian homes, tree-lined avenues, and panoramic views of the Salt Lake Valley. Residents appreciate the neighborhood's proximity to downtown amenities and outdoor recreation opportunities.",
        "id": "248b1d1b-e09c-4961-9489-48c1b8ca0f03",
        "image_path": "../Data/Images/248b1d1b-e09c-4961-9489-48c1b8ca0f03.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Sugar House",
        "City": "Salt Lake City",
        "State": "Utah",
        "Price": "$75,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Cozy mobile home located in the desirable Sugar House neighborhood. This well-maintained property offers an open living area, a modern kitchen, and a comfortable bedroom. Perfect for a single individual or a couple looking for affordable city living.",
        "Neighborhood Description": "Sugar House is known for its vibrant community, tree-lined streets, and proximity to parks, cafes, and local boutiques. Residents enjoy a relaxed urban lifestyle with easy access to amenities.",
        "id": "ec5641d5-c3ae-47b4-ba90-a477a87ef2b4",
        "image_path": "../Data/Images/ec5641d5-c3ae-47b4-ba90-a477a87ef2b4.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Downtown",
        "City": "Salt Lake City",
        "State": "Utah",
        "Price": "$130,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1,000 sqft",
        "Description": "Charming mobile home in the heart of Downtown Salt Lake City. This property features two spacious bedrooms, two updated bathrooms, a bright living room, and a modern kitchen. Ideal for urban dwellers seeking convenience and comfort.",
        "Neighborhood Description": "Downtown Salt Lake City offers a dynamic urban environment with a mix of historic buildings, trendy restaurants, and cultural attractions. Residents enjoy a bustling atmosphere and easy access to public transportation.",
        "id": "0e135beb-797e-4f7a-a54b-9e2f55ad0484",
        "image_path": "../Data/Images/0e135beb-797e-4f7a-a54b-9e2f55ad0484.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Ohio City",
        "City": "Cleveland",
        "State": "Ohio",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Charming 1-bedroom condo in the vibrant Ohio City neighborhood. This cozy unit features modern amenities, a stylish kitchen, and a comfortable living space. Enjoy the convenience of urban living with nearby cafes, restaurants, and parks.",
        "Neighborhood Description": "Ohio City is known for its historic charm, trendy boutiques, craft breweries, and diverse dining options. Residents enjoy a lively atmosphere with a strong sense of community.",
        "id": "507d0a4d-3b40-4ac4-9518-b572783fbddb",
        "image_path": "../Data/Images/507d0a4d-3b40-4ac4-9518-b572783fbddb.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Downtown Cleveland",
        "City": "Cleveland",
        "State": "Ohio",
        "Price": "$400,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1500 sqft",
        "Description": "Stunning 2-bedroom condo with panoramic views of downtown Cleveland. This spacious unit boasts high-end finishes, a private balcony, and luxurious amenities. Experience upscale city living at its finest.",
        "Neighborhood Description": "Downtown Cleveland offers a mix of entertainment, cultural attractions, and dining options. Enjoy easy access to theaters, sports venues, and waterfront activities.",
        "id": "59d62caf-388a-4b77-9172-8c79ca9d1afd",
        "image_path": "../Data/Images/59d62caf-388a-4b77-9172-8c79ca9d1afd.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Shaker Square",
        "City": "Cleveland",
        "State": "Ohio",
        "Price": "$600,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "2000 sqft",
        "Description": "Luxurious 3-bedroom condo in the prestigious Shaker Square neighborhood. This elegant unit features a gourmet kitchen, spa-like bathrooms, and expansive living spaces. Enjoy upscale living in a prime location.",
        "Neighborhood Description": "Shaker Square is known for its historic architecture, upscale shopping, and fine dining establishments. The tree-lined streets and proximity to parks create a serene residential setting.",
        "id": "b2a534bc-ea5c-4f91-9ada-4ddf83c9fb05",
        "image_path": "../Data/Images/b2a534bc-ea5c-4f91-9ada-4ddf83c9fb05.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Sunnyside",
        "City": "Denver",
        "State": "Colorado",
        "Price": "$70,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Charming mobile home located in the vibrant Sunnyside neighborhood. This cozy 1-bedroom, 1-bathroom home offers a comfortable living space with modern amenities. Perfect for those seeking a convenient and affordable housing option in Denver.",
        "Neighborhood Description": "Sunnyside is a popular neighborhood in Denver known for its tree-lined streets, local eateries, and community parks. Residents enjoy easy access to downtown Denver and a variety of entertainment options.",
        "id": "b273ecee-96ee-4b99-b33f-a640fdfe5c10",
        "image_path": "../Data/Images/b273ecee-96ee-4b99-b33f-a640fdfe5c10.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Highland",
        "City": "Denver",
        "State": "Colorado",
        "Price": "$130,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1000 sqft",
        "Description": "Modern mobile home situated in the desirable Highland neighborhood. This 2-bedroom, 2-bathroom property features a spacious layout, updated kitchen, and a cozy outdoor area. Ideal for those looking for a stylish and affordable home in a prime Denver location.",
        "Neighborhood Description": "Highland is a trendy neighborhood in Denver known for its mix of historic and contemporary architecture, boutique shops, and lively atmosphere. Residents can enjoy trendy restaurants, art galleries, and easy access to outdoor activities.",
        "id": "e76eae04-06f5-42c4-938c-ed51e3660d03",
        "image_path": "../Data/Images/e76eae04-06f5-42c4-938c-ed51e3660d03.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Beacon Hill",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$200,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Charming one-bedroom apartment in the historic Beacon Hill neighborhood. This cozy unit features a renovated kitchen, hardwood floors, and ample natural light. Perfect for a young professional or couple seeking a quintessential Boston living experience.",
        "Neighborhood Description": "Beacon Hill is known for its cobblestone streets, historic charm, and proximity to Boston Common. Residents enjoy upscale shopping, dining, and a vibrant community atmosphere.",
        "id": "5c38db16-0487-4913-a4aa-960758a38156",
        "image_path": "../Data/Images/5c38db16-0487-4913-a4aa-960758a38156.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Back Bay",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$250,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "900 sqft",
        "Description": "Stunning two-bedroom apartment in the prestigious Back Bay neighborhood. This modern unit boasts high-end finishes, spacious living areas, and panoramic city views. Ideal for those seeking luxury urban living in the heart of Boston.",
        "Neighborhood Description": "Back Bay is known for its elegant Victorian brownstones, upscale boutiques, and world-class dining options. It offers a perfect blend of historic charm and contemporary sophistication.",
        "id": "3b0fbc4d-1468-48ef-9b8a-53b61574a59a",
        "image_path": "../Data/Images/3b0fbc4d-1468-48ef-9b8a-53b61574a59a.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Summerlin",
        "City": "Las Vegas",
        "State": "Nevada",
        "Price": "$350,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Discover modern living in this stylish townhouse located in the prestigious Summerlin neighborhood. With 3 bedrooms, 2 bathrooms, and an open floor plan, this home offers a perfect blend of comfort and sophistication. Enjoy the convenience of nearby shopping centers and parks, making it an ideal choice for families or professionals seeking a vibrant community.",
        "Neighborhood Description": "Summerlin is known for its upscale amenities, including top-rated schools, beautiful parks, and a variety of shopping and dining options. Residents enjoy a safe and friendly environment with easy access to major highways for convenient commuting.",
        "id": "2995d228-d267-4c0c-9510-bf4eb62bd3b6",
        "image_path": "../Data/Images/2995d228-d267-4c0c-9510-bf4eb62bd3b6.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Green Valley",
        "City": "Las Vegas",
        "State": "Nevada",
        "Price": "$250,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1200 sqft",
        "Description": "Nestled in the desirable Green Valley neighborhood, this charming townhouse offers 2 bedrooms, 1 bathroom, and a cozy living space perfect for first-time buyers or downsizers. The home features a private patio, ideal for relaxing or entertaining guests. Experience a serene lifestyle with convenient access to nearby amenities and entertainment venues.",
        "Neighborhood Description": "Green Valley is a well-established community known for its tree-lined streets, parks, and family-friendly atmosphere. Residents can enjoy a wide range of dining options, shopping centers, and recreational facilities within close proximity.",
        "id": "11ffe39a-5357-41e7-aa19-7924854bb7f6",
        "image_path": "../Data/Images/11ffe39a-5357-41e7-aa19-7924854bb7f6.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Pacific Heights",
        "City": "San Francisco",
        "State": "California",
        "Price": "$4,500,000",
        "Bedrooms": 7,
        "Bathrooms": 4,
        "House Size": "7000 sqft",
        "Description": "Experience unparalleled luxury in this exquisite Pacific Heights estate. This grand residence features stunning architectural details, high-end finishes, and panoramic views of the city skyline. With 7 bedrooms, 4 bathrooms, and expansive living spaces, this home offers the ultimate in comfort and style. Enjoy a private backyard oasis, perfect for entertaining or relaxing in the heart of San Francisco.",
        "Neighborhood Description": "Pacific Heights is one of San Francisco's most prestigious neighborhoods, known for its historic mansions, stunning views, and upscale shopping and dining options. Residents enjoy easy access to parks, schools, and cultural attractions, making it a sought-after location for those seeking a luxurious urban lifestyle.",
        "id": "c2abac37-9ea5-47aa-a192-dc5f83bf0527",
        "image_path": "../Data/Images/c2abac37-9ea5-47aa-a192-dc5f83bf0527.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Jamaica Plain",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$325,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Welcome to this charming Ranch-Style Home in the heart of Jamaica Plain. This home features three cozy bedrooms, a lovely living room with a fireplace, a spacious kitchen, and a beautiful backyard perfect for hosting gatherings. With easy access to local shops, parks, and public transportation, this property offers the ideal blend of comfort and convenience.",
        "Neighborhood Description": "Jamaica Plain is a vibrant neighborhood known for its diverse community, trendy boutiques, and delicious eateries. Residents enjoy easy access to the Arnold Arboretum, Franklin Park, and the Emerald Necklace for outdoor activities and relaxation.",
        "id": "876c0728-2704-4d02-b543-b22f81150ef6",
        "image_path": "../Data/Images/876c0728-2704-4d02-b543-b22f81150ef6.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Brookline",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$475,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Step into this elegant Ranch-Style Home located in the desirable neighborhood of Brookline. Boasting four spacious bedrooms, three modern bathrooms, a gourmet kitchen, and a sunlit family room, this residence exudes comfort and style. The property also features a lovely deck overlooking a manicured garden, creating a serene retreat for relaxation and entertainment.",
        "Neighborhood Description": "Brookline is a prestigious neighborhood known for its tree-lined streets, top-rated schools, and upscale shops. With easy access to parks, cultural attractions, and public transportation, residents enjoy a luxurious yet convenient lifestyle in this coveted area.",
        "id": "8f43091d-891b-4261-bbbf-33593f8ba731",
        "image_path": "../Data/Images/8f43091d-891b-4261-bbbf-33593f8ba731.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Tremont",
        "City": "Cleveland",
        "State": "Ohio",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Charming studio apartment in the heart of Tremont, offering a cozy living space with modern amenities. This unit features a well-equipped kitchen, a bright and airy atmosphere, and easy access to local cafes and shops. Perfect for young professionals or students looking for a convenient urban lifestyle.",
        "Neighborhood Description": "Tremont is a vibrant neighborhood known for its historic architecture, trendy eateries, and artistic community. Enjoy a blend of old-world charm and modern conveniences, with tree-lined streets and local parks providing a welcoming environment for residents.",
        "id": "6d23eeea-11bb-4d84-ade9-6dcc4f4a1883",
        "image_path": "../Data/Images/6d23eeea-11bb-4d84-ade9-6dcc4f4a1883.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Ohio City",
        "City": "Cleveland",
        "State": "Ohio",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment in the sought-after Ohio City neighborhood, featuring high-end finishes and panoramic city views. This upscale unit boasts a spacious layout, gourmet kitchen, and designer fixtures. Experience upscale living with easy access to dining, entertainment, and cultural attractions.",
        "Neighborhood Description": "Ohio City is a dynamic neighborhood known for its craft breweries, farm-to-table restaurants, and historic market. Residents enjoy a lively atmosphere with a strong sense of community, along with proximity to the city center and waterfront.",
        "id": "4f01a0b7-8c1d-4a68-aa6d-92c872b5ce19",
        "image_path": "../Data/Images/4f01a0b7-8c1d-4a68-aa6d-92c872b5ce19.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Waikiki",
        "City": "Honolulu",
        "State": "Hawaii",
        "Price": "$300,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Experience the vibrant lifestyle of Waikiki in this charming 1-bedroom condo. Featuring modern amenities and stunning views, this cozy unit is perfect for those seeking a blend of relaxation and urban excitement. Enjoy easy access to the beach, shopping, and dining just steps away.",
        "Neighborhood Description": "Waikiki is a bustling neighborhood known for its beautiful beaches, vibrant nightlife, and diverse dining options. Residents and visitors alike enjoy the lively atmosphere and convenient access to entertainment and recreational activities.",
        "id": "77a03a6b-91b8-4637-9210-920fa6a7d2f9",
        "image_path": "../Data/Images/77a03a6b-91b8-4637-9210-920fa6a7d2f9.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Kakaako",
        "City": "Honolulu",
        "State": "Hawaii",
        "Price": "$550,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1,200 sqft",
        "Description": "Luxury meets convenience in this 2-bedroom condo located in the sought-after Kakaako neighborhood. Enjoy high-end finishes, spacious interiors, and breathtaking ocean views. This is a rare opportunity to own a piece of paradise in the heart of Honolulu.",
        "Neighborhood Description": "Kakaako is a rapidly developing urban neighborhood with a mix of residential towers, trendy shops, and upscale dining options. It offers a modern and vibrant lifestyle with easy access to parks, museums, and entertainment venues.",
        "id": "3fdb0fe9-973c-4e4c-913f-4ef34061a514",
        "image_path": "../Data/Images/3fdb0fe9-973c-4e4c-913f-4ef34061a514.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Garden District",
        "City": "New Orleans",
        "State": "Louisiana",
        "Price": "$650,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2800 sqft",
        "Description": "Nestled in the historic Garden District, this charming single-family home offers a perfect blend of classic architecture and modern amenities. With 4 bedrooms, 3 bathrooms, and a spacious living area, this home provides a comfortable and luxurious living experience. Featuring elegant details, a lush backyard, and proximity to vibrant shops and restaurants, this property embodies the epitome of New Orleans charm.",
        "Neighborhood Description": "The Garden District is renowned for its stunning mansions, tree-lined streets, and historic allure. Residents enjoy a peaceful and upscale ambiance, with easy access to beautiful parks, bustling cafes, and iconic landmarks like Magazine Street and the St. Charles Avenue streetcar line.",
        "id": "dedde903-ba1b-453e-900e-1888c78c7960",
        "image_path": "../Data/Images/dedde903-ba1b-453e-900e-1888c78c7960.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "East Village",
        "City": "New York City",
        "State": "New York",
        "Price": "$175,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Charming one-bedroom apartment in the heart of the vibrant East Village. This cozy unit features modern amenities, natural light, and hardwood floors. Perfect for a young professional or a couple looking to experience the best of city living. Steps away from trendy cafes, boutiques, and parks.",
        "Neighborhood Description": "East Village is a dynamic neighborhood known for its artistic vibe, eclectic dining scene, and bustling nightlife. It offers a mix of historic charm and contemporary energy, attracting a diverse community of residents.",
        "id": "d9adc477-a74c-4c7e-9022-92f12643907f",
        "image_path": "../Data/Images/d9adc477-a74c-4c7e-9022-92f12643907f.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Virginia Highland",
        "City": "Atlanta",
        "State": "Georgia",
        "Price": "$600,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2500 sqft",
        "Description": "Experience true Atlanta living in this charming single-family home nestled in the vibrant Virginia Highland neighborhood. This spacious 4-bedroom, 3-bathroom home offers a perfect blend of modern amenities and historic charm. Enjoy the open floor plan, gourmet kitchen, and a beautifully landscaped backyard oasis, ideal for entertaining guests or relaxing. Conveniently located near parks, restaurants, and shops, this home provides the ultimate Atlanta lifestyle.",
        "Neighborhood Description": "Virginia Highland is a picturesque and sought-after neighborhood known for its tree-lined streets, historic bungalows, and vibrant community. Residents enjoy easy access to boutique shops, trendy eateries, and beautiful parks like Piedmont Park. With a strong sense of community and bustling social scene, Virginia Highland offers the perfect blend of urban living with a touch of Southern charm.",
        "id": "c03bef13-efb0-4b89-b751-bf46abd3a4c6",
        "image_path": "../Data/Images/c03bef13-efb0-4b89-b751-bf46abd3a4c6.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Virginia-Highland",
        "City": "Atlanta",
        "State": "Georgia",
        "Price": "$600,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2500 sqft",
        "Description": "Charming single-family home in the highly sought-after Virginia-Highland neighborhood. This beautifully renovated home features a spacious layout with modern finishes. Enjoy a cozy fireplace, gourmet kitchen, and a private backyard oasis. Perfect for entertaining or relaxing. Walking distance to trendy shops, restaurants, and parks.",
        "Neighborhood Description": "Virginia-Highland is a vibrant and historic neighborhood known for its tree-lined streets, eclectic mix of architecture, and lively community. Residents enjoy easy access to the BeltLine, Piedmont Park, and a variety of dining and entertainment options.",
        "id": "a618de1a-6ecc-4d05-8f88-37c547ab0127",
        "image_path": "../Data/Images/a618de1a-6ecc-4d05-8f88-37c547ab0127.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Buckhead",
        "City": "Atlanta",
        "State": "Georgia",
        "Price": "$750,000",
        "Bedrooms": 5,
        "Bathrooms": 4,
        "House Size": "3200 sqft",
        "Description": "Luxurious single-family home located in prestigious Buckhead. This stunning residence boasts high-end finishes, a gourmet kitchen, elegant master suite, and a beautifully landscaped backyard. Relax in the spacious living areas or entertain guests in style. Close to top-rated schools, upscale shopping, and fine dining.",
        "Neighborhood Description": "Buckhead is Atlanta's upscale district known for its luxury homes, upscale shopping, and vibrant nightlife. Residents enjoy a mix of historic charm and modern amenities, with easy access to parks, country clubs, and cultural attractions.",
        "id": "be4da4f4-0246-4ad8-b795-a5440c6f6b9c",
        "image_path": "../Data/Images/be4da4f4-0246-4ad8-b795-a5440c6f6b9c.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Beacon Hill",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$750,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2400 sqft",
        "Description": "Nestled in the historic Beacon Hill neighborhood, this charming single-family home offers a perfect blend of classic elegance and modern comfort. With 4 spacious bedrooms, 3 bathrooms, and ample living space, this home is ideal for families seeking a blend of luxury and convenience. Enjoy the vibrant community, cobblestone streets, and easy access to Boston's finest dining and shopping destinations.",
        "Neighborhood Description": "Beacon Hill is known for its picturesque streets lined with historic brick townhouses, upscale boutiques, and cozy cafes. Residents enjoy a friendly community atmosphere, proximity to the Boston Common, and easy access to public transportation.",
        "id": "f25628ba-0ca1-4a18-acc0-38886775502d",
        "image_path": "../Data/Images/f25628ba-0ca1-4a18-acc0-38886775502d.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Jamaica Plain",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$400,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1500 sqft",
        "Description": "Located in the vibrant neighborhood of Jamaica Plain, this lovely single-family home offers a cozy retreat with 3 bedrooms, 2 bathrooms, and a comfortable living space. Perfect for those seeking a peaceful oasis with easy access to urban amenities. Embrace the eclectic community, lush green spaces, and diverse dining options that define Jamaica Plain's unique charm.",
        "Neighborhood Description": "Jamaica Plain is a diverse neighborhood known for its green spaces, artsy vibe, and community-oriented atmosphere. Residents enjoy the Arnold Arboretum, local breweries, and a strong sense of community spirit.",
        "id": "7019bdd5-fd52-4414-8e12-3c1afc3adc1a",
        "image_path": "../Data/Images/7019bdd5-fd52-4414-8e12-3c1afc3adc1a.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Harvard-Yale",
        "City": "Salt Lake City",
        "State": "Utah",
        "Price": "$375,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Discover urban living at its finest in this modern townhouse located in the desirable Harvard-Yale neighborhood. This stylish home features sleek finishes, an open floor plan, and abundant natural light. Enjoy the convenience of nearby parks, cafes, and shops, making it perfect for those seeking a vibrant lifestyle.",
        "Neighborhood Description": "Harvard-Yale is known for its tree-lined streets, historic charm, and close-knit community. Residents enjoy easy access to downtown Salt Lake City, top-rated schools, and a variety of dining and entertainment options.",
        "id": "116589b5-a361-406a-af57-a0aba723a7e3",
        "image_path": "../Data/Images/116589b5-a361-406a-af57-a0aba723a7e3.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Sugar House",
        "City": "Salt Lake City",
        "State": "Utah",
        "Price": "$250,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1200 sqft",
        "Description": "Charming townhouse nestled in the heart of the vibrant Sugar House neighborhood. This cozy home features a private patio, updated kitchen, and a peaceful atmosphere. Ideal for those who appreciate the mix of urban amenities and a sense of community.",
        "Neighborhood Description": "Sugar House is a trendy neighborhood known for its eclectic mix of shops, restaurants, and entertainment venues. With tree-lined streets and a lively atmosphere, residents enjoy a dynamic lifestyle with easy access to parks and local events.",
        "id": "42387e50-4274-4620-a2ea-3a7f00eb330d",
        "image_path": "../Data/Images/42387e50-4274-4620-a2ea-3a7f00eb330d.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Cherry Creek",
        "City": "Denver",
        "State": "Colorado",
        "Price": "$3,500,000",
        "Bedrooms": 8,
        "Bathrooms": 5,
        "House Size": "10,000 sqft",
        "Description": "Nestled in the prestigious Cherry Creek neighborhood, this luxury estate offers unparalleled elegance and sophistication. With 8 bedrooms, 5 bathrooms, and 10,000 sqft of exquisite living space, this home is a masterpiece of design and craftsmanship. Enjoy breathtaking mountain views and top-of-the-line amenities throughout. Perfect for discerning buyers seeking the epitome of luxury living in Denver.",
        "Neighborhood Description": "Cherry Creek is known for its upscale shopping, dining, and vibrant cultural scene. Residents enjoy tree-lined streets, beautiful parks, and easy access to Cherry Creek Trail for outdoor activities.",
        "id": "941869ce-d621-4546-84c1-76d59b7d6668",
        "image_path": "../Data/Images/941869ce-d621-4546-84c1-76d59b7d6668.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Federal Hill",
        "City": "Baltimore",
        "State": "Maryland",
        "Price": "$525,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2400 sqft",
        "Description": "Discover this charming single-family home in the heart of Federal Hill. This beautifully maintained property features 4 bedrooms, 3 bathrooms, and a spacious living area perfect for family gatherings. Enjoy a modern kitchen, hardwood floors, and a private backyard oasis. Located near parks, restaurants, and entertainment, this home offers both convenience and comfort.",
        "Neighborhood Description": "Federal Hill is a historic neighborhood known for its vibrant community, local shops, and stunning views of the Inner Harbor. Residents enjoy easy access to upscale dining, boutique shopping, and cultural attractions.",
        "id": "c64e00b9-6d5b-46ac-ac6e-4df7df584ab0",
        "image_path": "../Data/Images/c64e00b9-6d5b-46ac-ac6e-4df7df584ab0.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Garden District",
        "City": "New Orleans",
        "State": "Louisiana",
        "Price": "$250,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1200 sqft",
        "Description": "Experience the charm of New Orleans living in this elegant condo located in the historic Garden District. This beautifully updated unit features 2 bedrooms, 2 bathrooms, and ample living space. Enjoy the convenience of urban living while surrounded by picturesque streets lined with oak trees and historic homes.",
        "Neighborhood Description": "The Garden District is renowned for its stunning architecture, lush gardens, and vibrant atmosphere. With its proximity to top-rated restaurants, boutique shops, and cultural attractions, this neighborhood offers a perfect blend of historic charm and modern convenience.",
        "id": "9fde1cec-5ac0-4193-9920-50a1f3040a92",
        "image_path": "../Data/Images/9fde1cec-5ac0-4193-9920-50a1f3040a92.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "French Quarter",
        "City": "New Orleans",
        "State": "Louisiana",
        "Price": "$500,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Live the dream in this luxurious condo nestled in the heart of the iconic French Quarter. This spacious unit boasts 3 bedrooms, 2 bathrooms, and elegant finishes throughout. Immerse yourself in the vibrant culture and rich history of New Orleans from the comfort of your own stunning retreat.",
        "Neighborhood Description": "The French Quarter is a lively and historic neighborhood known for its lively nightlife, world-class dining, and unique architecture. Experience the magic of New Orleans with easy access to iconic landmarks, jazz clubs, and bustling markets.",
        "id": "56b13c85-278e-409b-9eee-01e043ce1b6f",
        "image_path": "../Data/Images/56b13c85-278e-409b-9eee-01e043ce1b6f.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Grant Park",
        "City": "Atlanta",
        "State": "Georgia",
        "Price": "$70,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Charming mobile home in the historic Grant Park neighborhood. This cozy 1-bedroom, 1-bathroom home offers a comfortable living space with a small yard for outdoor enjoyment. Ideal for a single individual or a couple looking for a convenient, affordable living option in the heart of Atlanta.",
        "Neighborhood Description": "Grant Park is known for its Victorian-style homes, tree-lined streets, and the famous Grant Park, which features the Atlanta Zoo and recreational areas. Residents enjoy a vibrant community with easy access to local restaurants, shops, and cultural attractions.",
        "id": "479fd91b-132e-45f4-bc6f-b1bd302a800a",
        "image_path": "../Data/Images/479fd91b-132e-45f4-bc6f-b1bd302a800a.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Buckhead",
        "City": "Atlanta",
        "State": "Georgia",
        "Price": "$130,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1000 sqft",
        "Description": "Modern mobile home located in the prestigious Buckhead neighborhood. This 2-bedroom, 2-bathroom residence offers a contemporary living space with updated amenities and a stylish design. Perfect for those seeking a convenient urban lifestyle with upscale features.",
        "Neighborhood Description": "Buckhead is a luxury district known for its upscale shopping, fine dining, and high-end residential properties. Residents enjoy a sophisticated environment with access to top-rated schools, exclusive boutiques, and trendy nightlife destinations.",
        "id": "0d44b825-9044-42e6-b09b-ca022fa41454",
        "image_path": "../Data/Images/0d44b825-9044-42e6-b09b-ca022fa41454.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Fells Point",
        "City": "Baltimore",
        "State": "Maryland",
        "Price": "$280,000",
        "Bedrooms": 2,
        "Bathrooms": 1,
        "House Size": "1000 sqft",
        "Description": "Discover urban living at its finest in this stylish condo in the heart of Fells Point. This 2-bedroom unit offers modern amenities, a spacious layout, and stunning city views. Enjoy the vibrant cultural scene, historic charm, and waterfront dining just steps away.",
        "Neighborhood Description": "Fells Point is a historic waterfront community known for its cobblestone streets, eclectic shops, and lively nightlife. Residents enjoy a mix of old-world charm and modern conveniences, with easy access to dining, entertainment, and outdoor activities.",
        "id": "0c1d3603-47e5-4d0a-9997-e9a73152b7d5",
        "image_path": "../Data/Images/0c1d3603-47e5-4d0a-9997-e9a73152b7d5.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Harbor East",
        "City": "Baltimore",
        "State": "Maryland",
        "Price": "$500,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Luxury living awaits in this stunning 3-bedroom condo in Harbor East. Boasting high-end finishes, panoramic harbor views, and top-of-the-line appliances, this spacious unit offers a blend of elegance and comfort. Experience the best of city living in this exclusive waterfront community.",
        "Neighborhood Description": "Harbor East is a premier neighborhood offering upscale shopping, fine dining, and waterfront living. With a mix of residential, retail, and entertainment options, residents enjoy a vibrant urban lifestyle with easy access to parks, cultural attractions, and transportation.",
        "id": "f2a1c9db-9fa6-4ebf-93ac-9ff763819f90",
        "image_path": "../Data/Images/f2a1c9db-9fa6-4ebf-93ac-9ff763819f90.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Beacon Hill",
        "City": "Boston",
        "State": "Massachusetts",
        "Price": "$3,500,000",
        "Bedrooms": 7,
        "Bathrooms": 5,
        "House Size": "8000 sqft",
        "Description": "Experience unparalleled luxury in this stunning Beacon Hill estate. This sophisticated property boasts exquisite craftsmanship, high-end finishes, and panoramic city views. With 7 bedrooms, 5 bathrooms, and 8000 sqft of living space, this home offers the perfect blend of elegance and modern amenities. Enjoy the convenience of urban living while basking in the tranquility of this prestigious neighborhood.",
        "Neighborhood Description": "Beacon Hill is known for its historic charm, cobblestone streets, and elegant townhouses. This sought-after neighborhood offers a mix of boutique shops, upscale restaurants, and cultural attractions. Residents enjoy easy access to Boston Common, the Charles River Esplanade, and top-rated schools. With its convenient location and timeless beauty, Beacon Hill is the epitome of luxury living in Boston.",
        "id": "aa518ac0-9dcd-483f-960e-a47f810f4a2e",
        "image_path": "../Data/Images/aa518ac0-9dcd-483f-960e-a47f810f4a2e.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Sugar House",
        "City": "Salt Lake City",
        "State": "Utah",
        "Price": "$250,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Charming 1-bedroom condo in the heart of Sugar House. This cozy unit features an open layout, modern kitchen, and a balcony with stunning views. Perfect for a young professional or couple looking for a stylish urban retreat.",
        "Neighborhood Description": "Sugar House is a vibrant neighborhood known for its eclectic mix of shops, restaurants, and local events. Enjoy easy access to parks, cafes, and nightlife, all within a short walk from your doorstep.",
        "id": "e71afac7-a282-4e42-9fc9-96a01ec9ce2d",
        "image_path": "../Data/Images/e71afac7-a282-4e42-9fc9-96a01ec9ce2d.png"
    },
    {
        "Property Type": "Condo",
        "Neighborhood": "Downtown Salt Lake City",
        "City": "Salt Lake City",
        "State": "Utah",
        "Price": "$550,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1600 sqft",
        "Description": "Luxurious 2-bedroom condo in the heart of Downtown Salt Lake City. This spacious unit boasts high-end finishes, panoramic city views, and access to top-notch amenities. Ideal for those seeking a sophisticated urban lifestyle.",
        "Neighborhood Description": "Downtown Salt Lake City offers a dynamic living experience with a mix of cultural attractions, dining options, and entertainment venues. Enjoy the convenience of city living with easy access to public transportation and major employers.",
        "id": "351f0062-3f2e-47a7-8254-9f1956baa0b5",
        "image_path": "../Data/Images/351f0062-3f2e-47a7-8254-9f1956baa0b5.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Broadmoor-Broadway Village",
        "City": "Tucson",
        "State": "Arizona",
        "Price": "$225,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Charming ranch-style home in the desirable Broadmoor-Broadway Village neighborhood of Tucson. This well-maintained property features 3 bedrooms, 2 bathrooms, a spacious living area, and a cozy backyard perfect for relaxation. With 1800 sqft of living space, this home provides a comfortable layout for a growing family or those looking for a peaceful retreat.",
        "Neighborhood Description": "Broadmoor-Broadway Village is a welcoming community known for its tree-lined streets, local parks, and proximity to shopping and dining options. Residents enjoy a strong sense of community and easy access to outdoor activities in the beautiful Arizona landscape.",
        "id": "eeb60b33-25e4-4f82-8400-8215b1df66b1",
        "image_path": "../Data/Images/eeb60b33-25e4-4f82-8400-8215b1df66b1.png"
    },
    {
        "Property Type": "Ranch-Style Home",
        "Neighborhood": "Sam Hughes",
        "City": "Tucson",
        "State": "Arizona",
        "Price": "$375,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Elegant ranch-style home located in the historic Sam Hughes neighborhood of Tucson. This spacious property boasts 4 bedrooms, 3 bathrooms, a gourmet kitchen, and a beautifully landscaped backyard with a pool. With 2300 sqft of living space, this home offers a blend of modern amenities and classic charm, perfect for those seeking both comfort and style.",
        "Neighborhood Description": "Sam Hughes is a prestigious neighborhood known for its historic homes, tree-lined streets, and proximity to the University of Arizona. Residents enjoy a vibrant cultural scene, excellent schools, and easy access to downtown Tucson.",
        "id": "c1bb45ef-e28c-48fb-8881-6bf8c67641e4",
        "image_path": "../Data/Images/c1bb45ef-e28c-48fb-8881-6bf8c67641e4.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Lincoln Park",
        "City": "Chicago",
        "State": "Illinois",
        "Price": "$350,000",
        "Bedrooms": 3,
        "Bathrooms": 2,
        "House Size": "1800 sqft",
        "Description": "Beautiful townhouse in the coveted Lincoln Park neighborhood. This 3-bedroom, 2-bathroom home offers modern amenities with classic charm. The spacious living area is perfect for entertaining, and the master suite provides a peaceful retreat. Enjoy the vibrant local dining and shopping scene just steps away.",
        "Neighborhood Description": "Lincoln Park is known for its tree-lined streets, historic architecture, and proximity to Lake Michigan. Residents enjoy a mix of cultural attractions, trendy boutiques, and renowned restaurants.",
        "id": "ecfee6db-2153-4b58-ae34-8872906d64eb",
        "image_path": "../Data/Images/ecfee6db-2153-4b58-ae34-8872906d64eb.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "West Loop",
        "City": "Chicago",
        "State": "Illinois",
        "Price": "$500,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2300 sqft",
        "Description": "Luxurious townhouse in the vibrant West Loop neighborhood. This 4-bedroom, 3-bathroom home boasts high-end finishes, a gourmet kitchen, and a private rooftop deck with stunning city views. The open floor plan and chic design make this an ideal urban oasis.",
        "Neighborhood Description": "West Loop is a trendy area known for its upscale dining, art galleries, and lively atmosphere. The neighborhood has a mix of historic buildings and modern amenities, attracting young professionals and food enthusiasts.",
        "id": "3b24a5a9-48f0-4dc1-b1d7-507aac9b6400",
        "image_path": "../Data/Images/3b24a5a9-48f0-4dc1-b1d7-507aac9b6400.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Sam Hughes",
        "City": "Tucson",
        "State": "Arizona",
        "Price": "$55,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Cozy mobile home located in the desirable Sam Hughes neighborhood. This well-maintained property offers a comfortable living space with a nice kitchen, a bedroom, and a bathroom. Perfect for those seeking a simple yet convenient lifestyle in a vibrant community.",
        "Neighborhood Description": "Sam Hughes is known for its historic charm, tree-lined streets, and proximity to the University of Arizona. Residents enjoy a mix of local shops, restaurants, and cultural attractions, making it a desirable place to call home.",
        "id": "92c59c7a-38aa-41f4-af8f-a108e7e91858",
        "image_path": "../Data/Images/92c59c7a-38aa-41f4-af8f-a108e7e91858.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Barrio Viejo",
        "City": "Tucson",
        "State": "Arizona",
        "Price": "$125,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1000 sqft",
        "Description": "Charming mobile home in the historic Barrio Viejo neighborhood. This updated property features two bedrooms, two bathrooms, a spacious living area, and a well-equipped kitchen. Enjoy the blend of modern amenities with the rich history of the area.",
        "Neighborhood Description": "Barrio Viejo is a vibrant and eclectic neighborhood known for its colorful adobe homes, art galleries, and proximity to downtown Tucson. Experience the unique blend of culture, history, and community in this dynamic neighborhood.",
        "id": "6de8ad40-7e0b-4164-bea3-ae3ae3047b3c",
        "image_path": "../Data/Images/6de8ad40-7e0b-4164-bea3-ae3ae3047b3c.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Greenwich Village",
        "City": "New York City",
        "State": "New York",
        "Price": "$200,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "700 sqft",
        "Description": "Charming one-bedroom apartment located in the heart of Greenwich Village. This cozy unit features hardwood floors, updated kitchen appliances, and plenty of natural light. Perfect for a young professional or couple looking to immerse themselves in the vibrant NYC lifestyle.",
        "Neighborhood Description": "Greenwich Village is known for its tree-lined streets, historic brownstones, trendy boutiques, and diverse dining options. Enjoy easy access to Washington Square Park, NYU campus, and a vibrant arts scene.",
        "id": "8d295c4b-3dcc-4c5a-9027-56fca3abeccf",
        "image_path": "../Data/Images/8d295c4b-3dcc-4c5a-9027-56fca3abeccf.png"
    },
    {
        "Property Type": "One-Bedroom Apartment",
        "Neighborhood": "Upper East Side",
        "City": "New York City",
        "State": "New York",
        "Price": "$250,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "900 sqft",
        "Description": "Spacious two-bedroom apartment in the prestigious Upper East Side neighborhood. This elegant unit boasts modern finishes, a private balcony with city views, and ample closet space. Ideal for those seeking a sophisticated urban retreat.",
        "Neighborhood Description": "The Upper East Side is synonymous with luxury living, upscale shopping, renowned museums like the Met and Guggenheim, and top-rated restaurants. Enjoy a blend of culture, convenience, and sophistication.",
        "id": "635c1e0b-8ae0-4907-a33d-5cb036a49cad",
        "image_path": "../Data/Images/635c1e0b-8ae0-4907-a33d-5cb036a49cad.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Kahala",
        "City": "Honolulu",
        "State": "Hawaii",
        "Price": "$4,500,000",
        "Bedrooms": 8,
        "Bathrooms": 5,
        "House Size": "10,000 sqft",
        "Description": "Indulge in luxury living in this exquisite estate in the prestigious Kahala neighborhood of Honolulu. This stunning 8-bedroom mansion boasts elegant design, high-end finishes, and breathtaking ocean views. With a spacious living area of 10,000 sqft, this home offers the perfect blend of comfort and sophistication, ideal for those seeking the ultimate retreat in paradise.",
        "Neighborhood Description": "Kahala is known for its upscale ambiance, with beautiful palm-lined streets and lavish residences. Residents enjoy easy access to pristine beaches, luxury shopping, and top-rated restaurants, making it one of the most desirable neighborhoods in Honolulu.",
        "id": "66f0546f-de77-47d5-80b9-7ca662299c42",
        "image_path": "../Data/Images/66f0546f-de77-47d5-80b9-7ca662299c42.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Beverly Hills",
        "City": "Los Angeles",
        "State": "California",
        "Price": "$4,500,000",
        "Bedrooms": 8,
        "Bathrooms": 6,
        "House Size": "10,000 sqft",
        "Description": "Experience unparalleled luxury in this exquisite estate located in the prestigious neighborhood of Beverly Hills. This magnificent property boasts 8 bedrooms, 6 bathrooms, and 10,000 sqft of opulent living space. From the grand entrance to the lush backyard with a pool and spa, every detail has been meticulously crafted for the most discerning buyer.",
        "Neighborhood Description": "Beverly Hills is synonymous with luxury and sophistication. Surrounded by upscale boutiques, fine dining establishments, and celebrity homes, this neighborhood offers a lifestyle of prestige and glamour. Enjoy unparalleled privacy and security in this exclusive enclave.",
        "id": "d09d13b6-805f-4ca4-bbbd-376bca350fe8",
        "image_path": "../Data/Images/d09d13b6-805f-4ca4-bbbd-376bca350fe8.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Bel Air",
        "City": "Los Angeles",
        "State": "California",
        "Price": "$3,200,000",
        "Bedrooms": 6,
        "Bathrooms": 5,
        "House Size": "8,500 sqft",
        "Description": "Embrace the epitome of luxury living in this stunning estate nestled in the coveted neighborhood of Bel Air. With 6 bedrooms, 5 bathrooms, and 8,500 sqft of lavish living space, this residence offers a seamless blend of elegance and comfort. Enjoy panoramic views, a gourmet kitchen, and resort-style amenities.",
        "Neighborhood Description": "Bel Air is renowned for its exclusive estates and breathtaking views. Home to affluent residents and iconic properties, this neighborhood exudes sophistication and charm. Experience a tranquil oasis in the heart of the city, surrounded by lush landscapes and unparalleled elegance.",
        "id": "c438bbb5-2dcf-4a63-8759-64159b547311",
        "image_path": "../Data/Images/c438bbb5-2dcf-4a63-8759-64159b547311.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Ironbound",
        "City": "Newark",
        "State": "New Jersey",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Cozy studio apartment in the vibrant Ironbound neighborhood of Newark. This efficiently designed space offers modern amenities and a convenient location. Perfect for a single professional or student looking for a comfortable living space.",
        "Neighborhood Description": "The Ironbound neighborhood is known for its diverse community, excellent restaurants, and lively atmosphere. Residents enjoy easy access to transportation options, local shops, and cultural events.",
        "id": "0672f917-0904-4881-b8c2-25634f2367e1",
        "image_path": "../Data/Images/0672f917-0904-4881-b8c2-25634f2367e1.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "University Heights",
        "City": "Newark",
        "State": "New Jersey",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Charming studio apartment located in the desirable University Heights neighborhood of Newark. Featuring a spacious layout and natural light, this cozy unit is ideal for a young professional or investor seeking a great rental property.",
        "Neighborhood Description": "University Heights is a vibrant and diverse neighborhood with close proximity to major universities, parks, and cultural attractions. Residents enjoy a mix of historic architecture and modern conveniences.",
        "id": "c51176fb-33ec-4636-a6bd-518043a7d733",
        "image_path": "../Data/Images/c51176fb-33ec-4636-a6bd-518043a7d733.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Forest Hill",
        "City": "Newark",
        "State": "New Jersey",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment offering upscale living in the prestigious Forest Hill neighborhood of Newark. This elegantly designed unit features high-end finishes and panoramic views, perfect for discerning buyers seeking sophistication.",
        "Neighborhood Description": "Forest Hill is an exclusive neighborhood known for its historic mansions, tree-lined streets, and tranquil ambiance. Residents enjoy a sense of privacy while still being close to downtown amenities.",
        "id": "1255c433-ae48-45b0-953e-8ead6d750745",
        "image_path": "../Data/Images/1255c433-ae48-45b0-953e-8ead6d750745.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Logan Square",
        "City": "Chicago",
        "State": "Illinois",
        "Price": "$60,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "400 sqft",
        "Description": "Cozy studio apartment located in the vibrant Logan Square neighborhood. This charming unit offers a functional living space with modern amenities. Perfect for a single professional or student seeking urban living at an affordable price.",
        "Neighborhood Description": "Logan Square is known for its trendy boutiques, diverse dining options, and artistic community. Enjoy easy access to parks, coffee shops, and public transportation, making it a sought-after location for those who value convenience and culture.",
        "id": "546b70c5-c76c-41b3-b710-1f51edb7d100",
        "image_path": "../Data/Images/546b70c5-c76c-41b3-b710-1f51edb7d100.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "River North",
        "City": "Chicago",
        "State": "Illinois",
        "Price": "$180,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "800 sqft",
        "Description": "Luxurious studio apartment in the upscale River North neighborhood. This sophisticated unit features high-end finishes, stunning city views, and a spacious layout. Ideal for a discerning buyer looking for elegance and comfort in the heart of the city.",
        "Neighborhood Description": "River North is a premier destination for art galleries, fine dining, and upscale shopping. Experience a vibrant nightlife scene, beautiful riverwalks, and proximity to cultural attractions, making it a prime location for those seeking a dynamic urban lifestyle.",
        "id": "ab757b8c-f65e-45ea-8ff9-229c2d3aac76",
        "image_path": "../Data/Images/ab757b8c-f65e-45ea-8ff9-229c2d3aac76.png"
    },
    {
        "Property Type": "Single-Family Home",
        "Neighborhood": "Federal Hill",
        "City": "Baltimore",
        "State": "Maryland",
        "Price": "$550,000",
        "Bedrooms": 4,
        "Bathrooms": 3,
        "House Size": "2500 sqft",
        "Description": "Welcome to this charming single-family home in the desirable neighborhood of Federal Hill. This beautifully maintained property features 4 spacious bedrooms, 3 bathrooms, and a generous living space of 2500 sqft. Enjoy the modern amenities and the historic charm this home has to offer. Perfect for families looking for a blend of comfort and style.",
        "Neighborhood Description": "Federal Hill is a vibrant neighborhood known for its historic architecture, bustling streets lined with shops and restaurants, and close proximity to local parks and waterfront attractions. Residents enjoy a lively urban atmosphere with easy access to amenities and a strong sense of community.",
        "id": "3ec1c948-6782-47dc-a6d1-067bd8e51163",
        "image_path": "../Data/Images/3ec1c948-6782-47dc-a6d1-067bd8e51163.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Greenwich Village",
        "City": "New York City",
        "State": "New York",
        "Price": "$120,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "500 sqft",
        "Description": "Charming studio apartment located in the historic Greenwich Village. This cozy space features a modern kitchen, ample natural light, and a convenient location near trendy cafes and boutiques. Perfect for those seeking a vibrant city lifestyle in a picturesque neighborhood.",
        "Neighborhood Description": "Greenwich Village is a lively and artistic neighborhood known for its tree-lined streets, historic brownstones, and vibrant cultural scene. Residents enjoy a mix of upscale dining, cozy cafes, and eclectic shops, creating a bohemian charm unique to this area.",
        "id": "9e769563-c1a0-4ccc-8695-fd618f62031b",
        "image_path": "../Data/Images/9e769563-c1a0-4ccc-8695-fd618f62031b.png"
    },
    {
        "Property Type": "Studio Apartment",
        "Neighborhood": "Upper East Side",
        "City": "New York City",
        "State": "New York",
        "Price": "$160,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "650 sqft",
        "Description": "Luxurious studio apartment in the prestigious Upper East Side. This elegant unit boasts high-end finishes, a spacious layout, and stunning views of the city skyline. Enjoy easy access to Central Park, world-class museums, and upscale shopping destinations.",
        "Neighborhood Description": "The Upper East Side is synonymous with luxury living, offering upscale boutiques, gourmet restaurants, and renowned cultural institutions. With its tree-lined streets and proximity to Central Park, this neighborhood exudes sophistication and elegance.",
        "id": "4683a85a-4f8f-4c5a-bcd2-ec4be63f6424",
        "image_path": "../Data/Images/4683a85a-4f8f-4c5a-bcd2-ec4be63f6424.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Shadyside",
        "City": "Pittsburgh",
        "State": "Pennsylvania",
        "Price": "$3,500,000",
        "Bedrooms": 7,
        "Bathrooms": 5,
        "House Size": "8000 sqft",
        "Description": "Experience unparalleled luxury living in this exquisite estate in the prestigious Shadyside neighborhood. This grand mansion boasts meticulous craftsmanship, high-end finishes, and stunning architectural details. Featuring 7 bedrooms, 5 bathrooms, and sprawling over 8000 sqft, this home offers the epitome of elegance and sophistication. Indulge in the lavish amenities and expansive living spaces perfect for entertaining guests or relaxing in style.",
        "Neighborhood Description": "Shadyside is a historic and upscale neighborhood known for its tree-lined streets, beautiful Victorian homes, and vibrant cultural scene. Enjoy the convenience of boutique shopping, fine dining, and proximity to universities and hospitals. With its charming atmosphere and close-knit community, Shadyside offers a sophisticated urban lifestyle with a touch of old-world charm.",
        "id": "ad9748d3-022f-471f-a824-48a2e741365d",
        "image_path": "../Data/Images/ad9748d3-022f-471f-a824-48a2e741365d.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "East Nashville",
        "City": "Nashville",
        "State": "Tennessee",
        "Price": "$250,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1,200 sqft",
        "Description": "Welcome to this charming townhouse in the heart of East Nashville. This well-maintained property features two spacious bedrooms, two bathrooms, and a cozy living area. The kitchen is updated with modern appliances, and the backyard is perfect for relaxing or entertaining. Enjoy the vibrant neighborhood filled with local restaurants, shops, and parks.",
        "Neighborhood Description": "East Nashville is known for its artistic vibe and eclectic community. You'll find a mix of historic homes, trendy eateries, and music venues in this vibrant neighborhood.",
        "id": "3e7033ef-dc92-4391-8888-76a2c0bbf63c",
        "image_path": "../Data/Images/3e7033ef-dc92-4391-8888-76a2c0bbf63c.png"
    },
    {
        "Property Type": "Townhouse",
        "Neighborhood": "Germantown",
        "City": "Nashville",
        "State": "Tennessee",
        "Price": "$450,000",
        "Bedrooms": 3,
        "Bathrooms": 3,
        "House Size": "2,000 sqft",
        "Description": "Experience luxury living in this stunning townhouse located in the sought-after Germantown neighborhood. Boasting three bedrooms, three bathrooms, and ample living space, this home offers modern amenities and elegant finishes. The rooftop terrace provides panoramic views of the city skyline, perfect for relaxation and entertainment. Live in style in this prestigious neighborhood.",
        "Neighborhood Description": "Germantown is a historic neighborhood known for its upscale dining options, boutique shops, and proximity to downtown Nashville. Residents enjoy a blend of old-world charm and contemporary sophistication.",
        "id": "187e2ffb-af11-4e26-aa89-41a899e85817",
        "image_path": "../Data/Images/187e2ffb-af11-4e26-aa89-41a899e85817.png"
    },
    {
        "Property Type": "Luxury Estate",
        "Neighborhood": "Cherry Creek",
        "City": "Denver",
        "State": "Colorado",
        "Price": "$3,500,000",
        "Bedrooms": 7,
        "Bathrooms": 5,
        "House Size": "8000 sqft",
        "Description": "Discover unparalleled luxury in this magnificent estate nestled in the prestigious Cherry Creek neighborhood. This sophisticated residence features exquisite design, high-end finishes, and expansive living spaces perfect for both relaxation and entertaining. The meticulously landscaped grounds offer a private oasis in the heart of the city. Experience the epitome of luxury living with this remarkable property.",
        "Neighborhood Description": "Cherry Creek is known for its upscale shops, art galleries, and fine dining establishments. The neighborhood exudes a vibrant atmosphere with tree-lined streets and beautiful parks, making it a desirable location for those seeking a blend of luxury and convenience.",
        "id": "4595cf6a-ef66-4b3d-805b-5c068c59ee21",
        "image_path": "../Data/Images/4595cf6a-ef66-4b3d-805b-5c068c59ee21.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Kaimuki",
        "City": "Honolulu",
        "State": "Hawaii",
        "Price": "$70,000",
        "Bedrooms": 1,
        "Bathrooms": 1,
        "House Size": "600 sqft",
        "Description": "Charming mobile home located in the vibrant Kaimuki neighborhood of Honolulu. This cozy 1-bedroom, 1-bathroom home offers a comfortable living space with a compact yet functional layout. Enjoy the convenience of urban living with easy access to local shops, dining, and parks. Perfect for individuals seeking a low-maintenance lifestyle in a desirable location.",
        "Neighborhood Description": "Kaimuki is a popular residential neighborhood known for its eclectic mix of local eateries, boutique shops, and a strong sense of community. Residents enjoy the convenience of being close to Waikiki while still maintaining a more laid-back atmosphere. With tree-lined streets and a diverse population, Kaimuki offers a unique blend of urban living and local charm.",
        "id": "b2fc94b0-0005-4302-89e2-b93409d83b15",
        "image_path": "../Data/Images/b2fc94b0-0005-4302-89e2-b93409d83b15.png"
    },
    {
        "Property Type": "Mobile Home",
        "Neighborhood": "Pearl City",
        "City": "Honolulu",
        "State": "Hawaii",
        "Price": "$120,000",
        "Bedrooms": 2,
        "Bathrooms": 2,
        "House Size": "1000 sqft",
        "Description": "Spacious mobile home located in the peaceful Pearl City neighborhood of Honolulu. This 2-bedroom, 2-bathroom home features a generous living space with modern finishes and ample natural light. Enjoy the tranquility of suburban living while still being within easy reach of Honolulu's attractions. Ideal for those looking for a comfortable home in a family-friendly community.",
        "Neighborhood Description": "Pearl City is a suburban neighborhood known for its peaceful residential streets and proximity to essential amenities. Residents appreciate the quiet surroundings, well-maintained parks, and top-rated schools in the area. With convenient access to shopping centers, restaurants, and outdoor recreation areas, Pearl City offers a balanced lifestyle for families and professionals alike.",
        "id": "1a8d4b41-37dd-474a-97f8-15da7d87b564",
        "image_path": "../Data/Images/1a8d4b41-37dd-474a-97f8-15da7d87b564.png"
    }
]